[
  {
    "id": "6572b801-c309-4ef9-9bc5-d524a2571ee6",
    "jobTitle": "Software Engineer, Infrastructure",
    "country": "United States",
    "city": "Pittsburgh",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T21:11:35.054Z",
    "experienceLevel": "Not specified",
    "techStack": ["PHP", "Python", "C++", "Java", "Linux"],
    "shortDescription": "Looking for a Software Engineer to enhance the performance, reliability, and maintainability of robotic systems.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Architect, build, and maintain deployment software infrastructure and back-end services. Lead teams to develop reliable software systems. Write and review code, develop documentation, create capacity plans, and debug on robot hardware. Collaborate with cross-functional teams to define technical roadmaps.",
      "qualification_required": {
        "skills": [
          "Higher-level programming languages",
          "Software development",
          "Collaboration with teams"
        ],
        "qualifications": [
          "BS, MS or higher in Computer Science, Robotics, Engineering or related field",
          "Proficiency in PHP, Python, C++, or Java",
          "Experience with web servers, relational databases, and messaging systems"
        ]
      },
      "qualification_preferred": {
        "skills": ["Enterprise security", "Linux OS fundamentals"],
        "qualifications": [
          "Previous experience in roles like Systems Engineer, DevOps Engineer, or Site Reliability Engineer"
        ]
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://job-boards.greenhouse.io/skildai-careers/jobs/4136357008?gh_src=f2d3c1e28us",
    "jobType": "Systems Engineer",
    "salaryMin": "100000",
    "salaryMax": "300000",
    "currency": "USD",
    "rawDescription": "Company Overview\n\nAt Skild AI, we are building the world's first general purpose robotic intelligence that is robust and adapts to unseen scenarios without failing. We believe massive scale through data-driven machine learning is the key to unlocking these capabilities for the widespread deployment of robots within society. Our team consists of individuals with varying levels of experience and backgrounds, from new graduates to domain experts. Relevant industry experience is important, but ultimately less so than your demonstrated abilities and attitude. We are looking for passionate individuals who are eager to explore uncharted waters and contribute to our innovative projects.\n\nPosition Overview\n\nWe are looking for a Software Engineer to enhance the performance, reliability, and maintainability of our cutting-edge robotics systems in deployment. You will design, implement, and maintain software systems for deployment in real-world robotic products. This role involves leading discussions and collaborating with machine learning, deployment, test, and security engineers to ensure seamless integration of our machine learning models into practical applications. You will also define technical roadmaps and drive product and system architecture direction.\n\nResponsibilities\n\n* Architect, build, and maintain deployment software infrastructure and back-end services (e.g., model training infrastructure, AI developer tools, metrics dashboards).\n* Lead teams to develop reliable software systems with robust testing, metrics, and logging mechanisms.\n* Write and review code, develop documentation, create capacity plans, and debug on robot hardware.\n* Collaborate with cross-functional teams to define technical roadmaps and drive the direction of product and system architecture.\n* Share an on-call rotation with the engineering team to ensure system reliability and quick issue resolution.\n\nPreferred Qualifications\n\n* BS, MS or higher degree in Computer Science, Robotics, Engineering or a related field, or equivalent practical experience.\n* Proficiency developing higher-level languages (e.g. PHP, Python, C++, or Java).\n* Experience in configuration and maintenance of applications such as web servers, load balancers, relational databases, storage systems, and messaging systems.\n* Knowledge of Linux OS fundamentals, memory management, and kernel.\n* Experience learning software, frameworks, and APIs.\n* Experience with enterprise security.\n* Previous extensive work experience as a: Systems Engineer, Software Engineer, DevOps Engineer, Network Engineer, Systems Administrator, Linux Administrator, Database Administrator, Site Reliability Engineer (SRE), or similar.\n\nBase Salary Range\n\n$100,000 - $300,000 USD",
    "company": {
      "name": "Skild AI",
      "description": "Building general purpose robotic intelligence.",
      "locations": ["San Francisco, CA"],
      "website": "https://skild.ai",
      "markets": ["Software Development"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHWFkaL3MJqRQ/company-logo_400_400/company-logo_400_400/0/1720503134494/skild_ai_logo?e=1738800000&v=beta&t=DUV9ky-BZsY7pd-_GkQWkqvKju0PpVS4FOx712jnu6k"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "b4879e57-8653-4df8-92bb-15ccd706f159",
    "jobTitle": "Software Developer Engineer/Java",
    "country": "United States",
    "city": "Houston",
    "state": "",
    "locationType": "Hybrid",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T20:45:11.992Z",
    "experienceLevel": "Not specified",
    "techStack": ["Java", "C#", "SQL", "NoSQL", "Git"],
    "shortDescription": "Seeking a Backend Engineer to develop and optimize applications that process and analyze large data sets in the Energy Technology sector.",
    "longDescription": {
      "benefits": [
        "Contemporary work-life balance policies and wellbeing activities",
        "Comprehensive private medical care options",
        "Safety net of life insurance and disability programs",
        "Tailored financial programs",
        "Education Assistance",
        "Generous Parental Leave",
        "Mental Health resources",
        "Dependent Care",
        "Additional elected or voluntary benefit"
      ],
      "responsibilities": "Developing and maintaining a robust software application for processing, analyzing, and storing large datasets created and acquired by robotic pipeline inspection instruments.",
      "qualification_required": {
        "skills": [
          "Proficient in Java",
          "Experience with data storage technologies",
          "Knowledge of data processing techniques and algorithms",
          "Strong understanding of data structures, algorithms, and software design patterns",
          "Version control experience"
        ],
        "qualifications": [
          "Bachelor’s degree in Computer Science, Software Engineering, or a related field",
          "2+ years of experience in software development with a strong emphasis on data processing and storage"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Familiarity with pipeline inspection or similar data-intensive applications",
          "Experience with cloud platforms such as AWS, Azure, or Google Cloud",
          "Knowledge of data science libraries and tools"
        ],
        "qualifications": [
          "Experience working in Agile development environments"
        ]
      }
    },
    "benefits": [
      "Contemporary work-life balance policies and wellbeing activities",
      "Comprehensive private medical care options",
      "Safety net of life insurance and disability programs",
      "Tailored financial programs",
      "Education Assistance",
      "Generous Parental Leave",
      "Mental Health resources",
      "Dependent Care",
      "Additional elected or voluntary benefit"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobs.allyenergy.com/jobs/Full-time/Software-Engineer/Java-Developer/254208",
    "jobType": "Backend Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Software Engineer/Java Developer\n\nAre you a Engineer looking for an interesting and inspiring opportunity?\n\nAre you a graduate and looking for an engineer role, in an Energy Technology company?\n\nBe part of a successful team!\n\nQuest Integrity, a Baker Hughes company, is a global leader in assessing the reliability of critical assets for the energy and process industries. Quest Integrity employs leading-edge technology and subject matter expertise to help companies improve the uptime, performance and longevity of their assets.\n\nPartner with the best\n\nAs a Software Engineer, you will be focused on developing and optimizing applications used to process, analyze, visualize and store large data sets generated by our family of robotic pipeline inspection instruments. The ideal candidate has hands-on experience in software development across multiple programming languages, including Java, and a passion for working with complex datasets.\n\nAs a Software Engineer, You Will Be Responsible For\n\n* Developing and maintaining a robust software application for processing, analyzing, and storing large datasets created and acquired by robotic pipeline inspection instruments.\n* Writing and optimizing code in Java and other languages (e.g., C#) to improve data analysis and workflow, ensuring high performance, accuracy, and efficiency.\n* Implementing and managing data storage solutions that support fast querying, large data volumes, and integrity, using both on-premises and cloud-based options.\n* Collaborating with data scientists and pipeline inspection specialists to understand data requirements and translate them into software requirements and solutions.\n* Creating algorithms and workflows for processing raw inspection data, filtering noise, and generating actionable results for end-users.\n* Ensuring software quality through code reviews, unit testing, and adherence to best coding practices and standards.\n* Documenting software architecture, workflows, and technical decisions to support ongoing maintenance and knowledge sharing across the team.\n* Troubleshooting and resolve issues related to data ingestion, processing, and storage, identifying opportunities for further optimization and automation.\n\nFuel your passion\n\nTo Be Successful In This Role You Will\n\n* Have a Bachelor’s degree in Computer Science, Software Engineering, or a related field, or equivalent experience.\n* Have 2+ years of experience in software development with a strong emphasis on data processing and storage.\n* Be Proficient in Java and familiarity with additional languages such as C#\n* Have Experience with data storage technologies (e.g., SQL, NoSQL, or time-series databases).\n* Have Knowledge of data processing techniques and algorithms, especially related to very large datasets.\n* Have a Strong understanding of data structures, algorithms, and software design patterns.\n* Have Version control experience (e.g., Git) and familiarity with CI/CD pipelines. \n\nPreferred Qualifications\n\n* Familiarity with pipeline inspection or similar data-intensive applications (e.g., industrial IoT, sensor data).\n* Experience with cloud platforms such as AWS, Azure, or Google Cloud.\n* Knowledge of data science libraries and tools (e.g., MatLab, Simulink, Pandas, NumPy) and understanding of statistical methods.\n* Experience working in Agile development environments. \n\nKey Skills\n\n* Strong problem-solving skills and attention to detail.\n* Ability to work both independently and in collaborative team settings.\n* Excellent communication skills, especially when translating technical concepts to non-technical stakeholders.\n\nWork in a way that works for you\n\nRole\n\nWe recognize that everyone is different and that the way in which people want to work and deliver at their best is different for everyone too. In this role, we can offer the following flexible working patterns:\n\n* Please talk to us about the specific working patterns available when you apply.\n\nWorking with us\n\nOur people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.\n\nWorking for you\n\nOur Inventions Have Revolutionized Energy For Over a Century. But To Keep Going Forward Tomorrow, We Know We Have To Push The Boundaries Today. We Prioritize Rewarding Those Who Embrace Change With a Package That Reflects How Much We Value Their Input. Join Us, And You Can Expect\n\n*  Contemporary work-life balance policies and wellbeing activities\n*  Comprehensive private medical care options\n*  Safety net of life insurance and disability programs\n*  Tailored financial programs\n*  Education Assistance\n*  Generous Parental Leave\n*  Mental Health resources\n*  Dependent Care\n*  Additional elected or voluntary benefit\n\nYou will be eligible to participate in Company-sponsored benefit programs, including health & welfare programs and the Thrift Plan (401k). You will have a choice of coverage options that best suit your needs. Coverage options and contribution amounts are related to your benefit elections, base salary level, and specific requirements of each of these plans.\n\nThis position is eligible for our comprehensive and competitive benefits package, which can be found here, and is further eligible for additional forms of compensation such as bonuses subject to the terms of the applicable benefit plans or policies.\n\nAbout Us\n\nWe are an energy technology company that provides solutions to energy and industrial customers worldwide. Built on a century of experience and conducting business in over 120 countries, our innovative technologies and services are taking energy forward – making it safer, cleaner and more efficient for people and the planet.\n\nJoin Us\n\nAre you seeking an opportunity to make a real difference in a company that values innovation and progress? Join us and become part of a team of people who will challenge and inspire you! Let’s come together and take energy forward.\n\nBaker Hughes Company is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.",
    "company": {
      "name": "ALLY Energy",
      "description": "We accelerate the connections, jobs, and skills to power an equitable workforce. We give you the edge you need to develop yourself, your team, and your company to address the world's global energy needs.\n\nALLY Energy is the talent and culture platform, leveraging AI for Good to power the energy workforce of the future™. \n\nNearly 2,400 companies in oil and gas, solar, wind, power and utilities, biofuels, hydrogen, geothermal, carbon capture, and climate tech are registered on the platform with a reach of 100,000+ professionals globally.",
      "locations": ["Traverse City, MI"],
      "website": "https://allyenergy.com",
      "markets": ["Technology, Information and Media"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQHlSsRMz5wFAA/company-logo_400_400/company-logo_400_400/0/1689644287624/allyenergy_logo?e=1739404800&v=beta&t=87qN7g0FDSpPeaEtOnXPQHxbWk4_2hwuYFbat-sPc2A"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "6b95fb5f-4be7-43c1-bbdd-f6de39f81877",
    "jobTitle": "Software Engineer III - Scala",
    "country": "United States",
    "city": "Stamford ",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T20:40:09.023Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Scala",
      "Java",
      "Python",
      "SQL",
      "NoSQL",
      "AWS",
      "Spring Framework",
      "Linux",
      "Unix",
      "Docker",
      "Kubernetes"
    ],
    "shortDescription": "Spectrum is seeking a Mid-Level Backend Engineer specializing in Scala to enhance and maintain the Subscriber Focus application as part of their Platform Software Development team.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Design and implement new functionality, apply object-oriented principles, understand SDLC processes, create and execute test plans, develop software independently, and maintain technical documentation.",
      "qualification_required": {
        "skills": [
          "Ability to read, write, speak and understand English",
          "Demonstrated knowledge of one major programming language/tool",
          "Knowledge of coding language and syntax",
          "Knowledge of environments, docker images, and cloud-native app development"
        ],
        "qualifications": [
          "BA/BS in Information Technology, Computer Science, or related field",
          "1-3 years in Database Management Systems, coding, and software design"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Coding, testing, designing software using Java, Scala, Python",
          "SQL/NoSQL Database development",
          "Cloud-based development (ideally AWS)",
          "Shell Scripting",
          "Automated testing"
        ],
        "qualifications": [
          "1-3 years in Spring Framework and Linux/Unix development",
          "Some knowledge of caching, monitoring technologies, API documentation, and CI/CD automation"
        ]
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobs.spectrum.com/job/-/-/4673/72648502976?utm_source=linkedIn&utm_medium=job-listings&utm_campaign=brand&utm_term=RD-TA",
    "jobType": "Backend Engineer",
    "salaryMin": "78900",
    "salaryMax": "139500",
    "currency": "USD",
    "rawDescription": "Spectrum’s Product and Technology team creates, develops, and operates the nation’s fastest mobile service, most reliable Internet service, most viewed live TV app, and the most advanced WiFi, serving millions of users and devices. We are transforming the next era of connectivity and entertainment experiences. Our goal in the Video Delivery Organization is to help Spectrum succeed by providing services needed to best deliver our video services in support of our business. The Platform Software Development team is responsible for developing various software platforms in support of video delivery, including software for dynamic ad Insertion and subscriber audience targeting. The Scala Software Engineer III will work on the Subscriber Focus application contributing to the maintenance and enhancement of the application, through a multifaceted role involving design, development, testing, data analysis, ETL refinement, and support.\n\nMajor Duties And Responsibilities\n\nActively and consistently supports all efforts to simplify and enhance the customer experience.\n\nDesign and implement new functionality that is testable and performant with limited oversight and guidance following best practices and approved code patterns\n\nApply object oriented and computer science fundamental principles to coding tasks.\n\nUnderstand and apply different SDLC processes, particularly Agile and Scrum; participate fully in Scrum rituals.\n\nUnderstand and apply applicable technology security and industry regulatory and legal compliance considerations.\n\nIdentify fixes to defects raised.\n\nCreate and execute test plans and ensures code coverage.\n\nRaise defects in code reviews.\n\nProvide an LOE on a project / feature level.\n\nDevelop software independently and write testable and performant code.\n\nContribute to technical requirements and technical design documents.\n\nCollaborate with other team members to identify and solve technical problems.\n\nRespond to customer inquiries around the behavior of the developed software.\n\nDevelop and maintain technical documentation.\n\nEnsure legal, regulatory, process, and security compliance of the code contributed to their application.\n\nRequired Qualifications\n\nRequired Skills/Abilities and Knowledge\n\n* Ability to read, write, speak and understand English \n* Demonstrated knowledge of one major programming language/tool \n* Demonstrated knowledge of coding language and syntax, usage of functions and object-oriented patterns \n* Knowledge of environments, docker images, container runtimes, and cloud native app development \n* Knowledge of dependent systems, e.g., up/downstream APIs, clients, data stores, CI/CD Pipelines \n* Knowledge of design patterns and frameworks \n* Ability to work on problems of moderate scope where analysis of situations or data requires a review of a variety of factors \n* Exercises judgment within defined procedures and practices to determine appropriate action \n* Ability to apply company policies and procedures to resolve a variety of issues\n* Ability to work under general instructions on routine work, detailed instructions on new projects or assignments\n* Ability to break down assigned projects into manageable tasks and completes within a given timeframe \n* Ability to multi-task and prioritize effectively without oversight \n* Showcases Project /Feature level work to their team and technical leadership Basic negotiation skills\n\nRequired Education\n\n* BA/BS in Information Technology, Computer Science, related field or equivalent combination of education and experience\n\nRequired Related Work Experience And Number Of Years\n\n* Database Management Systems – 1-3\n* Coding, testing and designing software – 1-3 \n* Software Development Methodologies – 1-3\n\nPreferred Related Work Experience And Number Of Years\n\n* Coding, testing, designing software using Java, Scala, Python - 1-3+ years\n* SQL/NoSQL Database development - 1-3+ years\n* Cloud based development, ideally AWS - 1-3+ years\n* Spring Framework - 1-3+ years\n* Linux/Unix development - 1-3+ years\n* Shell Scripting - 1-3+ years\n* ETL development - 1+ years\n* Automated testing - 1+ years\n* Solid Understanding of Object Oriented Principles\n* Some knowledge of caching architectures, particularly Redis\n* Some knowledge of AWS managed services\n* Some knowledge of containerization and container orchestration, (Docker, Kubernetes, Helm, Istio, Argo, etc).\n* Some knowledge of monitoring technologies (Splunk, Instana, Datadog, Prometheus, etc).\n* Some knowledge of API documentation, especially Swagger (OpenAPI)\n* Some functional knowledge of CI/CD automation (Jenkins, Gitlab)\n\nWORKING CONDITIONS\n\n* Office environment\n\nESW342 2024-43044 2024\n\nHere, employees don’t just have jobs, they build careers. That’s why we believe in offering a comprehensive pay and benefits package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant’s criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2024-11-15 06:38 PM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between  $78,900.00 and $139,500.00. The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nGet to Know Us Charter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet®, TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you’re joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most. Watch this video to learn more.\n\nWho You Are Matters Here We’re committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets. Learn about our inclusive culture.",
    "company": {
      "name": "Spectrum",
      "description": "Charter Communications, Inc. (NASDAQ: CHTR) is a leading broadband connectivity company and cable operator with services available to more than 57 million homes and businesses in 41 states through its Spectrum brand. Over an advanced communications network, the company offers a full range of state-of-the-art residential and business services including Spectrum Internet®, TV, Mobile and Voice.\n\nFor small and medium-sized companies, Spectrum Business® delivers the same suite of broadband products and services coupled with special features and applications to enhance productivity, while for larger businesses and government entities, Spectrum Enterprise provides highly customized, fiber-based solutions. Spectrum Reach® delivers tailored advertising and production for the modern media landscape. The company also distributes award-winning news coverage, sports and high-quality original programming to its customers through Spectrum Networks. More information about Charter can be found at corporate.charter.com. To view our privacy policy, please visit: https://www.spectrum.com/policies/your-privacy-rights",
      "locations": ["Greenwood Village, CO"],
      "website": "https://spectrum.com",
      "markets": ["Telecommunications"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHlC_6PtT8TSg/company-logo_400_400/company-logo_400_400/0/1729536250976/spectrum_logo?e=1739404800&v=beta&t=vZrxTW8W_IoU99IJE7fxGiEwLp8zVPflFPPYK7Mq6tE"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "3c8ddcbc-aaed-467c-917d-208cb96a5def",
    "jobTitle": "Senior  Full Stack Engineer    $120K  -  $160K    Remote",
    "country": "India",
    "city": "Gurugram",
    "state": "",
    "locationType": "Remote",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T20:33:04.059Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "React",
      "Material UI",
      "Chakra UI",
      "Node.js",
      "Go",
      "Redis",
      "SQL",
      "NoSQL"
    ],
    "shortDescription": "We are seeking a Full Stack Engineer who is passionate about building robust, scalable applications and brings substantial experience in both front-end and back-end development.",
    "longDescription": {
      "benefits": [
        "Competitive salary",
        "Early-stage equity",
        "Flexible work environment",
        "Unlimited PTO",
        "Opportunities for career growth"
      ],
      "responsibilities": "Develop and maintain both front-end and back-end components of our application, ensuring seamless integration and optimal performance. Collaborate with product managers and designers from initial concept through to deployment, translating ideas into functional and user-friendly solutions. Optimize application performance, security, and scalability to enhance the overall user experience and meet business goals. Participate in code reviews, contribute to best practices, and continuously improve development processes. Stay abreast of emerging technologies and industry trends, integrating new tools and methodologies to keep our tech stack modern and efficient. Troubleshoot and resolve complex technical issues, providing timely solutions and maintaining system reliability.",
      "qualification_required": {
        "skills": [
          "Strong proficiency in React",
          "Solid experience with back-end technologies such as Node.js and Go",
          "Exceptional problem-solving skills",
          "Proven ability to work collaboratively with cross-functional teams",
          "A track record of delivering high-quality, maintainable code"
        ],
        "qualifications": []
      },
      "qualification_preferred": {
        "skills": [],
        "qualifications": []
      }
    },
    "benefits": [
      "Competitive salary",
      "Early-stage equity",
      "Flexible work environment",
      "Unlimited PTO",
      "Opportunities for career growth"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.linkedin.com/jobs/view/4068730987/",
    "jobType": "Full Stack Developer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Our Client is an early-stage startup that is on a mission to democratize the future of AI. Through our first product, we provide universal access to public web data, and a system where ordinary people can participate in the process - and share in the benefits.\n\nThis project is for those who lead with initiative, seek to challenge themselves and thrive on curiosity.\n\nWe operate with a lean, highly motivated team who revel in the responsibility that comes with autonomy. We have a flat organizational structure, the people making decisions are also the ones implementing them. We are driven by ambitious goals and a strong sense of urgency. Leadership is given to those who show initiative, consistently deliver excellence and bring the best out of those around them. Join us if you want to set the tone for a fair and equitable internet.\n\nThe Role.\n\nWe are seeking a Full Stack Engineer who is passionate about building robust, scalable applications and brings substantial experience in both front-end and back-end development. You will join a dynamic, forward-thinking team and play a pivotal role in creating and optimizing our platform, supporting our vision for an integrated and cutting-edge user experience.\n\nWho You Are.\n\n* Strong proficiency in React (Material UI, Chakra UI).\n* Solid experience with back-end technologies such as Node.js, Go, Redis and familiarity with databases (SQL and NoSQL).\n* Exceptional problem-solving skills and a deep understanding of both client-side and server-side architecture.\n* Proven ability to work collaboratively with cross-functional teams, including designers, product managers, and other engineers.\n* A track record of delivering high-quality, maintainable code and contributing to significant projects.\n\nWhat You'll Be Doing.\n\n* Develop and maintain both front-end and back-end components of our application, ensuring seamless integration and optimal performance.\n* Collaborate with product managers and designers from initial concept through to deployment, translating ideas into functional and user-friendly solutions.\n* Optimize application performance, security, and scalability to enhance the overall user experience and meet business goals.\n* Participate in code reviews, contribute to best practices, and continuously improve development processes.\n* Stay abreast of emerging technologies and industry trends, integrating new tools and methodologies to keep our tech stack modern and efficient.\n* Troubleshoot and resolve complex technical issues, providing timely solutions and maintaining system reliability.\nWhy Work With Us.\n\n* Opportunity. We are at at the forefront of developing a web-scale crawler and knowledge graph that allows ordinary people to participate in the process, and share in the benefits, of AI development.\n* Culture. We’re a lean team working together to achieve a very ambitious goal of improving access to public web data and distributing the value of AI to the people. We prioritize low ego and high output.\n* Compensation. You’ll receive a competitive salary and equity package.\n* Resources and growth. We’re well-capitalized, with backing from leading venture funds like Polychain, Tribe, NLH, Hack, BH Digital, and more. We keep a lean team, and this is a rare opportunity to join. You’ll learn a lot and grow as our company scales.\nCompensation & Package\n\n* Competitive salary\n* Early-stage equity\n* Flexible work environment\n* Unlimited PTO\n* Opportunities for career growth\nInterview Process\n\n1\n\nRecruiter / HR Call\n\nInitial Screening call with HR\n\n2\n\nTechnical Interview\n\n3\n\nFounder / CEO Interview",
    "company": {
      "name": "GroRapid Labs",
      "description": "At Grorapid Labs, we believe in developing software with the use of modern technology and user-friendly design to offer solutions that exceed the client's expectations. Whether you're a startup that wants to develop a transforming app or an established organization looking to better optimize the processes, we're here to help you make your idea a reality.\n\nWe are a development agency that provides you with a wide range of services such as SAAS development, mobile app development, No-Code solutions for MVP, web app development, UI/UX design, and CRM solutions.\nWe server globally when it comes to building products, software and solutions including USA, Europe, UAE and South east countries",
      "locations": ["New York, United States"],
      "website": "https://grorapidlabs.com",
      "markets": ["Software Development"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQHVNVfV5nDZug/company-logo_400_400/company-logo_400_400/0/1700129001844/grorapid_logo?e=1739404800&v=beta&t=KdUTglHKzpQnliQxpZntWFTCBLiB2gY1O721MCq8g5I"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "b3fc3f2e-ae03-4d1c-b1d1-b6e84b82b5d9",
    "jobTitle": "Full Stack Web Developer",
    "country": "United States",
    "city": "",
    "state": "",
    "locationType": "Hybrid",
    "employmentType": "Part-time",
    "dateCreated": "2024-11-09T20:04:17.143Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "HTML",
      "CSS",
      "JavaScript",
      "PHP",
      "MySQL",
      "WordPress",
      "Craft CMS"
    ],
    "shortDescription": "We’re looking for a talented Part-Time Contract Full Stack Web Developer to join our team and help build high-quality, innovative digital solutions for our clients.",
    "longDescription": {
      "benefits": [
        "Medical, dental, vision, short-term disability, and life insurance",
        "401(k) program with employer match",
        "Flexible spending account (FSA) and dependent care FSA",
        "Agency bonus program",
        "Perpetual learning",
        "Flexible scheduling and remote working days",
        "Paid time off",
        "Fridays close early all year"
      ],
      "responsibilities": "Design, develop, and maintain front-end and back-end features for websites, ensuring high performance, responsiveness, and scalability.",
      "qualification_required": {
        "skills": [
          "Proficiency in HTML, CSS, JavaScript, PHP, MySQL",
          "Strong analytical and problem-solving skills",
          "Ability to write clean, efficient code",
          "Strong communication skills"
        ],
        "qualifications": [
          "3-5 years of experience as a Full Stack Developer",
          "Proven expertise in WordPress and Craft CMS"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Experience with version control (e.g., Git)",
          "Familiarity with server environments",
          "Willingness to learn new programming languages and frameworks"
        ],
        "qualifications": [
          "Experience in ecommerce platforms is a plus",
          "Strong organizational skills"
        ]
      }
    },
    "benefits": [
      "Medical, dental, vision, short-term disability, and life insurance",
      "401(k) program with employer match",
      "Flexible spending account (FSA) and dependent care FSA",
      "Agency bonus program",
      "Perpetual learning",
      "Flexible scheduling and remote working days",
      "Paid time off",
      "Fridays close early all year"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://esrock.com/careers/full-stack-web-developer/",
    "jobType": "Full Stack Developer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "**We’re looking for a talented Part\\-Time Contract Full Stack Web Developer to join our team and help build high\\-quality, innovative digital solutions for our clients.** **This role will focus on web development with a strong emphasis on WordPress and Craft CMS.** **If you’re a proactive problem\\-solver with a passion for coding and digital experiences, this opportunity is perfect for you! While this is initially a part\\-time contract role, there is potential to transition to a full\\-time position after 6 months based on performance and business needs.**\n\n**About the Role**\n\n\nThe primary role of the Full Stack Web Developer is to design, develop, and maintain high\\-quality web solutions for the agency and its clients, with a focus on performance, scalability, and security. This role will implement innovative digital experiences across multiple platforms, ensuring seamless integration between front\\-end and back\\-end technologies. This position requires strong technical expertise, particularly in WordPress and Craft CMS, along with a deep understanding of web development best practices. The ideal candidate will be a proactive problem\\-solver who is passionate about creating efficient, user\\-friendly, and visually appealing digital solutions.\n\n\nIn addition to the primary function, there are several other areas of responsibility that a full stack web developer needs to be comfortable with.\n\n* Technical Expertise: Proficiency in front\\-end and back\\-end development, including HTML, CSS, JavaScript, PHP, and MySQL. Deep knowledge of WordPress and Craft CMS is essential.\n* Problem\\-Solving: Strong analytical and problem\\-solving skills with the ability to troubleshoot and debug complex issues.\n* Attention to Detail: Ability to write clean, efficient code and ensure high performance and responsiveness of web applications.\n* Adaptability: Ability to thrive in a fast\\-paced environment, quickly learn new tools and technologies, and adapt to evolving client needs.\n* Collaboration: Strong communication skills and a collaborative attitude, able to work effectively with cross\\-functional teams including designers, content creators, and strategists.\n* Innovative Thinking: Passionate about exploring new technologies and finding creative ways to enhance digital experiences.\n* Project Management: Strong organizational skills, able to manage multiple projects and prioritize tasks to meet deadlines.\n\n**Key Responsibilities and Tasks**\n\n* Web Development: Design, develop, and maintain front\\-end and back\\-end features for websites, ensuring high performance, responsiveness, and scalability.\n* Platform Expertise: Build and customize websites using WordPress and Craft CMS, including developing custom themes, plugins, and modules as needed.\n* API Integration: Integrate third\\-party services and APIs to extend functionality, including payment gateways, social media, and analytics tools.\n* Maintenance: Perform regular maintenance, updates, and optimizations for client websites, ensuring they remain secure, fast, and fully functional.\n* Quality Assurance: Write clean, maintainable code following industry best practices and contribute to code reviews to improve overall code quality.\n* Problem Solving: Identify, diagnose, and resolve technical issues quickly to minimize downtime and disruptions.\n* Collaboration and Communication: Work closely with designers, content creators, and strategists to bring creative ideas to life and ensure alignment on project goals and deliverables.\n* Documentation: Create and maintain technical documentation for projects, including code repositories, user guides, and deployment processes.\n* Digital Innovation: Stay updated on emerging web technologies and trends, bringing new ideas and tools to the team to improve the agency’s digital solutions.\n\n**Desired Qualifications**\n\n* Experience: 3\\-5 years of experience as a Full Stack Developer, with proven expertise in WordPress and Craft CMS. Experience in ecommerce platforms is a plus.\n* Skills: Proficiency in HTML, CSS, JavaScript, PHP, MySQL, and common development frameworks, experience with version control (e.g., Git) and deployment pipelines.\n* Technical Knowledge: Familiarity with server environments, including web hosting, DNS management, and cloud services (e.g., AWS, Azure).\n* Problem\\-Solving: Ability to diagnose and fix bugs, performance issues, and other technical problems.\n* Collaboration: Strong communication skills, with experience working in a team\\-oriented environment.\n* Project Management: Experience managing multiple projects simultaneously, with a focus on delivering on time and within scope.\n* Adaptability: Willingness to learn new programming languages and frameworks as needed.\n\n**Benefits**\n\n* Medical, dental, vision, short\\-term disability, and life insurance\n* 401(k) program with employer match\n* Flexible spending account (FSA) and dependent care FSA\n* Agency bonus program\n* Perpetual learning\n* Flexible scheduling and remote working days\n* Paid time off\n* Fridays close early all year\n",
    "company": {
      "name": "ESROCK PARTNERS",
      "description": null,
      "locations": ["Burr Ridge, IL"],
      "website": "https://esrock.com",
      "markets": [null],
      "jobSources": null,
      "logo": "https://logo.clearbit.com/esrock.com"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "122d6880-814b-4662-abd0-bda4d9ae28db",
    "jobTitle": "Software Engineer / Principal Software Engineer - R10176759",
    "country": "United States",
    "city": "Falls Church",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T19:34:17.544Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "C++",
      "Linux",
      "Object Oriented Programming",
      "Containerization",
      "Kubernetes",
      "DevOps",
      "Python",
      "Distributed Systems",
      "Micro-service Architecture"
    ],
    "shortDescription": "Join Northrop Grumman's Advanced Programs team as a Software Engineer, contributing to innovative technologies in a fast-paced research and development environment.",
    "longDescription": {
      "benefits": [
        "Health insurance coverage",
        "Life and disability insurance",
        "Savings plan",
        "Company paid holidays",
        "Paid time off (PTO)"
      ],
      "responsibilities": "Develop software using Agile methodology, create tools and prototypes, work in cross-discipline teams, and produce technical documentation as required.",
      "qualification_required": {
        "skills": ["C++", "Agile Methodology", "Linux", "DevOps"],
        "qualifications": [
          "Bachelor’s Degree in a STEM discipline preferred from an accredited university and 2 years of related experience or a Master’s degree in a STEM discipline and 0 years of experience, or 6 years of related experience in lieu of a degree."
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Kubernetes",
          "Git",
          "CMake",
          "Embedded Software Development"
        ],
        "qualifications": [
          "Active TS/SCI clearance or eligibility",
          "Experience with tracking algorithms and prediction filters"
        ]
      }
    },
    "benefits": [
      "Health insurance coverage",
      "Life and disability insurance",
      "Savings plan",
      "Company paid holidays",
      "Paid time off (PTO)"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jsv3.recruitics.com/redirect?rx_cid=3658&rx_jobId=R10176759&rx_url=https%3A%2F%2Fwww.northropgrumman.com%2Fjobs%2FEngineering%2FSoftware%2FUnited-States-of-America%2FColorado%2FBoulder%2FR10176759%2Fsoftware-engineer-principal-software-engineer%3Fcode%3DJB-18202%26rx_campaign%3DLinkedin1%26rx_ch%3Dconnector%26rx_group%3D375073%26rx_job%3DR10176759%26rx_medium%3Dpost%26rx_r%3Dnone%26rx_source%3DLinkedin%26rx_ts%3D20241109T181201Z%26rx_vp%3Dslots%26source%3DJB-18202%26utm_audience%3Dprospectivetalentemployees%26utm_campaign%3Dta-general%26utm_content%3Djobfeed%26utm_format%3Dcpl%26utm_medium%3Djobboard%26utm_network%3Dpartnerdirect%26utm_source%3Dlinkedin-jobslots",
    "jobType": "Software Engineer",
    "salaryMin": "87200",
    "salaryMax": "160900",
    "currency": "USD",
    "rawDescription": "Requisition ID: R10176759\n\n* Category: Engineering\n* Location: Boulder, Colorado, United States of America\n* Clearance Type: Secret\n* Telecommute: No- Teleworking not available for this position\n* Shift: Days (United States of America)\n* Travel Required: Yes, 10% of the Time\n* Relocation Assistance: Relocation assistance may be available\n* Positions Available: 1\n\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\n\nThe Launch and Missile Defense Systems (LMDS) division within Northrop Grumman Space Systems is seeking a Software Engineer/Principal Software Engineer. We are excited for you to join our team of qualified and diverse individuals. Our domain provides rewarding work that contributes to the latest advancements being made in the industry. The position is located on-site in Boulder, CO. Boulder is nestled in the foothills of the Rocky Mountains, and only 25 miles from downtown Denver.\n\nPosition Overview\n\nAs a Software Engineer within Advanced Programs, your experience with object-oriented programing will assist in the research, development, and growth of complex software applications. You will be working with a fast-paced and exciting research and development environment that utilizes your familiarity with modern software practices. You are expected to communicate technical information effectively and clearly, and present technical approaches and findings. Our team of motivated technical talent works closely with the end user (and each other) to ensure the direct mission applicability of developed products.\n\nThe Advanced Programs organization pushes the boundaries of innovation, redefines engineering capabilities, and drives advances in efficiently solving mission challenges. Our team is chartered with providing innovative technologies to develop, design, and produce optimized product lines across multiple customers while providing a decisive advantage to the warfighter. Advanced Programs is looking for new members to join our rapidly growing technical team as a Software Engineer based out of Boulder, CO.\n\nEssential Functions\n\n* Software development using Agile Methodology.\n* Tool and prototype development using C++.\n* Work in cross-discipline teams and communicate clearly across various levels of engineers.\n* Technical documentation as required.\n\nSeeking candidates who find satisfaction in working on challenging and diverse assignments in collaborative settings across all levels.\n\nThis requisition may be filled at a higher grade based on qualifications listed below.\n\nBasic Qualifications\n\nThis requisition may be filled at either a Software Engineer or a Principal Software Engineer level.\n\nBasic Qualifications For Software Engineer Or Principal Software Engineer\n\n* Software Engineer: Bachelor’s Degree in a STEM (Science, Technology, Engineering or Mathematics) discipline preferred from an accredited university and 2 years of related experience or a Master’s degree in a STEM discipline and 0 years of experience, or 6 years of related experience in lieu of a degree.\n* Principal Software Engineer: Bachelor’s Degree in a STEM (Science, Technology, Engineering or Mathematics) discipline preferred from an accredited university and 5 years of related experience, or a Master’s degree in a STEM discipline and 3 years experience, or a PhD and 0 years of experience, or 9 years of related experience in lieu of a degree.\n* Applicants must have a current active in-scope U.S. Government DoD issued Secret security clearance at the time of application and is required to start.\n* Ability and willingness to travel up-to 10% to support business needs\n* Experience with modern C++ software language (C++ 20), development tools, and integrated development environments (IDEs) and compilers.\n* Experience developing in Linux environments.\n* Experience with Object Oriented Programming.\n* Experience with Containerization (Podman or Docker)\n* Experience with container orchestration and deployment (Kubernetes and/or Docker Compose)\n* Experience with DevOps and DevSecOps (Jenkins or Git Lab)\n* Familiarity with revision control, documentation, planning, and review systems like Git.\n* Experience with Python\n* Experience with Distributed Systems and Micro-service Architecture & Observability Tools (Graphana, OpenTelemetry, RKE2/K3S/Tanzu/Docker Swarm)\n\nPreferred Qualifications\n\n* Active TS/SCI clearance or eligibility\n* Experience with Git, CMake and Conan\n* Experience or interest in embedded software development and cross compilation (x86 vs. ARM)\n* Experience with tracking algorithms and prediction filters\n* Advanced Experience with Kubernetes (RKE2/K3S/Tanzu) or Docker Swarm\n\nSalary Range: $87,200 - $130,800\n\nSalary Range 2: $107,300 - $160,900\n\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\n\nEmployees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\n\nThe application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.\n\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions.",
    "company": {
      "name": "Northrop Grumman",
      "description": "We are a close-knit community of big thinkers collaborating to keep the world safe. Our passion, creativity and expertise bring next-level technology solutions to life in autonomous systems, cyber, C4ISR, strike, space, and logistics and modernization for our customers around the globe. \n\nOn the Northrop Grumman team, you’ll join our pursuit of excellence immersed in a dynamic culture of innovation and respect. Your unique perspective will help achieve our shared vision for the future of global security. Every step of the way, you'll be supported by world-class training, employee resource groups and a comprehensive benefits package that enables greater health and happiness for you and your family.  \n\nWorldwide and across disciplines, we’re challenging what’s possible for technology to protect people and places from undersea to outer space and into cyberspace. And we see the impact of our performance every day. We are Northrop Grumman, and we work on what matters—now, you too can make a difference.\n \nExplore opportunities in engineering, IT, manufacturing, business management, cybersecurity and more at careers.northropgrumman.com. \n\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA statement, please visit www.northropgrumman.com/EEO. U. S. citizenship is required for most positions.\n\nOur careers site can be found at northropgrumman.com/careers/.  If you are contacted by someone about a job at Northrop Grumman, please verify the opportunity on our Careers site before engaging with that contact. We only schedule interviews with qualified candidates who have applied to a job posting through our Careers site.",
      "locations": ["Linthicum Heights, MD"],
      "website": "https://northropgrumman.com",
      "markets": ["Defense and Space Manufacturing"],
      "jobSources": ["dice"],
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTT_IsOQ-SF8GK641nETEypzK-hq-db4z29PMwl&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "e96df3db-b8f6-465d-9b88-57cd78a475e9",
    "jobTitle": "Full Stack Lead (React JS)",
    "country": "United States",
    "city": "Rockville",
    "state": "",
    "locationType": "Hybrid",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T18:43:10.745Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "React JS",
      "Node.js",
      "Python",
      "Java",
      "RESTful API",
      "microservices",
      "SQL",
      "NoSQL",
      "CI/CD",
      "Git",
      "Docker",
      "AWS",
      "Azure",
      "GCP"
    ],
    "shortDescription": "Lead the design, development, and deployment of a highly interactive, front-end focused platform using React JS.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Lead the design, development, and deployment of a highly interactive, front-end focused platform using React JS. Oversee end-to-end development across the stack, ensuring code quality, performance, and maintainability. Work closely with product owners, UI/UX designers, and other stakeholders to turn requirements into technical solutions. Mentor and guide a team of full-stack developers, conducting code reviews, providing technical feedback, and fostering best practices. Architect scalable solutions, ensuring robust integrations between front-end and back-end services. Manage sprints, prioritize tasks, and contribute to architectural decisions and technical strategy.",
      "qualification_required": {
        "skills": [
          "React JS",
          "Node.js",
          "Python",
          "Java",
          "RESTful API",
          "microservices",
          "SQL",
          "NoSQL",
          "CI/CD",
          "Git",
          "Docker",
          "AWS",
          "Azure",
          "GCP"
        ],
        "qualifications": [
          "5+ years of experience in full-stack development",
          "2+ years in a technical lead or supervisory role",
          "Strong problem-solving skills",
          "Excellent communication and collaboration abilities"
        ]
      },
      "qualification_preferred": {
        "skills": [],
        "qualifications": []
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://tnl2.jometer.com/v2/job?jz=5e1uq6d25957f1c80e59fb1b30f26f50ab8b1FIADOAIAAABQ&utm_medium=feeds%7Cjoveo&utm_source=LinkedIn%20Organic&utm_term=rented&utm_content=prospecting&utm_campaign=all_monster_feeds%7Cus_main%7Cunitedstates-allotherjobs",
    "jobType": "Full Stack Developer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Role and Responsibilities:\n\n> Lead the design, development, and deployment of a highly interactive, front-end focused platform using React JS.\n\n> Oversee end-to-end development across the stack, ensuring code quality, performance, and maintainability.\n\n> Work closely with product owners, UI/UX designers, and other stakeholders to turn requirements into technical solutions.\n\n> Mentor and guide a team of full-stack developers, conducting code reviews, providing technical feedback, and fostering best practices.\n\n> Architect scalable solutions, ensuring robust integrations between front-end and back-end services.\n\n> Manage sprints, prioritize tasks, and contribute to architectural decisions and technical strategy.\n\nQualifications:\n\n> 5+ years of experience in full-stack development, with 2+ years in a technical lead or supervisory role.\n\n> Expertise in React JS, including hooks, context API, state management, and advanced front-end concepts.\n\n> Proficiency in back-end development using Node.js, Python, or Java.\n\n> Solid experience in RESTful API design, microservices architecture, and database management (SQL/NoSQL).\n\n> Familiarity with CI/CD pipelines, Git, Docker, and cloud platforms (AWS, Azure, or GCP).\n\n> Strong problem-solving skills, with the ability to architect solutions that scale.\n\n> Excellent communication and collaboration abilities.",
    "company": {
      "name": "Infinite Computer Solutions",
      "description": "Infinite is a global technology solution provider headquartered in Rockville, Md. The company provides business technology solutions and product engineering services for telecom, hi-tech, healthcare, media & entertainment, insurance, banking & financial services, retail, public sector, travel and transport, and government. With the proprietary frameworks, platforms, accelerators, and domain experts, Infinite has been solving challenges for Fortune 1000 companies since 2001. Core service offerings include business transformation, digitalization, cloud services, application development management services, quality engineering and assurance, product/platform engineering, and infrastructure services. For more information, please visit www.infinite.com.",
      "locations": ["Tampa, FL"],
      "website": "https://infinite.com",
      "markets": ["IT Services and IT Consulting"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQGvWrbRGuYPiA/company-logo_400_400/company-logo_400_400/0/1719257231367/infinite_computer_solutions_logo?e=1739404800&v=beta&t=4ud-jrKsX3Ttv6psz8b1L9dbRGPuufwq6QlGxAoUswQ"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "0d10f678-b3a5-40b8-8597-acec521cf97a",
    "jobTitle": "ERP Software Engineer (Non-Merit)",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T18:40:36.619Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "C#",
      "Java",
      "JavaScript",
      "HTML",
      "XML",
      ".NET",
      "jQuery",
      "AJAX",
      "SQL",
      "PowerBI",
      "SSRS"
    ],
    "shortDescription": "Baltimore County's Office of Information Technology is seeking a highly motivated and talented Backend Engineer for maintaining and supporting various applications.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Develop, maintain, and support a broad range of applications in a fast-paced environment, including integration with third party vendor solutions and COTS applications. Collaborate with engineers to define system functionality and perform complex programming tasks.",
      "qualification_required": {
        "skills": [
          "Thorough knowledge of data processing, office automation, and computer programming",
          "Experience with source control",
          "Strong knowledge of SQL",
          "Financial/HR background"
        ],
        "qualifications": [
          "Bachelor's degree in Business or Computer Science",
          "At least 4 years' experience developing applications",
          "Experience supporting ERP systems"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Experience with design, development, and testing of WCF services",
          "Familiarity with cloud-hosted services",
          "Use of analytics tools"
        ],
        "qualifications": [
          "At least 2 years' experience in administration or support of software applications"
        ]
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.ziprecruiter.com/c/Baltimore-County/Job/ERP-Software-Engineer-(Non-Merit)/-in-Towson,MD?jid=0f1694fd8df5b74f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Backend Engineer",
    "salaryMin": "42.6",
    "salaryMax": "60.81",
    "currency": "USD",
    "rawDescription": "Regular Schedule: 34 hours per week A Non-Merit vacancy exists in the Office of Information Technology. Non-Merit positions are not classified within the Baltimore County Government Classification and Compensation Plan. A list of eligible applicants will be established based on the examination as outlined below.\n\nCurrent and future vacancies occurring in any Office or Department of Baltimore County General Government may be filled from the list of eligible applicants. All interested candidates must apply at this time. List all promotions and changes in job duties due to reclassification as separate work experiences on your application.\n\nApplicants must include the dates of the promotions and reclassifications. Note: Failure to complete all fields of the \"Work Experience\" section of the application will result in your application not being considered. You can attach your resume, transcript(s) or license(s) to your application.\n\nFailure to submit proof of Licenses, Certifications and... Education will result in your application not being considered. Proof of licenses, certifications, and/or education must be submitted with each application. Examples of Duties Definition of Responsibility Baltimore County's Office of Information Technology is looking for highly motivated and talented individuals with experience developing, maintaining, and supporting a broad range of applications.\n\nFamiliarity with Financial/HR/Budget systems is a must, and any familiarity with retirement systems would be helpful. In this role, you will work with experienced engineers to create/maintain complex systems as well as integrate product with COTS (commercial off the shelf) systems. As a fundamental member of the team, you will be working in a fast-paced environment and contributing to all phases of the SDLC (Software Development Life Cycle).\n\nExamples of Essential Duties Under general supervision and as part of a team, you will perform complex programming and analysis tasks (utilizing multiple platforms, languages, and databases) such as: Utilize development tools such as Microsoft Visual Studio, Oracle and (SSMS) SQL Server Management Studio Create, manage and test web services/APIs (Application Programing Interface) with a specific emphasis on integrating with third party vendor solutions Use analytics tools such as PowerBI, SSRS (SQL Server Reporting Services) to develop reports Assist in the successful execution of the SDLC (Software Development Life Cycle) for each project by completing assigned activities including: Defining system functionality based on proposed processes and data requirements Determining data storage requirements Developing programming solutions to meet customer requirements Estimating project resources Defining unit testing requirements and test strategy Executing unit and systems test plans Verifying and documenting test results Creating system documentation Build reusable code and libraries for future use Automate, update or replace legacy processes Research the use of new technologies Work on multiple project requests at same time Provide daily operations support along with after-hours production support and maintenance Addresses technical and operational issues impacting the business Implement and integrate COTS software into existing architecture\\ Documenting test conditions, creating test data, testing programs, and analyzing results Use of a Systems Development Methodology Organizing work to meet deadlines Establish and maintain effective working relationships Examples of Other Duties Performs other related duties as required. (NOTE: The duties and responsibilities listed above are for the purpose of determining a common set of minimum qualifications for all positions in this class. They may not include all of the essential job functions of each position in the class.\n\nEach position may not be required to perform all of the essential job functions listed.) Qualifications Education, Training, and Experience Applicants must be able to demonstrate the following: Thorough knowledge of the principles and practices of data processing, office automation, and computer programming Thorough knowledge of the principles and practices of systems analysis Thorough knowledge of Structured Query Language in conjunction with one or more major databases At least four (4) years' experience developing applications including the following: Experience using source control Experience supporting ERP (Enterprise Resource Planning) systems Experienced with design, development, and testing of WCF (windows communication foundation) services (SOAP (simple object access protocol) &amp; REST (representational state transfer)) Experience integrating on premise and cloud-based Microsoft solutions Experience using a variety of tools &amp; languages to consume and test services (C#, Java, JavaScript, HTML, XML, .NET, jQuery, AJAX, etc.) Experience with cloud hosted services and service proxy layers / applications Strong knowledge of SQL with ability to develop queries, reports, and stored procedures A solid understanding of FME (Feature Manipulation Engine, and other data transformation tools Financial/HR background (understanding Financial, HR, Payroll, Budget terminology) Education Graduation from an accredited college or university with a bachelor's degree in business or computer science. plus At least two years' experience in the administration or support of software applications. Additional experience may be substituted on a year-for-year basis up to a maximum of four years for the required education.\n\nProof of Licenses, Certifications and Education Applicants are required to submit proof of licenses, certifications and education beyond high school to meet the required and preferred qualifications of the position. Diplomas or transcripts must show the applicant's major field of study. Copies and unofficial transcripts are acceptable.\n\nFailure to submit proof of Licenses, Certifications and Education will result in your application not being considered. Proof of licenses, certifications, and/or education must be submitted with each application. Proof of Degree Equivalency Applicants who have obtained a degree from outside the United States of America are required to submit degree equivalence documentation from World Education Services, Inc.\n\n(www.WES.org) Mail or deliver documents to: ATTN: ERP Software Engineer Office of Human Resources Baltimore County Government 308 Allegheny Ave. Towson, MD 21204 You can attach your resume, transcript(s) or license(s) to your application. EXAMINATION PROCEDURE Applicants will be qualified based on an evaluation of their training and experience, as stated on their application.\n\nApplicants must state the dates and duties of past and present experience clearly and completely for evaluation purposes. Conditions of Employment Work an average scheduled workweek of 34 hours, Monday through Friday. Employment Background Investigation Applicants selected for an appointment to a position in Baltimore County must successfully complete an employment background investigation, including, but not limited to a criminal background, education, and fingerprint check",
    "company": {
      "name": "Baltimore County",
      "description": null,
      "locations": ["Towson, MD"],
      "website": null,
      "markets": null,
      "jobSources": null,
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSnOjVwlTSLawK0MNPWEqTAs9RebSlGbzldcbtE&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "be6288b9-7c45-4459-86eb-b004b8e32ded",
    "jobTitle": "Software Engineer/Principal Engineer Software (TS/SCI clearance required to apply) - R10160311",
    "country": "United States",
    "city": "Falls Church",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T18:38:19.607Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Python",
      "C++",
      "Rust",
      "Java",
      "JavaScript",
      "Docker",
      "Kubernetes",
      "AWS"
    ],
    "shortDescription": "We are looking for a Software Engineer experienced in Python who wants to work on an agile development team tackling both new development and operational support for systems advancing National Security.",
    "longDescription": {
      "benefits": [
        "health insurance coverage",
        "life and disability insurance",
        "savings plan",
        "Company paid holidays",
        "paid time off (PTO) for vacation and/or personal business"
      ],
      "responsibilities": "Join the Aurora Software and Digital Engineering department to work on revolutionary systems that impact people's lives, tackling both new development and operational support.",
      "qualification_required": {
        "skills": [
          "Software development",
          "Agile methodology",
          "Version control",
          "Object-oriented design"
        ],
        "qualifications": [
          "Bachelor’s degree in Science with 2+ years of software development experience",
          "Experience as a front-end, back-end, or full-stack developer",
          "Current Top Secret/SCI security clearance"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Rust",
          "C++",
          "Java",
          "JavaScript",
          "Dockerization",
          "Container Management"
        ],
        "qualifications": [
          "Experience with AWS Services",
          "Experience with DevOps and/or Site Reliability Engineering",
          "Experience designing and troubleshooting in virtualized environments"
        ]
      }
    },
    "benefits": [
      "health insurance coverage",
      "life and disability insurance",
      "savings plan",
      "Company paid holidays",
      "paid time off (PTO) for vacation and/or personal business"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jsv3.recruitics.com/redirect?rx_cid=3658&rx_jobId=R10160311&rx_url=https%3A%2F%2Fwww.northropgrumman.com%2Fjobs%2FEngineering%2FSoftware%2FUnited-States-of-America%2FColorado%2FAurora%2FR10160311%2Fsoftware-engineerprincipal-engineer-software-tssci-clearance-required-to-apply%3Fcode%3DJB-18202%26rx_campaign%3DLinkedin1%26rx_ch%3Dconnector%26rx_group%3D375073%26rx_job%3DR10160311%26rx_medium%3Dpost%26rx_r%3Dnone%26rx_source%3DLinkedin%26rx_ts%3D20241109T181201Z%26rx_vp%3Dslots%26source%3DJB-18202%26utm_audience%3Dprospectivetalentemployees%26utm_campaign%3Dta-general%26utm_content%3Djobfeed%26utm_format%3Dcpl%26utm_medium%3Djobboard%26utm_network%3Dpartnerdirect%26utm_source%3Dlinkedin-jobslots",
    "jobType": "Software Engineer",
    "salaryMin": "83300",
    "salaryMax": "153600",
    "currency": "USD",
    "rawDescription": "Requisition ID: R10160311\n\n* Category: Engineering\n* Location: Aurora, Colorado, United States of America\n* Clearance Type: SCI\n* Telecommute: No- Teleworking not available for this position\n* Shift: 1st Shift (United States of America)\n* Travel Required: Yes, 10% of the Time\n* Positions Available: 3\n\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\n\nThe Payload and Ground Systems organization within the Northrop Grumman Space Systems pushes the boundaries of innovation, redefines engineering capabilities, and drives advances in various sciences. Our team is chartered with providing the skills, innovative technologies to develop, design, produce and sustain optimized product lines across the sector while providing a decisive advantage to the warfighter. Come be a part of our mission.\n\nWhat You’ll get to Do: We are looking for a Software Engineer experienced in Python (as your primary and most skilled in Object-Orientated programming language) who wants to work on an agile development team using modern development practices tackling both new development and operational support of systems that advance National Security. Our Aurora campus has numerous programs in all phases on the development and operational lifecycle, from smaller single scrum team efforts to larger multi-team efforts, some that leverage remote teams from other Northrop Grumman sites. Many of our programs are using a micro-service event driven architecture using Docker Containers, Kubernetes, Helm charts and AWS services. Programs also in Operations have maintenance and sustainment engineering needs on existing deployed baselines which may require troubleshooting and programming in C++/C. Many programs have a mixture of other languages in use such as Java or JavaScript. Needs exist for front-end developers, back-end developers, and full-stack developers. We are flexible and career growth focused permitting staff to either deepen skills on one program, or seek other internal opportunities over time to broaden skills, experiences, and mission exposure.\n\nAbout our organization: As a Software Engineer, you'll be joining our growing Aurora Software and Digital Engineering department which has 200+ Software Engineer, DevOps Engineer, Systems Administrator, Database Administrator, and Network Engineer peers from entry-level to the most senior chief engineers and architects. Principal Software Engineers frequently get into informal (example: Subject Matter Expert) and formal technical leadership roles within their programs, as applicable and per interest. We have plenty of opportunity for career advancement into higher level technical roles or leadership positions. Our Software Department is part of a larger organization that includes Systems Engineering, Integration, and Test staff as well as a Hardware Engineering unit. This larger organization influences cross-program collaboration, professional development and training, as well as engagement and inclusion activities such as lunch-n-learns, campus events, and leadership mixers.\n\nBasic Qualifications\n\n* Software Engineer: Bachelor’s degree in Science with 2+ years of software development experience; 0+ years with a Master's; or 4 additional years of experience in lieu of a degree.\n* Principal Software Engineer: Bachelor’s degree in Science with 5+ years of software development experience; 3+ years with a Master's; 0 years with a PhD; or 4 additional years of experience in lieu of a degree. \n* Experience as a front-end, back-end, or full-stack developer\n* Experience developing on teams using Agile methodology, process, and tools\n* Experience designing, developing, and troubleshooting in Python\n* Experience using object oriented design\n* Experience using version control software\n* Current Top Secret/SCI security clearance required to apply\n* Candidate must be able to obtain a Counterintelligence Polygraph (CI-Poly)\n\nOffers are contingent upon receiving the Top Secret (TS) / SCI clearance\n\nPreferred Qualifications\n\nIt is preferred that a given candidate has some of the preferred qualification below. No expectation of all\n\n* Experience designing, developing, and troubleshooting in Rust, C++, Java and/or JavaScript\n* Experience designing, developing, and troubleshooting in virtualized environments (VMs, AWS Cloud Instances)\n* Experience with software development on Red Hat Enterprise Linux and shell scripting.\n* Experience with Dockerization and Container Management (Dockers and Kubernetes)\n* Experience with Atlassian tools (Jira, Confluence, Bitbucket)\n* Experience with AWS Services\n* Experience with software system integration, testing, and deployment, including but not limited to automation\n* Experience with DevOps and/or Site Reliability Engineering\n\nSalary Range: $83,300 - $124,900\n\nSalary Range 2: $102,400 - $153,600\n\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\n\nEmployees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\n\nThe application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.\n\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions.",
    "company": {
      "name": "Northrop Grumman",
      "description": "We are a close-knit community of big thinkers collaborating to keep the world safe. Our passion, creativity and expertise bring next-level technology solutions to life in autonomous systems, cyber, C4ISR, strike, space, and logistics and modernization for our customers around the globe. \n\nOn the Northrop Grumman team, you’ll join our pursuit of excellence immersed in a dynamic culture of innovation and respect. Your unique perspective will help achieve our shared vision for the future of global security. Every step of the way, you'll be supported by world-class training, employee resource groups and a comprehensive benefits package that enables greater health and happiness for you and your family.  \n\nWorldwide and across disciplines, we’re challenging what’s possible for technology to protect people and places from undersea to outer space and into cyberspace. And we see the impact of our performance every day. We are Northrop Grumman, and we work on what matters—now, you too can make a difference.\n \nExplore opportunities in engineering, IT, manufacturing, business management, cybersecurity and more at careers.northropgrumman.com. \n\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA statement, please visit www.northropgrumman.com/EEO. U. S. citizenship is required for most positions.\n\nOur careers site can be found at northropgrumman.com/careers/.  If you are contacted by someone about a job at Northrop Grumman, please verify the opportunity on our Careers site before engaging with that contact. We only schedule interviews with qualified candidates who have applied to a job posting through our Careers site.",
      "locations": ["Linthicum Heights, MD"],
      "website": "https://northropgrumman.com",
      "markets": ["Defense and Space Manufacturing"],
      "jobSources": ["dice"],
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTT_IsOQ-SF8GK641nETEypzK-hq-db4z29PMwl&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "d3e79fdc-366b-409f-8e8a-5eaaa51d54e1",
    "jobTitle": "Java Full Stack Developer",
    "country": "United States",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T18:21:40.160Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Java",
      "JavaScript",
      "Spring Framework",
      "Vue",
      "Bootstrap",
      "Mockito",
      "JUnit",
      "Cypress",
      "MySQL",
      "Redis",
      "AWS DynamoDB",
      "Git",
      "GitLab",
      "Jira",
      "Confluence",
      "Gitlab CI/CD",
      "Jenkins",
      "SonarQube",
      "Fortify"
    ],
    "shortDescription": "Seeking a motivated Full Stack Developer to enhance mission management systems using modern development practices in a cloud-native environment.",
    "longDescription": {
      "benefits": [
        "healthcare",
        "wellness",
        "financial support",
        "retirement",
        "family support",
        "continuing education",
        "flexible time off"
      ],
      "responsibilities": "Design, develop, and maintain microservices and UI for data-rich applications with complex user workflows, participate in agile stand-ups, and influence project architecture.",
      "qualification_required": {
        "skills": [
          "Java development",
          "Development on Linux OS",
          "Team collaboration",
          "Willingness to learn"
        ],
        "qualifications": [
          "Bachelor's Degree in STEM field or related experience",
          "5 or more years of experience in software development",
          "TS/SCI clearance"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Agile methodologies",
          "DevOps processes",
          "Test Driven Development",
          "Container management"
        ],
        "qualifications": [
          "Experience with AWS",
          "Experience in automated testing tools",
          "Experience with MySQL and Redis"
        ]
      }
    },
    "benefits": [
      "healthcare",
      "wellness",
      "financial support",
      "retirement",
      "family support",
      "continuing education",
      "flexible time off"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.clearancejobs.com/jobs/8043360/java-full-stack-developer",
    "jobType": "Full Stack Developer",
    "salaryMin": "85800",
    "salaryMax": "180200",
    "currency": "USD",
    "rawDescription": "Today\nTop Secret/SCI\nUnspecified\nNone\nIT \\- Software\nSterling, VA **(ON\\-SITE/OFFICE)**\nJava Full Stack Developer  \n\n  \n\nJob Category: Engineering  \n\n  \n\nTime Type: Full time  \n\n  \n\nMinimum Clearance Required to Start: TS/SCI  \n\n  \n\nEmployee Type: Regular  \n\n  \n\nPercentage of Travel Required: None  \n\n  \n\nType of Travel: None  \n\n  \n\n\\* \\* \\*  \n\n  \n\nAre you ready to put your knowledge, skills, and experience to work developing modern and intuitive mission management systems that use current development practices, are cloud native, and are built within an extreme agile continuous deployment software development framework? As a motivated software developer on this exciting program comprised of multiple product teams, you will support our mission customers through modernization of mission management applications.  \n\n  \n\n**What You'll Get to Do**:\n  \n\n  \n\nWe'll look to you to help design, develop, and maintain microservices and a UI for a data\\-rich application with complex user workflows. As a part of the development process, you will write automated tests, deploy to a fully automated DevSecOps pipeline, and influence the current architecture and future technical direction of the project. Each day, you can expect to report a brief status at an agile stand\\-up meeting, dig into the highest priority work to accomplish that day, code with your teammates, and participate in TEMs as needed.  \n\n  \n\n**Technologies you will use may include:**  \n\n* Frontend frameworks like Vue and Bootstrap\n* Spring Framework\n* Java\n* JavaScript/typescript\n* Automated testing tools like Mockito, JUnit, Cypress, etc.\n* Databases like MySQL, Redis, AWS DynamoDB, etc.\n* SCM and issue tracking tools like Git, GitLab, Jira, Confluence, etc.\n* DevSecOps pipeline tools such as Gitlab CI/CD, Jenkins, SonarQube, Fortify, etc.\n\n  \n\n**You'll Bring These Qualifications** :\n  \n\n* Clearance: Must have TS/SCI with CI poly (or be willing to take CI poly)\n* Education: Bachelor's Degree in STEM field or related experience\n* Experience: 5 or more years of experience in software development\n* Available to work in\\-person at CACI facilities in Sterling, VA or Aurora, CO\n* Experience with either Web/Front End and/or Back\\-end with willingness to do Full Stack\n* Demonstrated experience working with others in a team environment\n* Willingness to learn new skills and technologies\n* Development on Linux OS\n* Java development skills\n* Current Security\\+ certification (or the willingness to get it)\n\n  \n\n**These Qualifications Would be Nice to Have:**  \n\n* Experience with agile methodologies and DevOps processes\n* Use of Amazon Web Services\n* Experience with automated testing tools\n* Experience using tools for Test Driven Development (TDD)\n* Experience with database systems such as MySQL, Redis, etc\n* Experience with Git / GitLab source code management tools\n* Experience with container management (e.g., Docker, Kubernetes)\n\n  \n\n* \n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n  \n\n  \n\n**What You Can Expect:**\n  \n\n  \n\n**A culture of integrity.**  \n\n  \n\nAt CACI, we place character and innovation at the center of everything we do. As a valued team member, you'll be part of a high\\-performing group dedicated to our customer's missions and driven by a higher purpose \\- to ensure the safety of our nation.\n  \n\n  \n\n**An environment of trust.**  \n\n  \n\nCACI takes pride in fostering a diverse and accessible culture where every individual feels supported to chart their own path. You'll have the autonomy to take the time you need through a unique flexible time off benefit and have access to robust learning resources to make your ambitions a reality.\n  \n\n  \n\n**A focus on continuous growth.**  \n\n  \n\nTogether, we will advance our nation's most critical missions, build on our lengthy track record of business success, and find opportunities to break new ground \\- in your career and in our legacy.\n  \n\n  \n\n**Your potential is limitless.** So is ours.\n  \n\n  \n\nLearn more about CACI here.\n  \n\n  \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n  \n\n  \n\n**Pay Range**: There are a host of factors that can influence final salary including, but not limited to, geographic location, Federal Government contract labor categories and contract wage rates, relevant prior work experience, specific skills and competencies, education, and certifications. Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives. We offer competitive compensation, benefits and learning and development opportunities. Our broad and competitive mix of benefits options is designed to support and protect employees and their families. At CACI, you will receive comprehensive benefits such as; healthcare, wellness, financial, retirement, family support, continuing education, and time off benefits. Learn more here .  \n\n  \n\nThe proposed salary range for this position is:\n  \n\n$85,800 \\- $180,200  \n\n  \n\nCACI is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, age, national origin, disability, status as a protected veteran, or any other protected characteristic.**GROUP ID:** caci**R****Recruiter**\n\n**APPLY NOW**\n\n",
    "company": {
      "name": "Dhara Consulting Group",
      "description": null,
      "locations": ["Sterling, VA"],
      "website": "https://dharacg.com",
      "markets": ["Professional Services"],
      "jobSources": null,
      "logo": "https://logo.clearbit.com/dharacg.com"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "6a4cbd43-2525-469a-9be5-1daf09082ccc",
    "jobTitle": "Staff Systems Software Engineer (SS881) - R10176649",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T18:20:35.998Z",
    "experienceLevel": "Not specified",
    "techStack": ["Python", "C++", "Matlab"],
    "shortDescription": "Lead development of new technologies in Microelectronics Design and Applications (MDA) at Northrop Grumman.",
    "longDescription": {
      "benefits": [
        "health insurance coverage",
        "life and disability insurance",
        "savings plan",
        "Company paid holidays",
        "paid time off (PTO)"
      ],
      "responsibilities": "Support the Systems Architect with any program specific responsibilities, work in an engineering leadership role, define and verify software capabilities, collaborate with the Systems Engineering team, and conduct architecture and design reviews.",
      "qualification_required": {
        "skills": [
          "5 years of experience as a software engineer",
          "knowledge of model-based systems engineering",
          "experience with Agile software development lifecycle"
        ],
        "qualifications": [
          "Bachelor's Degree in a STEM discipline with 12 years of experience",
          "US Citizenship",
          "ability to obtain DoD TS/SCI Clearance with Polygraph"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "experience with Cameo modeling tools",
          "experience with Data engineering and processing pipelines",
          "experience with embedded systems"
        ],
        "qualifications": [
          "willingness to learn transformational computing technology concepts",
          "experience creating design artifacts such as UML and SysML"
        ]
      }
    },
    "benefits": [
      "health insurance coverage",
      "life and disability insurance",
      "savings plan",
      "Company paid holidays",
      "paid time off (PTO)"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.linkedin.com/jobs/view/staff-systems-software-engineer-ss881-r10176649-at-northrop-grumman-4072856883?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Systems Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Requisition ID: R10176649\n• Category: Engineering\n• Location: Linthicum, Maryland, United States of America | Annapolis Junction, Maryland, United States of America...\n• Clearance Type: Polygraph\n• Telecommute: No- Teleworking not available for this position\n• Shift: 1st Shift (United States of America)\n• Travel Required: Yes, 10% of the Time\n• Relocation Assistance: Relocation assistance may be available\n• Positions Available: 1\n\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\n\nToday’s dynamic global security threats require solutions both big and small – solutions living within the Northrop Grumman Microelectronics Center (NGMC). Boasting state-of-the-art design capabilities, multiple processing nodes, electrical testing, environmental and QCI screening, and failure analysis, the NGMC is a leader in designing, fabricating, packaging, and delivering discriminating microelectronics to the military, aerospace, and commercial markets. For more than 70 years, we have been offering a wide range of trusted foundry and semiconductor services that deliver high performing and reliable microelectronics. Our wide breadth of technologies and capabilities allows us to provide our customers with unique “More than Moore” solutions.\n\nOne of our most challenging new fields is Microelectronics Design and Applications (MDA), which combines the unique properties of superconductivity and quantum mechanics to develop radical new energy-efficient computing systems. MDA is seeking a Staff Systems Software Engineer with demonstrated ability to lead development of new technologies to support our innovative MDA team in support of emerging supercomputing technologies.\n\nThis position will serve 100% on-site in Linthicum / Annapolis Junction, MD.\n\nRoles And Responsibilities\n• Support the Systems Architect with any program specific responsibilities\n• Work in an engineering leadership role that executes all facets of building complex software in an Agile development environment.\n• Perform engineering activities, focusing on software, across the full spectrum from conceptual design to system deployment\n• Define, implement, and verify software capabilities and tools supporting novel technologies and applications\n• Collaborate with Systems Engineering team to define technical architectures for software-intensive systems\n• Lead and collaborate the development of technical requirements and synthesize software architectures\n• Conduct architecture and design reviews\n• Participate and work on integration and testing\n• Aid in developing documentation and briefing material.\n\nBasic Qualifications For Staff Systems Software Engineer\n• Bachelor's Degree or higher in a STEM discipline (Science, Technology, Engineering, Math) with 12 years of related experience, or 10 years with a Master's Degree, or 8 years with a PhD.\n• A minimum of 5 years of experience in working as a software engineer or software systems engineer.\n• Experience with the Agile software development lifecycle\n• Knowledge of model-based systems engineering process and artifact creation\n• Experience developing and communicating software architecture constructs\n• Experience and knowledge of object-oriented programming languages such as Python, C++, Matlab, etc.\n• Capable of effective communication in a highly technical environment\n• Candidate must be a US Citizen\n• Clearance: Candidate must be able to obtain and maintain a DoD TS/SCI Clearance with Polygraph\n\nPreferred Qualifications For Staff Systems Software Engineer\n• Willingness to learn transformational computing technology concepts and domain appropriate for a lead engineering role\n• Ability to learn, contribute to, and aid in ways to improve an existing code base\n• Experience with Cameo modeling tools\n• Experience with Data engineering and processing pipelines\n• Experience with UI design and development\n• Experience with test automation and instrument control\n• Experience with embedded systems and hardware/software integration\n• Experience with creating design artifacts such as UML and SysML\n\n#MDASEIT\n\n#NGMCENG\n\nSalary Range: $157,500 - $247,600\n\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\n\nEmployees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\n\nThe application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.\n\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions",
    "company": {
      "name": "Northrop Grumman",
      "description": "We are a close-knit community of big thinkers collaborating to keep the world safe. Our passion, creativity and expertise bring next-level technology solutions to life in autonomous systems, cyber, C4ISR, strike, space, and logistics and modernization for our customers around the globe. \n\nOn the Northrop Grumman team, you’ll join our pursuit of excellence immersed in a dynamic culture of innovation and respect. Your unique perspective will help achieve our shared vision for the future of global security. Every step of the way, you'll be supported by world-class training, employee resource groups and a comprehensive benefits package that enables greater health and happiness for you and your family.  \n\nWorldwide and across disciplines, we’re challenging what’s possible for technology to protect people and places from undersea to outer space and into cyberspace. And we see the impact of our performance every day. We are Northrop Grumman, and we work on what matters—now, you too can make a difference.\n \nExplore opportunities in engineering, IT, manufacturing, business management, cybersecurity and more at careers.northropgrumman.com. \n\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA statement, please visit www.northropgrumman.com/EEO. U. S. citizenship is required for most positions.\n\nOur careers site can be found at northropgrumman.com/careers/.  If you are contacted by someone about a job at Northrop Grumman, please verify the opportunity on our Careers site before engaging with that contact. We only schedule interviews with qualified candidates who have applied to a job posting through our Careers site.",
      "locations": ["Linthicum Heights, MD"],
      "website": "https://northropgrumman.com",
      "markets": ["Defense and Space Manufacturing"],
      "jobSources": ["dice"],
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTT_IsOQ-SF8GK641nETEypzK-hq-db4z29PMwl&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "683d6fa9-b368-41e4-9421-d0ff52a3f9af",
    "jobTitle": "Software Engineer (Data), Ai & Data Platforms",
    "country": "United States",
    "city": "Cupertino",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T18:08:20.003Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Python",
      "Scala",
      "Java",
      "SnowFlake",
      "Big Query",
      "Cloudera",
      "Spark",
      "Kafka",
      "Kubernetes",
      "AWS",
      "Microsoft Azure",
      "Google Cloud",
      "Streamlit",
      "Superset",
      "Tableau",
      "Business Objects",
      "Looker"
    ],
    "shortDescription": "Join Apple's AiDP team as a Software Engineer to build high quality, scalable distributed systems powering cloud analytics platforms and data pipelines.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Engineer high-quality, scalable, and resilient distributed systems to power data exploration, analytics, and reporting. Build solutions integrating open source software with Apple’s internal ecosystem. Drive development from concept to release and support production applications.",
      "qualification_required": {
        "skills": [
          "Programming in Python, Scala or Java",
          "Designing and developing cloud-based applications",
          "Optimizing SQLs for distributed data applications"
        ],
        "qualifications": [
          "3 years of experience with enterprise applications in distributed systems",
          "Bachelor's degree in Computer Science or equivalent experience"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Experience with Spark and Kubernetes",
          "Developing Big Data applications",
          "Data visualization"
        ],
        "qualifications": [
          "Experience with Snowflake and cloud technology platforms",
          "Familiarity with generating and visualizing data insights and KPIs"
        ]
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jsv3.recruitics.com/redirect?rx_cid=3427&rx_jobId=200562464-3&rx_url=https%3A%2F%2Fjobs.apple.com%2Fen-us%2Fdetails%2F200562464%2Fsoftware-engineer-data-ai-data-platforms%3Fboard_id%3DJB001%26rx_campaign%3Dindeed0%26rx_ch%3Djobp4p%26rx_group%3D130780%26rx_job%3D200562464-3%26rx_medium%3Dcpc%26rx_r%3Dnone%26rx_source%3Dindeed%26rx_ts%3D20241109T163802Z%26rx_vp%3Dcpc%26team%3DSFTWR",
    "jobType": "Data Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "**Summary**  \n\n  \n\nPosted: Aug 8, 2024  \n\n  \n\nRole Number:**200562464**  \n\n  \n\nAt Apple, extraordinary ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Would you like to work in a fast\\-paced environment where your technical abilities will be challenged on a day\\-to\\-day basis? If so, Apple's Artificial Intelligence and Data Platforms (AiDP) team is seeking an experienced Software Engineer to build high quality, scalable and resilient distributed systems that power Apple's cloud analytics platforms and data pipelines. Apple's Enterprise Data Warehouse landscape caters to a wide variety of real\\-time, near real\\-time and batch analytical solutions. These solutions are an integral part of business functions like Sales, Operations, Finance, AppleCare, Marketing and Internet Services, enabling business drivers to make critical decisions. We utilize proprietary and open source technologies, Kafka, Spark, Iceberg, Airflow, Presto, etc. If you are looking to take on infrastructure problems at scale, both on\\-prem or in cloud, focusing on ease of use, ease of maintenance and most importantly implement solutions that are scalable, you will have fun in AiDP!  \n\n  \n\n**Description**  \n\n  \n\nWe engineer high\\-quality, scalable and resilient distributed systems on cloud that power data exploration, analytics, reporting and production models. Our core systems are diverse and come with an unusual intersection of high data volumes with systems distributed across cloud and on\\-premise infrastructure. On our team you will build solutions that integrate open source software with Apple’s internal ecosystem. You will drive development of new components and features from concept to release: design, build, test, and ship at a regular cadence. You will work closely with internal customers to understand their requirements and workflows, and propose new features and ecosystem changes to streamline their experience of using the solutions on our platform. This is a hard\\-core software engineering role, where a large part of an engineer's time is spent in writing code and designing/developing applications on cloud, with the remainder being spent on tuning and debugging codebase, supporting production applications and supporting our application end users. This role requires in\\-depth knowledge of innovative technologies and cloud data platform with the ability to independently learn new technologies and contribute to the success of various initiatives. We are looking for a hardworking and passionate person to join this amazing team. If you feel this is you, we'd love to hear from you.\n* 3 or more years experience building enterprise level applications on large\\-scale distributed systems with a bachelor's degree in Computer Science or equivalent experience\n* Knowledge of BI concepts and implementation experience on Cloud with databases like SnowFlake or Big Query or Cloudera\n* Programming experience in building high quality software. Proficiency in at\\-least one of the following programming languages \\- Python, Scala or Java.\n* Strong hands\\-on experience in designing and development of cloud\\-based applications that include large scale compute services, database services, APIs to design RESTful services, ETL, queues and notification services.\n* Experience in developing highly optimized SQLs, procedures \\& semantic process for distributed data applications.\n\n  \n\n**Preferred Qualifications**  \n\n* Experience in Enterprise\\-ready Cloud Data\\-Warehousing platforms like Snowflake is highly valued\n* Hands\\-on knowledge of Spark cluster\\-computing framework \\& Kubernetes or similar containerization technologies.\n* Experience developing Big Data applications using Java, Spark, Kafka is a huge plus\n* Understanding of fundamentals of object\\-oriented design, data structures, algorithm design, and problem solving\n* Cloud technology experience on platforms like AWS, Microsoft Azure, Google Cloud\n* Data Visualization Tools: Proficient in data visualization, with experience in software such as Streamlit, Superset, Tableau, Business Objects, and Looker\n* Data Insights and KPIs: Working experience on generating and visualizing data insights, metrics, and KPIs. Usage of basic ML models in the space of anomaly detection, forecasting, GenAI.\n\n  \n\n**Education \\& Experience**  \n\n  \n\n**Additional Requirements**  \n\n  \n\nMore  \n\n* Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant.\n",
    "company": {
      "name": "Apple",
      "description": "Apple is a California-based technology company that manufactures and sells consumer electronic products such as smartphones, personal computers, and tablets for individuals.",
      "locations": ["Austin, TX"],
      "website": "https://apple.com",
      "markets": ["Computer Hardware Manufacturing"],
      "jobSources": ["simplyhired"],
      "logo": "https://images.otta.com/search/width_400/Y29tcGFueS1sb2dvcy8xMDU2LVFTUXI0cEtrRDRvRndUUVpTazM1SGIzY2k2cUwtSl90OGs3RTFWU3pDTWMucG5n.png"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "2f4b11a2-541c-4ebb-bce2-775b016ca3a0",
    "jobTitle": "Software Developer in Test - Embedded Sensors QE",
    "country": "United States",
    "city": "Cupertino",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T17:54:03.532Z",
    "experienceLevel": "Not specified",
    "techStack": ["C/C++", "Python", "Shell scripting"],
    "shortDescription": "Join the Embedded Sensors Quality Engineering team to ensure the highest quality for technologies in Apple products, focusing on automated tests and collaboration with engineering teams.",
    "longDescription": {
      "benefits": [
        "Comprehensive medical and dental coverage",
        "Retirement benefits",
        "Discounted products and free services",
        "Tuition reimbursement for formal education",
        "Discretionary bonuses or commission payments",
        "Relocation assistance"
      ],
      "responsibilities": "Own overall testing and quality of the Always On Platform (AOP) and related technologies. Design, develop, and own automated tests for new and existing technologies. Proactively triage and investigate difficult problems. Work closely with engineering and project management teams to ensure quality releases.",
      "qualification_required": {
        "skills": [
          "Strong understanding of software test and validation methodologies",
          "Solid OS fundamentals",
          "Strong verbal and written communication skills"
        ],
        "qualifications": [
          "Programming experience with C/C++, Python and Shell scripting"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Experience with developing, testing or debugging device drivers",
          "Firmware or other low level software",
          "Embedded systems or sensors"
        ],
        "qualifications": []
      }
    },
    "benefits": [
      "Comprehensive medical and dental coverage",
      "Retirement benefits",
      "Discounted products and free services",
      "Tuition reimbursement for formal education",
      "Discretionary bonuses or commission payments",
      "Relocation assistance"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jsv3.recruitics.com/redirect?rx_cid=3427&rx_jobId=200566893-2&rx_url=https%3A%2F%2Fjobs.apple.com%2Fen-us%2Fdetails%2F200566893%2Fsoftware-developer-in-test-embedded-sensors-qe%3Fboard_id%3DJB001%26rx_campaign%3Dindeed0%26rx_ch%3Djobp4p%26rx_group%3D130780%26rx_job%3D200566893-2%26rx_medium%3Dcpc%26rx_r%3Dnone%26rx_source%3Dindeed%26rx_ts%3D20241109T163802Z%26rx_vp%3Dcpc%26team%3DSFTWR",
    "jobType": "QA Engineer",
    "salaryMin": "121900",
    "salaryMax": "214500",
    "currency": "USD",
    "rawDescription": "**Summary**  \n\n  \n\nPosted: Sep 8, 2024  \n\n  \n\nWeekly Hours: **40**  \n\n  \n\nRole Number:**200566893**  \n\n  \n\nJoin the team responsible for ensuring the highest quality for technologies at the heart of products known to surprise and delight our customers. The Embedded Sensors Quality Engineering team owns and drives the excellence of quality for the Always On Platform (AOP) which provides a platform for multiple features across Apple products \\- from driving motion sensors like accelerometers, gyroscopes and IMUs to detecting “Hey Siri” and more on all Apple products like the iPhone, Apple Watch, AirPods and Apple Vision Pro and more! This is a highly entrepreneurial team, always looking for innovative ways to improve status quo and solve difficult problems in new and better ways. You will work in a fast paced environment, interacting directly with development teams within the organization as well as cross\\-functional teams. The nature of the position requires excellent communication skills, strong technical and debugging skills, and a drive to make a difference.  \n\n  \n\n**Description**  \n\n  \n\nOwn overall testing and quality of the Always On Platform (AOP) and related technologies Design, develop, and own automated tests for new and existing technologies Proactively triage and investigate difficult problems Work closely with engineering and project management teams to ensure quality releases\n* Strong understanding of software test and validation methodologies\n* Solid OS fundamentals\n* Programming experience with C/C\\+\\+, Python and Shell scripting\n* Strong verbal and written communication skills\n\n  \n\n**Preferred Qualifications**  \n\n* Experience with developing, testing or debugging device drivers, firmware, other low level software, embedded systems or sensors\n\n  \n\n**Pay \\& Benefits**  \n\n\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $121,900 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location.  \n\n  \n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses \\- including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.  \n\n  \n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.\n  \n\nMore  \n\n* Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant.\n",
    "company": {
      "name": "Apple",
      "description": "Apple is a California-based technology company that manufactures and sells consumer electronic products such as smartphones, personal computers, and tablets for individuals.",
      "locations": ["Austin, TX"],
      "website": "https://apple.com",
      "markets": ["Computer Hardware Manufacturing"],
      "jobSources": ["simplyhired"],
      "logo": "https://images.otta.com/search/width_400/Y29tcGFueS1sb2dvcy8xMDU2LVFTUXI0cEtrRDRvRndUUVpTazM1SGIzY2k2cUwtSl90OGs3RTFWU3pDTWMucG5n.png"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "383605e8-813b-40e2-b7bd-ba70e0499e6c",
    "jobTitle": "Lead, Software Engineering (Backend) (Hybrid/Onsite)",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T17:51:15.671Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Java",
      "C++",
      "Golang",
      "Kubernetes",
      "Docker",
      "Angular",
      "React"
    ],
    "shortDescription": "Lead a multi-functional development team in designing and building scalable software solutions for Visa's e-commerce platform.",
    "longDescription": {
      "benefits": [
        "Medical",
        "Dental",
        "Vision",
        "401(k)",
        "FSA/HSA",
        "Life Insurance",
        "Paid Time Off",
        "Wellness Program"
      ],
      "responsibilities": "Design code and systems that influence Visa’s internal standards for scalability, security, and reusability. Collaborate with multiple functions to create software solutions and develop product quality improvements.",
      "qualification_required": {
        "skills": ["Java", "C++", "Go"],
        "qualifications": [
          "10+ years of relevant work experience with a Bachelor’s Degree",
          "7 years of work experience with an Advanced degree",
          "4 years of work experience with a PhD",
          "13+ years of relevant work experience"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "API Development",
          "Cloud Computing",
          "Generative AI",
          "Database Management"
        ],
        "qualifications": [
          "Experience developing cloud-ready components",
          "Knowledge of systems integration",
          "Expertise in architecting and developing polyglot architecture"
        ]
      }
    },
    "benefits": [
      "Medical",
      "Dental",
      "Vision",
      "401(k)",
      "FSA/HSA",
      "Life Insurance",
      "Paid Time Off",
      "Wellness Program"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.ziprecruiter.com/c/Visa/Job/Lead,-Software-Engineering-(Backend)-(Hybrid-Onsite)/-in-Bellevue,WA?jid=820cb89cfa783d53&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Backend Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Company Description\n\nVisa is a world leader in payments and technology, with over 259 billion payments transactions flowing safely between consumers, merchants, financial institutions, and government entities in more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable, and secure payments network, enabling... individuals, businesses, and economies to thrive while driven by a common purpose – to uplift everyone, everywhere by being the best way to pay and be paid.\n\nMake an impact with a purpose-driven industry leader. Join us today and experience Life at Visa.\nJob Description\n\nVisa’s Technology Organization is a community of problem solvers and innovators reshaping the future of commerce. We operate the world’s most sophisticated processing networks capable of handling more than 65k secure transactions a second across 80M merchants, 15k Financial Institutions, and billions of everyday people. While working with us you’ll get to work on complex distributed systems and solve massive scale problems centered on new payment flows, business and data solutions, cyber security, and B2C platforms.\n\nThe Opportunity:\n\nWe are looking for Versatile, curious, and energetic Software Engineers who embrace solving complex challenges on a global scale. As a Visa Software Engineer, you will be an integral part of a multi-functional development team inventing, designing, building, and testing software products that reach a truly global customer base. While building components of powerful payment technology, you will get to see your efforts shaping the digital future of monetary transactions.\n\nThe Work itself:\n• Design code and systems that touch 40% of the world population while influencing Visa’s internal standards for scalability, security, and reusability\n• Collaborate multi-functionally to create design artifacts and develop best-in-class software solutions for multiple Visa technical offerings\n• Actively contribute to product quality improvements, valuable service technology, and new business flows in diverse agile squads\n• Develop robust and scalable products intended for a myriad of customers including end-user merchants, b2b, and business to government solutions.\n• Leverage innovative technologies to build the next generation of Payment Services, Transaction Platforms, Real-Time Payments, and Buy Now Pay Later Technology\n• Opportunities to make a difference on a global or local scale through mentorship and continued learning opportunities\n\nEssential Functions:\n• Provides strategic technical and functional knowledge of the e-commerce platform as well as a thorough understanding of the business to direct strategy on collecting and understanding requirements.\n• Leads meetings with product partners to recommend development and solution strategies that improve the design and functionality of interface features across a range of payment products.\n• Formalizes Standard Processes on the use of programming languages (e.g. HTML, C++, Java) to write code that fulfills website modification requests and technical requirements.\n• Leads and plans the piloting and integration of new technology capabilities and features that enhance the user website experience across e-commerce products.\n• Analyzes patterns across bugs and implements systemic solutions to ensure websites remain functional and easy to use.\n\nThe Skills You Bring:\n• Energy and Experience: A growth mindset that is curious and passionate about technologies and enjoys challenging projects on a global scale\n• Challenge the Status Quo: Comfort in pushing the boundaries, ‘hacking’ beyond traditional solutions\n• Language Expertise: Expertise in one or more general development languages (e.g., Java, C#, C++)\n• Builder: Experience building and deploying modern services and web applications with quality and scalability\n• Learner: Constant drive to learn new technologies such as Angular, React, Kubernetes, Docker, etc.\n• Partnership: Experience collaborating with Product, Test, Dev-ops, and Agile/Scrum teams\n• *We do not expect that any single candidate would fulfill all of these characteristics. For instance, we have exciting team members who are really focused on building scalable systems but didn’t work with payments technology or web applications before joining Visa.\n\nThis is a hybrid position. Hybrid employees can alternate time between both remote and office. Employees in hybrid roles are expected to work from the office 2-3 set days a week (determined by leadership/site), with a general guidepost of being in the office 50% or more of the time based on business needs.\nQualifications\n\nBasic Qualifications\n10+ years of relevant work experience with a Bachelor’s Degree or at least 7 years of work experience with an Advanced degree (e.g. Masters, MBA, JD, MD) or 4 years of work experience with a PhD, OR 13+ years of relevant work experience.\n\nPreferred Qualifications\nProgramming Languages: Knowledge of and ability to develop back-end code (e.g. C/C++, Go, containers and gRPC) in support of platform development. This includes the extension of capabilities of packages and products.\nAPI Generation: The ability to develop and apply Application Program Interfaces (APIs), a set of routines, protocols, and tools for building software applications that specify how software components should interact and are used when programming graphical user\nCloud Computing: experience developing cloud-ready components\nGAI: utilization of Generative AI models and software for code development\nKnowledge of and the ability to use database software (e.g., applications, web-based applications, information systems) to maintain, modify, and output data.\nKnowledge of systems integration process in which separately produced components or subsystems are combined and problems in their interactions are addressed.\nKnowledge of data structures, which consist of data organization, management, and storage formats that enable efficient access and modifications. This includes a collection of data values, the relationships among them, and the functions or operations that can be applied to the data.\nExpertise in architecting, developing and debugging polyglot architecture and systems\n\nAdditional Information\n\nWork Hours: Varies upon the needs of the department.\n\nTravel Requirements: This position requires travel 5-10% of the time.\n\nMental/Physical Requirements: This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers.\n\nVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.\n\nVisa will consider for employment qualified applicants with criminal histories in a manner consistent with applicable local law, including the requirements of Article 49 of the San Francisco Police Code.\n\nU.S. APPLICANTS ONLY: The estimated salary range for a new hire into this position is 160,600.00 to 232,900.00 USD per year, which may include potential sales incentive payments (if applicable). Salary may vary depending on job-related factors which may include knowledge, skills, experience, and location. In addition, this position may be eligible for bonus and equity. Visa has a comprehensive benefits package for which this position may be eligible that includes Medical, Dental, Vision, 401 (k), FSA/HSA, Life Insurance, Paid Time Off, and Wellness Program",
    "company": {
      "name": "Visa",
      "description": "Visa (NYSE: V) is a world leader in digital payments, facilitating transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories. Our purpose is to uplift everyone, everywhere by being the best way to pay and be paid. \n\nLearn more at Visa.com.",
      "locations": ["Bellevue, WA"],
      "website": "https://visa.com",
      "markets": ["IT Services and IT Consulting"],
      "jobSources": ["simplyhired"],
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSBAMFjX5B7yzf3MMwT9FHL8N2xeZbwgMlhYyOA&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "0d5a024f-ce68-4050-b021-2e1919a71784",
    "jobTitle": "Cloud Software Engineer - Biophotonics",
    "country": "United States",
    "city": "Cupertino",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T17:33:16.889Z",
    "experienceLevel": "Not specified",
    "techStack": ["C", "C++", "Python", "Java", "Go", "Rust", "Scala", "Swift"],
    "shortDescription": "Join Apple as a Full Stack Developer to work on innovative Biophotonics software solutions, and contribute to cloud infrastructure design.",
    "longDescription": {
      "benefits": [
        "Comprehensive medical and dental coverage",
        "Retirement benefits",
        "Discounted products and free services",
        "Tuition reimbursement for formal education",
        "Eligibility for discretionary bonuses or commission payments"
      ],
      "responsibilities": "Design and develop software solutions for the organization's research and development activities, contribute to software architecture definitions, and create and maintain cloud-based batch processing pipelines.",
      "qualification_required": {
        "skills": [
          "Software development experience in an industrial setting",
          "Experience in the software development lifecycle",
          "Strong Software Engineering skills"
        ],
        "qualifications": [
          "Bachelors degree in Computer Science or Computer Science Engineering",
          "Development experience in various programming languages"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Experience with cloud platforms",
          "Proficient with software support tools",
          "Strong communication skills"
        ],
        "qualifications": [
          "3+ years of experience in software development",
          "Understanding of data storage systems"
        ]
      }
    },
    "benefits": [
      "Comprehensive medical and dental coverage",
      "Retirement benefits",
      "Discounted products and free services",
      "Tuition reimbursement for formal education",
      "Eligibility for discretionary bonuses or commission payments"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jsv3.recruitics.com/redirect?rx_cid=3427&rx_jobId=200577852&rx_url=https%3A%2F%2Fjobs.apple.com%2Fen-us%2Fdetails%2F200577852%2Fcloud-software-engineer-biophotonics%3Fboard_id%3DJB001%26rx_campaign%3Dindeed0%26rx_ch%3Djobp4p%26rx_group%3D130780%26rx_job%3D200577852%26rx_medium%3Dcpc%26rx_r%3Dnone%26rx_source%3Dindeed%26rx_ts%3D20241109T103801Z%26rx_vp%3Dcpc%26team%3DHRDWR",
    "jobType": "Full Stack Developer",
    "salaryMin": "143100",
    "salaryMax": "264200",
    "currency": "USD",
    "rawDescription": "**Summary**  \n\n  \n\nPosted: Nov 7, 2024  \n\n  \n\nRole Number:**200577852**  \n\n  \n\nImagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? The Biophotonics software team solves a wide array of challenging problems and is responsible for the software that drives the prototypes and platforms at the heart of our program. We develop solutions at all levels from embedded firmware code to full stack applications and cloud based data processing solutions. We are looking for a hands\\-on Software Engineer to help design and execute on the cloud infrastructure of our software development efforts. The candidate must be flexible and able to work with experts from a diverse set of backgrounds to identify requirements and implement critical features.  \n\n  \n\n**Description**  \n\n  \n\nIn this dynamic role, the candidate will work closely with the project’s other software engineers and the wider engineering team to design and develop software solutions enabling progress on the organization’s research and development activities. Duties will include contributing to software architecture definitions, creating development plans, translating application feature requests into reusable software, and executing on plans for new and existing large scale applications. Working with a mix of short and long timelines, balancing a wide range of technically diverse tasks. The work includes: developing software support tools and web services, implementing and maintaining the organization's data management and storage systems, and creating and maintaining cloud based batch processing pipelines.\n* Bachelors degree in Computer Science or Computer Science Engineering.\n* Software development experience in an industrial setting.\n* Development experience in one of the following programming languages: C, C\\+\\+, Python, Java, Go, Rust, Scala, or Swift.\n\n  \n\n**Preferred Qualifications**  \n\n* 3\\+ years of experience with all aspects of the software development lifecycle: requirements gathering, design, development, deployment, and maintenance.\n* Understanding of development in cloud platforms. In particular experience with Apache Spark and JVM based development in Scala or Java.\n* Capable of contributing to projects related to: application development (e.g. data acquisition, automation, and UI), system software, and general compute infrastructure.\n* Strong Software Engineering skills in software design, development across object oriented or concurrent programming languages, and debugging. This would include the programming language itself as well as its toolchains (IDEs and dependency management) and overall ecosystem (frameworks and best practices) across a variety of operating systems.\n* Proficient with software support tools including the Unix command line, shell scripting, and version control software.\n* Understanding of data storage including trade\\-offs between relational, no\\-SQL, and high volume scientific data storage systems.\n* Demonstrated ability to digest and use new technology quickly and strategically.\n* Consistent track record successfully making progress amidst ambiguity; Strong communication skills and experience working on cross\\-functional projects.\n\n  \n\n**Pay \\& Benefits**  \n\n\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.  \n\n  \n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses \\- including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.  \n\n  \n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.\n  \n\nMore  \n\n* Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant.\n",
    "company": {
      "name": "Apple",
      "description": "Apple is a California-based technology company that manufactures and sells consumer electronic products such as smartphones, personal computers, and tablets for individuals.",
      "locations": ["Austin, TX"],
      "website": "https://apple.com",
      "markets": ["Computer Hardware Manufacturing"],
      "jobSources": ["simplyhired"],
      "logo": "https://images.otta.com/search/width_400/Y29tcGFueS1sb2dvcy8xMDU2LVFTUXI0cEtrRDRvRndUUVpTazM1SGIzY2k2cUwtSl90OGs3RTFWU3pDTWMucG5n.png"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "0f37b068-36c7-4398-918e-a277a30b1ac8",
    "jobTitle": "Software Engineer",
    "country": "United States",
    "city": "San Francisco",
    "state": "",
    "locationType": "Remote",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T17:11:08.602Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Java",
      "Scala",
      "React",
      "Typescript",
      "Kubernetes",
      "Postgres",
      "ZIO",
      "Clickhouse",
      "Iceberg",
      "Spark"
    ],
    "shortDescription": "Responsible for developing and maintaining the backend microservices and front-end application for the ABX & Sales Intelligence Cloud.",
    "longDescription": {
      "benefits": [
        "Up to 100% paid Medical and Vision premiums for employees",
        "Flexible PTO policy",
        "No internal meetings on Fridays",
        "Access to Modern Health and other mental wellness resources",
        "Eight paid holidays",
        "Two additional week-long breaks in July and November",
        "401(k), short-term/long-term disability, life insurance, and other benefits"
      ],
      "responsibilities": "Develop and maintain the backend and frontend applications, set technical direction, implement best practices, and ensure quality releases through collaboration.",
      "qualification_required": {
        "skills": [
          "Experience building microservices in Java/Scala",
          "Understanding of building APIs atop RDBMS",
          "Attention to detail at both visual and technical levels",
          "Product-oriented mindset",
          "Experience working with UX and Product teams"
        ],
        "qualifications": [
          "Minimum of 2 years of relevant work experience as a full stack engineer, backend engineer, or frontend engineer"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Experience with React, Redux, Sagas",
          "Typescript experience or a strong desire to learn",
          "Experience using data visualization libraries like Highcharts or D3",
          "Strong Kubernetes and/or Istio experience",
          "Experience with implementing CI/CD pipelines"
        ],
        "qualifications": [
          "Experience with Postgres, ZIO, Clickhouse, Iceberg, Spark"
        ]
      }
    },
    "benefits": [
      "Up to 100% paid Medical and Vision premiums for employees",
      "Flexible PTO policy",
      "No internal meetings on Fridays",
      "Access to Modern Health and other mental wellness resources",
      "Eight paid holidays",
      "Two additional week-long breaks in July and November",
      "401(k), short-term/long-term disability, life insurance, and other benefits"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://grnh.se/9090a6f21us?source=LinkedIn",
    "jobType": "Full Stack Developer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Introduction to Demandbase: \n\nDemandbase helps B2B companies hit their revenue goals using fewer resources. How? By using the power of AI to identify and engage the accounts and buying groups most likely to purchase. Our account-based technology unites sales and marketing teams around insights that you can understand and facilitates quick actions across systems and channels to deliver big wins. It’s flexible, scalable ABM built for you.\n\nAs a company, we prioritize both the advancement of careers and the development of world-class technology. We invest heavily in people, our culture, and the communities around us. We have offices strategically located in San Francisco and New York in the US, and Hyderabad, in India and we embrace a hybrid work model in these regions. Outside of these areas we offer a remote work option and boast a significant presence in Austin, TX, Atlanta, GA, and London, UK. Continuously lauded as a great place to work, we are Great Place to Work Certified, and have earned distinctions such as \"Fortune's Best Workplaces in the Bay Area,\"Best Workplaces in Technology,\" \"Best Workplaces for Millennials,\" and \"Best Workplaces for Parents\"!\n\nWe're committed to attracting, developing, retaining, and promoting a diverse workforce. By ensuring that every Demandbase employee is able to bring a diversity of talents to work, we're increasingly capable of achieving our mission to transform the way B2B companies go to market. We encourage people from historically underrepresented backgrounds and all walks of life to apply. Come grow with us at Demandbase!\n\nAbout the Role:\n\nIn this role, you'll be responsible for developing and maintaining the backend microservices and front-end application for our ABX & Sales Intelligence Cloud. You'll work closely with cross-functional teams, including Product, UX, and platform engineering, to build robust, scalable features powered by sophisticated ML-driven analytics. With a focus on Java/Scala for microservices and React/Typescript for the front-end, you’ll help set technical direction, implement best practices, and contribute to building reliable, testable APIs. Collaboration with Cloud Ops, QA, and DevOps is key to ensuring seamless deployment and high-quality releases.\n\nThe compensation range for this position is: $140,000 - $180,000\n\nWhat you’ll be doing:\n\n* Help develop and maintain the backend that powers our ABX & Sales Intelligence Cloud, primarily with Java/Scala microservices.\n* Help develop and own our single-page React (Typescript) application and set technical direction and standards across the product & engineering organization, participate in code reviews and help develop best practices.\n* Work on a cross-functional team (Product Managers, UX, and FE & BE engineers) to design, develop, test, and release rich and robust new functionality based around sophisticated ML-driven analytics and complex orchestration flows to drive sales and marketing automation\n* Work with Cloud Ops, QA, and Engineering to jointly own industry standard build, test, deploy pipelines, driving for best in class release processes.\n\nWhat we’re looking for:\n\n* Minimum of 2 years of relevant work experience as either a full stack engineer, backend engineer or frontend engineer.\n* Experience building microservices in Java/Scala\n* Solid understanding of building APIs atop RDBMS\n* Attention to detail at a visual and technical level\n* Has a product-oriented mind and strong desire to solve problems for customers\n* Should help drive thoughtful and testable API design\n* Experience working closely with UX and Product\n* Experience working closely with cross-functional platform engineering teams\n \n\nAdditional experience helpful for success in this role:\n\n* Has worked on large B2B and SaaS applications leveraging React, Redux, and Sagas.\n* Typescript experience or a strong desire to learn.\n* Experience using data visualization libraries like Highcharts or D3.\n* Strong Kubernetes and/or Istio experience\n* Experience with implementing and owning CI/CD pipelines (esp in Gitlab)\n* Experience with Postgres, ZIO, Clickhouse, Iceberg, Spark\n\nBenefits:\n\nOur benefits include options for up to 100% paid Medical and Vision premiums for employees, a flexible PTO policy, no internal meetings Fridays, as well as access to Modern Health and other mental wellness resources. Additionally, we offer eight paid holidays and two additional week-long breaks when all Demandbase employees in the US take time off simultaneously (the week of July 4th and the week of Thanksgiving). We also provide 401(k), short-term/long-term disability, life insurance, and other great benefits.\n\nOur Commitment to Diversity, Equity, and Inclusion at Demandbase:\n\nAt Demandbase, we believe in creating a workplace culture that values and celebrates diversity in all its forms. We recognize that everyone brings unique experiences, perspectives, and identities to the table, and we are committed to building a community where everyone feels valued, respected, and supported. Discrimination of any kind is not tolerated, and we strive to ensure that every individual has an equal opportunity to succeed and grow, regardless of their gender identity, sexual orientation, disability, race, ethnicity, background, marital status, genetic information, education level, veteran status, national origin, or any other protected status. We do not automatically disqualify applicants with criminal records and will consider each applicant on a case-by-case basis.\n\nWe recognize that not all candidates will have every skill or qualification listed in this job description. If you feel you have the level of experience to be successful in the role, we encourage you to apply!\n\nWe acknowledge that true diversity and inclusion requires ongoing effort, and we are committed to doing the work required to make our workplace a safe and equitable space for all. Join us in building a community where we can learn from each other, celebrate our differences, and work together.",
    "company": {
      "name": "Demandbase",
      "description": "Demandbase is the leading account-based GTM platform for B2B enterprises to identify and target the right customers, at the right time, with the right message. With a unified view of intent data, AI-powered insights, and prescriptive actions, go-to-market teams can seamlessly align and execute with confidence. Thousands of businesses depend on Demandbase to maximize revenue, minimize waste, and consolidate their data and technology stacks – all in one platform. For more information about how Demandbase can help you scale your GTM strategy, visit www.demandbase.com.",
      "locations": ["San Francisco, CA"],
      "website": "https://demandbase.com",
      "markets": ["Software Development"],
      "jobSources": null,
      "logo": "https://images.otta.com/search/width_400/Y29tcGFueS1sb2dvcy8xNDMyOC12R3JYamZQV1k2LTdKX05xNXFZOGlrUEI0T0JqUnpCYkVQTGhDNEtCbVc0LnBuZw.png"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "07ff87fc-e747-497c-9a7b-1c7466f1489f",
    "jobTitle": "Lead Software Engineer (Front End/JavaScript)",
    "country": "United States",
    "city": "Burbank",
    "state": "",
    "locationType": "Hybrid",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T16:31:37.244Z",
    "experienceLevel": "Not specified",
    "techStack": ["Rust", "C", "C++", "JavaScript"],
    "shortDescription": "Looking for a Lead Software Engineer to join the Hulu Native Client Platform Rust Client Application Engineering Team to enhance client applications on diverse devices.",
    "longDescription": {
      "benefits": [
        "Competitive salary",
        "Health insurance",
        "401(k) plan",
        "Paid time off"
      ],
      "responsibilities": "Contribute to building the Hulu client application experiences in Rust, develop new features, collaborate with hardware partners, and work closely with engineering teams.",
      "qualification_required": {
        "skills": ["Rust", "C/C++", "Embedded systems", "Multi-platform code"],
        "qualifications": [
          "7+ years of experience in C/C++",
          "2-3+ years of Rust experience",
          "Bachelor’s degree in Computer Science or related field"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "User interface design",
          "Graphics programming",
          "Cross device dependency management"
        ],
        "qualifications": [
          "Experience with set-top box development",
          "Familiarity with various chip architectures",
          "Knowledge of common design patterns"
        ]
      }
    },
    "benefits": [
      "Competitive salary",
      "Health insurance",
      "401(k) plan",
      "Paid time off"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.disneycareers.com/job/-/-/391/72641996720",
    "jobType": "Frontend Engineer",
    "salaryMin": "149300",
    "salaryMax": "219200",
    "currency": "USD",
    "rawDescription": "Disney Entertainment & ESPN Technology\n\nOn any given day at Disney Entertainment & ESPN Technology, we’re reimagining ways to create magical viewing experiences for the world’s most beloved stories while also transforming Disney’s media business for the future. Whether that’s evolving our streaming and digital products in new and immersive ways, powering worldwide advertising and distribution to maximize flexibility and efficiency, or delivering Disney’s unmatched entertainment and sports content, every day is a moment to make a difference to partners and to hundreds of millions of people around the world.\n\nA few reasons why we think you’d love working for Disney Entertainment & ESPN Technology\n\n* Building the future of Disney’s media business: DE&E Technologists are designing and building the infrastructure that will power Disney’s media, advertising, and distribution businesses for years to come.\n* Reach & Scale: The products and platforms this group builds and operates delight millions of consumers every minute of every day – from Disney+ and Hulu, to ABC News and Entertainment, to ESPN and ESPN+, and much more.\n* Innovation: We develop and execute groundbreaking products and techniques that shape industry norms and enhance how audiences experience sports, entertainment & news.\n\nThe Product & Data Engineering team is responsible for end-to-end development for Disney’s world-class consumer-facing products, including streaming platforms Disney+, Hulu, and ESPN+, and digital products & experiences across ESPN, Marvel, Disney Studios, NatGeo, and ABC News. The team drives innovation at scale for millions of consumers around the world across Apple, Android, Smart TVs, game consoles, and the web, with our platforms powering core experiences like personalization, search, messaging and data.\n\nAs part of the Hulu Native Client Platform Rust Client Application Engineering Team, you will help us push the boundaries of what is possible on some of the most interesting 10-foot devices in the marketplace! You’ll be part of the team that builds our Direct-to-Consumer Hulu client app on a wide range of devices supported by our Native Client Platform. Best of all, you’ll get to build these apps in Rust!\n\nWe’re looking for an engineer who has experience in Rust and comes from a C/C++ background, who knows how to write cross platform code, and is ready to push the boundaries of UX on our custom in-house runtime to provide the best app experiences for our viewers on devices across the varying spectrum from set-top boxes to modern game consoles.\n\nResponsibilities:\n\n* Bring advanced native engineering skills to be a critical member of a team of engineers responsible for building our client application experiences in Rust.\n* Contribute to the development of new application features from onboarding to browse UI/UX experiences, analytics, video playback UI/UX and much more. If you see it on screen, you’ll likely have a chance to work on it in code.\n* Work with hardware manufacturing partners to vet new hardware from a client application perspective.\n* Collaborate closely with our Native Client Platform Core engineering team, services engineering teams and product owners to help understand and explain device limitations and requirements.\n\nBasic Qualifications: \n\n* Candidates should have 7+ years of C/C++ experience on embedded systems and/or writing portable multi-platform code, with 2-3+ years of personal or professional Rust experience.\n* Understanding of various chip architectures and what features they support.\n* Experience using build runners / compilation tools for multi-platform projects.\n* Bachelor’s degree or better in Computer Science or a related technical field or equivalent job experience.\n\nPreferred Qualifications: \n\n* Experience working on user interface-level code with knowledge of common patterns, architectures and approaches to present a data driven UX to viewers.\n* Familiarity with set-top box development and specialized SoCs from manufacturers like Broadcom, MediaTek, SigmaTel, etc.\n* Graphics experience with OpenGL/EGL, OpenGL ES, Vulkan, Metal, etc.\n* Cross device dependency management\n* Game engines and game engine technologies\n* Internals of browser technology such as Webkit, WPE, Chromium, Cobalt\n\n#DisneyTech\n\nThe hiring range for this position in Seattle, Washington and New York City is $156,300 - $209,600 per year and in Bristol, Connecticut, Santa Monica, California and Glendale, California is $149,300 - $200,200 per year and in San Francisco, California is $163,500 - $219,200 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.",
    "company": {
      "name": "The Walt Disney Company",
      "description": "The Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise that includes three core business segments: Disney Entertainment, ESPN, and Disney Experiences.\n\nOur mission is to entertain, inform and inspire people around the globe through the power of unparalleled storytelling, reflecting the iconic brands, creative minds and innovative technologies that make us the world’s premier entertainment company.",
      "locations": ["Santa Monica, CA"],
      "website": "https://thewaltdisneycompany.com",
      "markets": ["Entertainment Providers"],
      "jobSources": ["linkedin"],
      "logo": "https://d2q79iu7y748jz.cloudfront.net/s/_logo/0bc560a26691d51a37ecdb0a83a1cb67"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "c63a521d-8aef-4292-a59c-eb817cdb9667",
    "jobTitle": "Software Engineer",
    "country": "United States",
    "city": "Scottsdale",
    "state": "",
    "locationType": "Hybrid",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T16:31:36.673Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Angular",
      "Node.js",
      "Typescript",
      "AWS",
      "MongoDB",
      "PostgresSQL",
      "Redis",
      "Git",
      "Github",
      "AI/LLM"
    ],
    "shortDescription": "We are looking for a rockstar engineer to help continue building on our AI platform and be a core contributor in the maintenance and development of our current software.",
    "longDescription": {
      "benefits": [
        "Health, Dental and Vision",
        "Unlimited PTO",
        "Hybrid Position",
        "Equity in Company",
        "Tools You Need",
        "A Place to Grow"
      ],
      "responsibilities": "You’ll work closely with the product team to translate raw business requirements into rock solid technical solutions, create high-speed, cloud-based web applications, improve existing and build new software development processes, mentor other engineers, and own projects from inception to production.",
      "qualification_required": {
        "skills": [
          "Full stack web development",
          "Database technology like PostgresSQL or MongoDB",
          "Software testing strategies",
          "HTTP understanding",
          "Scalable and reliable systems",
          "Design patterns like SOLID"
        ],
        "qualifications": ["3+ years in full stack web development"]
      },
      "qualification_preferred": {
        "skills": [
          "DevOps processes and systems",
          "Provisioning and maintaining software infrastructure",
          "Cloud provider experience (preferably AWS)",
          "Software security best practices",
          "High-scale product experience"
        ],
        "qualifications": []
      }
    },
    "benefits": [
      "Health, Dental and Vision",
      "Unlimited PTO",
      "Hybrid Position",
      "Equity in Company",
      "Tools You Need",
      "A Place to Grow"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.linkedin.com/jobs/view/4068721392/",
    "jobType": "Full Stack Developer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "About Us\n\nNurture Boss is a rapidly growing SaaS startup providing AI for Multifamily helping the space more effectively market to their prospects and residents with new and innovative strategies. We are looking for team members who are self-disciplined, motivated, able to work with ambiguity and continue to build this company and maintain our best in class service, within the Multifamily Industry. These people will help lay the foundation the company will build on top of for years to come. They’ll have the grit and tenacity to work hard as an individual contributor while also building a framework around them that will grow with the company as we scale.\n\nWhat We Need\n\nAre you ready to leave your mark with software? Do you feel like you aren’t able to move fast enough at your current company? Do you have awesome ideas on how to scale highly-reliable software systems? You’ve come to the right place.\n\nWe are looking for a rockstar engineer to help continue building on our AI platform. You will be a core contributor in the maintenance and development of our current software. You will help in identifying processes and technologies to continue the work of building a QA lifecycle, DevOps infrastructure, and software architecture all built for scale. You will also be a founding member of our engineering team and will help shape the team culture at Nurture Boss.\n\nWe want people who love software and want to leave an impact on an industry. You’ll also get the chance to grow as a leader by working closely with the Revenue, Customer Success, Product, and Marketing teams and mentoring your fellow engineers.\n\nWhat We Use\n\n* Angular frontend\n* node.js (with Typescript) on AWS\n* MongoDB, PostgresSQL, and Redis\n* Various AWS services (EC2, Lambda, S3, etc)\n* Git & Github\n* AI/LLM\n\nWhat You’ll Do\n\n* You’ll work closely with the product team to translate raw business requirements into rock solid technical solutions.\n* You’ll dive deep into new and existing technologies to help determine how they can best be leveraged to meet our needs.\n* You’ll create high-speed, cloud-based web applications using a variety of evolving technologies.\n* You’ll help improve existing and build new software development processes.\n* You’ll work closely with the other engineers in a highly collaborative environment.\n* You’ll own projects from inception to production.\n* You’ll mentor other engineers and share your experiences to help level-up the entire organization.\n\nWhat You’ve Done\n\n* 3+ years in full stack web development\n* Experience with some database technology like PostgresSQL or MongoDB\n* Experience with software testing strategies to ensure high quality automated releases\n* Concrete understanding of HTTP and how it works\n* A strong desire to make the code yours and own features end to end\n* Experience building scalable and reliable systems\n* Experience with some design patterns (e.g. SOLID) to help build maintainable software\n\nBonus Qualifications\n\n* Experience with DevOps processes and systems\n* Experience provisioning and maintaining software infrastructure\n* Experience with a major cloud provider (preferably AWS)\n* Experience with software security best practices\n* Experience building high-scale products (e.g. > 10,000 requests per second)\n\nWe Offer\n\nHealth, Dental and Vision – We offer the usual medical benefits along with unlimited PTO (and encouragement to use it!) to help you stay healthy and happy.\n\nUnlimited PTO – As mentioned we have unlimited PTO. We believe strongly in R&R to help you stay mentally and physically fresh. Burnout is real. The best employees are excited to come to work.\n\nHybrid Position – Need to deal with a contractor? Have an inconvenient appointment? No worries – this is a hybrid work position! While we love seeing each other in the office life, uh, has a way. We don’t want typical life duties to keep you from being productive. Our offices are located in Scottsdale, Arizona.\n\nEquity in Company – We are a true startup and want each employee to have skin in the game. It’s not worth working for if you don’t benefit in the end. Everyone who joins Nurture Boss gets their fair share of equity.\n\nTransparency – We don’t hold back. Everyone has access to the most recent business metrics and financial information.\n\nTools You Need – We provide every employee with a Mac or PC laptop and monitor. We also purchase any other tools you need to be productive.\n\nA Place to Grow – At Nurture Boss the possibilities are endless!\n\nOur Values\n\nChallenge & Collaborate – Working together with diverse backgrounds creates the best results. We all bring unique viewpoints to solve each problem. We have strong opinions that are loosely held.\n\nDone Is Better Than Perfect – Something is better than nothing. We let our customers tell us what needs to be different and don’t hold back value waiting for perfection. We remain agile to deliver value fast.\n\nProblem Solving – We are obsessed with our customers’ problems. Their success is our success. We follow through and deliver on our promises.\n\nForever Learning – Intelligence is knowing there is more to know. Failing forwards means we are always improving and getting better, creating an environment that fosters personal and professional growth.\n\nRadical Candor – With trust and accountability we achieve radically candid communication to level up and feel heard.\n\n \n\nNurture Boss is an equal opportunity employer and values diversity at our company. We provide equal employment opportunities to all employees and applicants for employment and prohibit discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
    "company": {
      "name": "Nurture Boss",
      "description": "Nurture Boss provides best in class automated prospect follow up & resident communication for multifamily!\n\nReduce the number of tasks for your onsite team while increasing the prospect and resident experience at your properties. More engagement and higher conversions start with automating your workflows!\n\nConvert more leads and save time for onsite teams with automated prospect follow up. By sending custom, hyper-personalized content to every lead in your CRM Nurture Boss will identify hot leads, help prospects self-serve through the lead to lease lifecycle, create more traffic, and capture more applications all while saving your onsite teams over 2 hours each day!\n\nTurn residents into advocates with automated resident communication. Resident retention starts the day a lease is signed not 90 days prior to renewal. Send key communication during milestone moments, create a delightful experience, and ensure each and every resident feels heard with Nurture Boss. Automated resident communication means more on-time rent payments, more online reviews, more resident referrals, and a higher lease renewal rate!\n\nFollow us on Facebook: https://www.facebook.com/nutureboss\nFollow us on Instagram: https://www.instagram.com/nurtureboss/",
      "locations": ["Scottsdale, AZ"],
      "website": "https://nurtureboss.io",
      "markets": ["Advertising Services"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/D560BAQHsm6RPpptq2A/company-logo_400_400/0/1709740013194/nurture_boss_logo?e=1724284800&v=beta&t=7QenHEpaITBHBwlj0A8Q8HE4iL0rFhC103JYSl8D6mk"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "5cc6c4cb-9c3a-4ca5-b553-f4128d0e194d",
    "jobTitle": "Software Engineer III, PEGA",
    "country": "United States",
    "city": "New York",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T16:11:36.004Z",
    "experienceLevel": "Not specified",
    "techStack": ["Java", "Pega", "AWS", "Oracle", "SQL", "PL/SQL"],
    "shortDescription": "Join JPMorgan Chase as a Software Engineer III, where you'll design and deliver secure Pega applications in an agile environment.",
    "longDescription": {
      "benefits": [
        "Comprehensive health care coverage",
        "On-site health and wellness centers",
        "Retirement savings plan",
        "Backup childcare",
        "Tuition reimbursement",
        "Mental health support",
        "Financial coaching"
      ],
      "responsibilities": "Execute software solutions, design and develop applications, troubleshoot technical issues, and ensure coding standards are met while contributing to the team culture.",
      "qualification_required": {
        "skills": [
          "Java",
          "Pega",
          "SQL",
          "Application Development",
          "Agile Methodologies"
        ],
        "qualifications": [
          "Formal training or certification in software engineering",
          "3+ years of hands-on experience with Pega and Java"
        ]
      },
      "qualification_preferred": {
        "skills": ["AWS", "Pega Certification"],
        "qualifications": []
      }
    },
    "benefits": [
      "Comprehensive health care coverage",
      "On-site health and wellness centers",
      "Retirement savings plan",
      "Backup childcare",
      "Tuition reimbursement",
      "Mental health support",
      "Financial coaching"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://d.hodes.com/r/tp2?e=se&tv=pixel_tracker&aid=jpmorgan&p=web&se_ca=indeed&se_ac=click&se_la=21258411&u=https%3A%2F%2Fjpmc.fa.oraclecloud.com%2FhcmUI%2FCandidateExperience%2Fen%2Fsites%2FCX_1001%2Fjob%2F210569561%3Futm_medium%3Djobboard%26utm_campaign%3DNAMR%2520Priority%2520-%2520Texas%26utm_content%3DSoftware%2520Engineer%2520III%2C%2520PEGA%26utm_term%3D210569561%26utm_source%3DIndeed&se_pr=d378060057c4b216&se_va=26983&tr_af=organic&ti_id=2245_210569561",
    "jobType": "Backend Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "**JOB DESCRIPTION**  \n\nWe have an exciting and rewarding opportunity for you to take your software engineering career to the next level.  \n\n\n\n  \n\nAs a Software Engineer III at JPMorgan Chase within the COMMERCIAL \\& INVESTMENT BANKING team, you serve as a member of an agile team to design and deliver Pega application in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.\n\n **Job Responsibilities**\n\n* Executes software solutions, design, development, and technical troubleshooting with ability to think beyond routine or conventional approaches to build solutions or break down technical problems\n* Creates secure and high\\-quality production code.\n* Produces architecture and design artifacts for complex applications while being accountable for ensuring design constraints are met by software code development\n* Gathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse data sets in service of continuous improvement of software applications and systems\n* Proactively identifies hidden problems and patterns in data and uses these insights to drive improvements to coding hygiene and system architecture\n* Contributes to software engineering communities of practice and events that explore new and emerging technologies\n* Adds to team culture of diversity, equity, inclusion, and respect\n\n\n\n\n**Required Qualifications, Capabilities \\& Skills**\n\n* Formal training or certification on software engineering concepts and 3\\+ years applied experience\n* 3\\+ years of Pega Hands\\-on practical experience, expertise in system design, application development, testing, and operational stability of application using multiple technologies including Java, Control\\-M, AWS, Oracle.\n* 2\\+ years of Java Hands\\-on practical experience, experience in system design, application development, testing.\n* Needs to have experience \\& good understanding of SQL, PL/SQL, Oracle DB, Control\\-M.\n* Experience in developing, debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languages\n* Overall knowledge of the Software Development Life Cycle\n* Solid understanding of agile methodologies such as CI/CD, Application Resiliency, and Security\n\nDemonstrated knowledge of software applications and technical processes within a technical discipline  \n* \n\n**Preferred qualifications, capabilities, and skills**\n\n* Java \\& AWS experience or Certifications are nice to have\n* Certification on pega is preferred\n\n\n\n\n**ABOUT US**  \n\n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\nWe offer a competitive total rewards package including base salary determined based on the role, experience, skill set, and location. For those in eligible roles, we offer discretionary incentive compensation which may be awarded in recognition of firm performance and individual achievements and contributions. We also offer a range of benefits and programs to meet employee needs, based on eligibility. These benefits include comprehensive health care coverage, on\\-site health and wellness centers, a retirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more. Additional details about total compensation and benefits will be provided during the hiring process.\n\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\n\nJPMorgan Chase \\& Co. is an Equal Opportunity Employer, including Disability/Veterans\n\n  \n\n  \n\n  \n\n**ABOUT THE TEAM**  \n\n  \n\nOur Corporate \\& Investment Bank relies on innovators like you to build and maintain the technology that helps us safely service the world’s important corporations, governments and institutions. You'll develop solutions that help the bank provide strategic advice, raise capital, manage risk, and extend liquidity in markets spanning over 100 countries around the world.",
    "company": {
      "name": "JPMorganChase",
      "description": "With a history tracing its roots to 1799 in New York City, JPMorganChase is one of the world's oldest, largest, and best-known financial institutions—carrying forth the innovative spirit of our heritage firms in global operations across 100 markets.\n \nWe serve millions of customers and many of the world’s most prominent corporate, institutional, and government clients daily, managing assets and investments, offering business advice and strategies, and providing innovative banking solutions and services.\n\nSocial Media Terms and Conditions: https://bit.ly/JPMCSocialTerms\n\n© 2024 JPMorgan Chase & Co. All rights reserved. JPMorganChase is an Equal Opportunity Employer, including Disability/Veterans.\n ",
      "locations": ["Plano, TX"],
      "website": "https://jpmorganchase.com",
      "markets": ["Financial Services"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGxpntCyRgsuA/company-logo_400_400/company-logo_400_400/0/1718711710850/jpmorganchase_logo?e=1739404800&v=beta&t=EF70-p8H72yU8GyXRcKDSt85LznBKUxQjfZauXvWhNY"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "b74864ae-f6f3-4cb4-b32d-5bc616361a51",
    "jobTitle": "Software Engineer C#",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T15:51:00.050Z",
    "experienceLevel": "Not specified",
    "techStack": ["C#", ".NET Framework", "SQL Server", ".NET Core", "Azure"],
    "shortDescription": "Designs and develops software solutions that control a fleet of automated guided vehicles.",
    "longDescription": {
      "benefits": [
        "Medical",
        "Dental",
        "Life insurance",
        "Short-term and long-term disability",
        "Family leave",
        "Vision coverage",
        "Matched 401(k) plan"
      ],
      "responsibilities": "Work with the Software Architect and other members of the team to aid in the design and implementation of software solutions. This includes new development and fixing software problems on the current platform. Software development occurs within the Microsoft Windows development environment using Agile Methodologies and Jira. Complete assignments as part of a diverse project team. Participate in design and code reviews. Travels to customer sites.",
      "qualification_required": {
        "skills": [
          "Experience communicating updates and resolutions to customers and other partners",
          "Foundation in Object Oriented Programming",
          "Ability to travel on short notice for up to 10% of the time, domestic and international",
          "5 or more years of development experience using C#",
          "Familiarity with the .NET Framework, SQL Server, and design/architectural patterns"
        ],
        "qualifications": [
          "Minimum of a bachelor's degree (B. S.) in Computer Science or Engineering from a four-year college or university"
        ]
      },
      "qualification_preferred": {
        "skills": [
          ".NET Core experience",
          "Experience with multi-threaded applications",
          "Create and test software prototypes",
          "Web Services (REST and SOAP)",
          "Cloud-based architecture experience (Azure)"
        ],
        "qualifications": []
      }
    },
    "benefits": [
      "Medical",
      "Dental",
      "Life insurance",
      "Short-term and long-term disability",
      "Family leave",
      "Vision coverage",
      "Matched 401(k) plan"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.ziprecruiter.com/c/JBT-Corporation/Job/Software-Engineer-C-/-in-Chalfont,PA?jid=c7bb292cd2164247&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Backend Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Overview ...\n\nDesigns and develops software solutions that control a fleet of automated guided vehicles...\n\nThe Opportunity ...\n\nResponsibilities:\n• Work with the Software Architect and other members of the team to aid in the design and implementation of software solutions. This includes new development and fixing software problems on the current platform.\n• Software development occurs within the Microsoft Windows development environment using Agile Methodologies and Jira.\n• Complete assignments as part of a diverse project team.\n• Participate in design and code reviews.\n• Travels to customer sites.\n\nRequirements:\n• Experience communicating updates and resolutions to customers and other partners.\n• Work as part of a team.\n• Foundation in Object Oriented Programming.\n• Able to travel on short notice for up to 10% of the time, domestic and international.\n\nKnowledge and Skills:\n• 5 or more years of development experience using C#.\n• Familiarity with the .NET Framework, SQL Server and design/architectural patterns implemented within software frameworks.\n• .NET Core experience.\n• Experienced with multi-threaded applications.\n• Create and test software prototypes.\n• Web Services (REST and SOAP)\n• NET experience is a plus.\n• Cloud based architecture experience (Azure)\n\nExperience:\n\nMinimum of a bachelor's degree (B. S.) in Computer Science or Engineering from four-year college or university.\n\nSupervisory Responsibility:\n\nNone\n\nWhy work at JBT ...\n\nFinancial Responsibility:\n\nExperience providing engineering support to customer support team to resolve any critical customer issues and effort to meet task budgets and schedules and report status to the manager.\n\nWork Environment and Physical Demands:\n\nReasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n\nWork Environment:\n\nSpend majority of time in a manufacturing environment which is temperature controlled.\n\nThis job operates in a professional office environment. You will use standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.\n\nBenefits: JBT Corporation offers benefits on day 1 of your employment. Including: Medical, Dental, life insurance, short-term and long-term disability, family leave, vision coverage, and a matched 401(k) plan.\n\nCommitment to Diversity: Diversity, Equity, Inclusion, and Belonging is a fundamental value to JBT and critical to our future success. A thoughtful, focused, and sustained effort to work towards our DEIB goals is not just a principled choice, but also a business imperative.\n\nCandidates must be eligible to work in the US with no sponsorship requirements needed now or in the future\n\nAN EQUAL OPPORTUNITY EMPLOYER\n\nJohn Bean Technologies Corporation (\"JBT\") provides equal employment opportunity to all employees and qualified applicants for employment. We will not tolerate any form of discrimination against any employee or applicant for employment because of race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, veteran status, citizenship, or any other characteristic protected by applicable federal, state, or local laws. At JBT, we apply this policy to all our employment practices, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, benefits, and training. We make hiring decisions based solely on qualifications, merit and business needs at the time. JBT will reasonably accommodate applicants who need adjustments to participate in the application or interview process. If you require assistance or accommodation during the application process, please contact AGV at amir.whittington@jbtc.com.\n\n#LI-KF1",
    "company": {
      "name": "JBT Corporation",
      "description": null,
      "locations": ["Chalfont, PA"],
      "website": null,
      "markets": null,
      "jobSources": null,
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJLrCwyLnKbwimKijTHAiwA0607jZUqHcFCWWq&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "73f28d2e-d634-43be-95c0-b12c364a7825",
    "jobTitle": "Associate Software Engineer",
    "country": "United States",
    "city": "Herndon",
    "state": "",
    "locationType": "Remote",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T15:25:14.783Z",
    "experienceLevel": "Not specified",
    "techStack": ["HTML", "JavaScript", "XML", ".Net", "C#", "SQL"],
    "shortDescription": "Aiming to deliver high-quality software products as part of a global team, ideal for newcomers to software development.",
    "longDescription": {
      "benefits": [
        "healthcare benefits",
        "401(k) plan and company match",
        "paid vacation time",
        "holidays",
        "well-living programs",
        "short-term and long-term disability coverage",
        "basic life insurance",
        "tuition reimbursement"
      ],
      "responsibilities": "Works with development, quality assurance and product management teams across the US, UK, Philippines, and India to deliver high-quality software products and updates. Operates under close supervision and reports to the Engineering Manager. Work collaboratively in a global, diverse team environment.",
      "qualification_required": {
        "skills": ["HTML", "JavaScript", "XML", ".Net", "C#", "SQL"],
        "qualifications": [
          "A bachelor’s degree in Computer Science, Computer Engineering, IT, or any related field",
          "At least 6 months of experience as a full-stack professional software developer"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Agile development methodology",
          "SQL scripting",
          "data manipulation"
        ],
        "qualifications": [
          "Education or experience in Project Accounting, Financial Accounting, Planning, Payroll, Inventory, or Purchasing"
        ]
      }
    },
    "benefits": [
      "healthcare benefits",
      "401(k) plan and company match",
      "paid vacation time",
      "holidays",
      "well-living programs",
      "short-term and long-term disability coverage",
      "basic life insurance",
      "tuition reimbursement"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?partnerid=25397&siteid=5259&PageType=JobDetails&jobid=619801",
    "jobType": "Full Stack Developer",
    "salaryMin": "47500",
    "salaryMax": "71250",
    "currency": "USD",
    "rawDescription": "As the recognized global standard for project\\-based businesses, Deltek delivers software and information solutions to help organizations achieve their purpose. Our market leadership stems from the work of our diverse employees who are united by a passion for learning, growing and making a difference. At Deltek, we take immense pride in creating a balanced, values\\-driven environment, where every employee feels included and empowered to do their best work. Our employees put our core values into action daily, creating a one\\-of\\-a\\-kind culture that has been recognized globally. Thanks to our incredible team, Deltek has been named one of America's Best Midsize Employers by Forbes, a Best Place to Work by Glassdoor, a Top Workplace by The Washington Post and a Best Place to Work in Asia by World HRD Congress. www.deltek.com\n**Position Responsibilities**\n\n\n* Works with development, quality assurance and product management teams across the US, UK, Philippines, and India to deliver high\\-quality software products and updates\n* Operates under close supervision and reports to the Engineering Manager\n* Work collaboratively in a global, diverse team environment with a spirit of cooperation\n* The ideal candidate will be a newcomer to software development, with limited experience in developing and maintaining web applications gained through traditional education and some through on\\-the\\-job practice\n\n**Qualifications**\n\n\n* A bachelor’s degree in Computer Science, Computer Engineering, IT, or any related field\n* At least 6 months of experience as a full\\-stack professional software developer, utilizing HTML, JavaScript, XML, and VB.Net/C\\#\n* Has knowledge and skills in Relational Database Management System (RDBMS) and SQL\n* Experience with SQL scripting and data manipulation would be a plus\n* Education or experience in Project Accounting, Financial Accounting, Planning, Payroll, Inventory, or Purchasing\n* Quick to learn new products and technologies\n* Ideal candidate will have an Agile development methodology background\n* Strong analytical, problem\\-solving and troubleshooting skills\n* Experience in ERP system, Web Services, Automated Testing Tools and reporting tool is a plus\n* Fresh graduates with solid software development on the job training are welcome to apply\n\n**Compensation Information**\n\n\nThe U.S. salary range for this position is $47500\\.00 \\- $71250\\.00\\. This range is subject to change as Deltek takes a number of factors into consideration when determining individual base pay, such as location, job\\-related knowledge, skills and experience. Certain roles are eligible for additional rewards, including incentive compensation and equity.  \n\n  \n\nBenefits and perks listed here may vary depending on the nature of employment with Deltek. Employees have access to healthcare benefits, a 401(k) plan and company match, paid vacation time and holidays, well\\-living programs, short\\-term and long\\-term disability coverage, basic life insurance and tuition reimbursement.\n**Travel Requirements**\n\n\nNo\n**Compliance Requirements**\n\n\nCertain roles may have additional privacy, security and compliance requirements to the extent they support Costpoint GCCM or similar product offerings.\n**EEO Statement**\n\n\n*Deltek, Inc. is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.*\n**E\\-Verify Statement**\n\n\nDeltek, Inc., utilizes the E\\-Verify program with every potential new hire. This makes it possible for us to make certain that every employee who works for Deltek is eligible to work in the United States. To learn more about E\\-Verify you can call 1\\-800\\-255\\-7688 or visit their website by clicking the logo below. E\\-Verify® is a registered trademark of the United States Department of Homeland Security.\n**Applicant Privacy Notice**\n\n\n*Deltek is committed to the protection and promotion of your privacy. In connection with your application for employment with us at Deltek, it is necessary for us to collect, store and use information about you (“Personal Data”) to administer and evaluate your application. We are the “controller” of the Personal Data you provide us and will process any such Personal Data in accordance with applicable law and the statements contained in this* Employment Candidate Privacy Notice*. Additionally, we have not sold and do not sell Personal Data you provide to us through the job application process.*",
    "company": {
      "name": "Deltek",
      "description": "Project-based businesses transform the world we live in. Deltek innovates and delivers software and solutions that power them to achieve their purpose. Our industry-specific software and information solutions maximize our customers' performance at every stage of the project lifecycle by enabling superior levels of project intelligence, management and collaboration. \n\nDeltek is the recognized global standard for project-based businesses across government contracting and professional services industries, helping more than 30,000 organizations of all sizes deliver on their mission. \n\nWith over 4,200 employees worldwide, our team of industry experts is passionately committed to creating exceptional customer experiences.\n",
      "locations": ["Remote"],
      "website": "https://deltek.com",
      "markets": ["Software Development"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQG4aZ6_zAe6MQ/company-logo_400_400/company-logo_400_400/0/1677100273595/deltek_logo?e=1739404800&v=beta&t=GGu20km3Vr51SjUFxe3oSyGer07q3_7PIv8fU6YjP_Q"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "5deffe35-402d-49da-8b89-1ccb51406dc6",
    "jobTitle": "Senior Full Stack .Net Developer",
    "country": "United States",
    "city": "Jersey City",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T15:12:15.759Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "React",
      ".NET Core",
      "C#",
      "ASPNET Web API",
      "ASPNET MVC",
      "Angular",
      "Webpack",
      "NPM",
      "JSON/XML",
      "LINQ",
      "Entity Framework",
      "IoC frameworks",
      "CI/CD",
      "Redis",
      "AWS"
    ],
    "shortDescription": "We are looking for a strong and motivated software developer to work as part of a team in developing and implementing innovative software solutions.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Develop and implement long-term strategic direction, including software architecture and alignment with company performance objectives. Provide work breakdown and estimates for complex software development projects. Serve as a liaison to internal customers, research groups, and various business support areas. Design and develop software applications supporting business objectives. Analyze and debug applications in development and production environments and resolve production issues within the accepted timeframes. Conduct code reviews, automation, perform thorough Unit/Integration testing of assigned applications. Write technical documentation and release notes for the applications. Provide technical guidance to junior programmers and other software engineers.",
      "qualification_required": {
        "skills": [
          "Strong hands-on experience in the entire development life cycle of software products",
          "Superior organization skills",
          "Strong troubleshooting, code optimization, and refactoring skills"
        ],
        "qualifications": [
          "Bachelor’s degree or equivalent in Computer Science or a related field",
          "5+ years of proven experience in software development and system maintenance",
          "5 years of experience in stakeholder communication, including external customers"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Experience with UX patterns",
          "Multi-threaded programming experience",
          "Experience with CSS pre-compilers"
        ],
        "qualifications": [
          "Experience working with internal customers, research groups, and various business support areas"
        ]
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobs.smartrecruiters.com/Verisk/744000022623604-senior-full-stack-net-developer",
    "jobType": "Full Stack Developer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Company Description\n\nWe help the world see new possibilities and inspire change for better tomorrows. Our analytic solutions bridge content, data, and analytics to help business, people, and society become stronger, more resilient, and sustainable.\n\nJob Description\n\nWe are looking for a strong and motivated software developer to work as part of a team in developing and implementing innovative software solutions. You will work closely with a cross-functional team of developers, QA engineers, and product owners in a fast-paced and cutting-edge environment. You will use your deep technical knowledge and experience to build robust, efficient, and performant software applications. You will always find new challenges that excite you and keep you motivated.\n\nResponsibilities:\n\n* Develop and implement long-term strategic direction, including software architecture and alignment with company performance objectives. \n* Provide work breakdown and estimates for complex software development projects. \n* Serve as a liaison to internal customers, research groups, and various business support areas\n* Design and develop software applications supporting business objectives\n* Analyze and debug applications in development and production environments and resolve production issues within the accepted timeframes\n* Conduct code reviews, automation, perform thorough Unit/Integration testing of assigned applications\n* Write technical documentation and release notes for the applications\n* Provide technical guidance to junior programmers and other software engineers\n\nQualifications\n\n* Bachelor’s degree or equivalent in Computer Science or a related field\n* 5+ years of proven experience in software development and system maintenance\n* 5 years of experience in stakeholder communication, including external customers\n* Superior organization skills, skilled at recognizing priorities and keeping the team focused on the most important features\n* Strong hands-on experience in the entire development life cycle of software products - coordination of project meetings, project scheduling from the design stage to the deployment stage, and final Ready-to-Ship product. \n* Solid experience and understanding in the following technologies: React, .NET Core, C#, ASPNET Web API, ASPNET MVC, Angular, Webpack module loader, NPM, JSON/XML, LINQ, Entity Framework, IoC frameworks, CI/CD, Redis\n* Solid understanding of CSS syntax, HTML5 specs, browser shortcomings/differences, and polyfills\n* Solid understanding of Bootstrap/Material CSS components and how/when to use each\n* Experience working with AWS technologies like AWS Batch, Lambda, S3, SQS, etc. \n* Excellent understanding of object-oriented design concepts and software development processes and methods\n* Solid understanding of parallel programming, async/await, and the TPL library\n* Developed software in the SCRUM environment using Agile methodologies\n* Ability to effectively work on multiple projects simultaneously and effectively contend with competing priorities\n* Must have strong troubleshooting, code optimization, and refactoring skills\n* Ability to learn and adapt to continuously changing technology\n* Must have a passion for development and the latest technologies\n* Experienced at translating high-level requirements into logical tasks and identifying the technical requirements for each task\n* Experience working with internal customers, research groups, and various business support areas\n\nNice to haves:\n\n* Designer’s eye\n* Experience with UX patterns and ability to design complex applications\n* Experience with CSS pre-compilers (SASS, LESS)\n* Multi-threaded programming experience in both procedural and functional paradigms\n* Experience with client-side optimization (GZIP, sprites, minification, obfuscation, browser caching)\n\nAdditional Information\n\nFor over 50 years, Verisk has been the leading data analytics and technology partner to the global insurance industry by delivering value to our clients through expertise and scale. We empower communities and businesses to make better decisions on risk, faster.\n\nAt Verisk, you'll have the chance to use your voice and build a rewarding career that's as unique as you are, with work flexibility and the support, coaching, and training you need to succeed.\n\nFor the eighth consecutive year, Verisk is proudly recognized as a Great Place to Work® for outstanding workplace culture in the US, fourth consecutive year in the UK, Spain, and India, and second consecutive year in Poland. We value learning, caring and results and make inclusivity and diversity a top priority. In addition to our Great Place to Work® Certification, we’ve been recognized by The Wall Street Journal as one of the Best-Managed Companiesand by Forbesas a World’s Best Employer and Best Employer for Women, testaments to the value we place on workplace culture.\n\nWe’re 7,000 people strong. We relentlessly and ethically pursue innovation. And we are looking for people like you to help us translate big data into big ideas. Join us and create an exceptional experience for yourself and a better tomorrow for future generations.\n\nVerisk Businesses\n\nUnderwriting Solutions— provides underwriting and rating solutions for auto and property, general liability, and excess and surplus to assess and price risk with speed and precision\n\nClaims Solutions— supports end-to-end claims handling with analytic and automation tools that streamline workflow, improve claims management, and support better customer experiences\n\nProperty Estimating Solutions— offers property estimation software and tools for professionals in estimating all phases of building and repair to make day-to-day workflows the most efficient\n\nExtreme Event Solutions— provides risk modeling solutions to help individuals, businesses, and society become more resilient to extreme events.\n\nSpecialty Business Solutions— provides an integrated suite of software for full end-to-end management of insurance and reinsurance business, helping companies manage their businesses through efficiency, flexibility, and data governance\n\nMarketing Solutions— delivers data and insights to improve the reach, timing, relevance, and compliance of every consumer engagement\n\nLife Insurance Solutions– offers end-to-end, data insight-driven core capabilities for carriers, distribution, and direct customers across the entire policy lifecycle of life and annuities for both individual and group.\n\nVerisk Maplecroft— provides intelligence on sustainability, resilience, and ESG, helping people, business, and societies become stronger\n\nVerisk Analytics is an equal opportunity employer.\n\nAll members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.Verisk’s minimum hiring age is 18 except in countries with a higher age limit subject to applicable law.\n\nhttps://www.verisk.com/company/careers/\n\nUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.\n\nhttps://www.verisk.com/privacy-policies/data-privacy-notice-for-employees-applicants-and-independent-contractors/",
    "company": {
      "name": "ISO",
      "description": "Underwriting solutions at Verisk is a leading provider of advanced tools and analytics for the property/casualty and life insurance industries. Drawing on unique data assets and deep domain expertise, Verisk’s products and services help insurers underwrite and price risks with greater precision and efficiency. For more than 50 years, Verisk has been a leader in developing innovative solutions and working with multiple stakeholders in the insurance marketplace, including insurers, reinsurers, agents and brokers, insurance regulators, and risk managers. For more information, visit www.verisk.com/insurance",
      "locations": ["Jersey City, NJ"],
      "website": "https://verisk.com",
      "markets": ["Insurance"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQHRkgBFIWtQJg/company-logo_400_400/company-logo_400_400/0/1644423870522/verisk_underwriting_solutions_logo?e=1739404800&v=beta&t=Y9D9CPWwHHyMhMkDLrFEKKQFnc7diMfCxfUtfh-XzGA"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "5c0afa70-c780-4ff9-a2b9-88ef0395fa9a",
    "jobTitle": "Principal Software Engineer, Machine Learning Backend Systems",
    "country": "United States",
    "city": "Sunnyvale",
    "state": "",
    "locationType": "Remote",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T15:09:36.867Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Python",
      "AWS",
      "GCP",
      "Docker",
      "Kubernetes",
      "Terraform",
      "FastAPI",
      "Gunicorn",
      "Asyncio"
    ],
    "shortDescription": "Seeking a Principal Software Engineer for Machine Learning Backend Systems at Yahoo to enhance user experiences through advanced ML systems.",
    "longDescription": {
      "benefits": [
        "healthcare",
        "401K savings plan",
        "company holidays",
        "vacation",
        "sick time",
        "parental leave",
        "employee assistance program"
      ],
      "responsibilities": "Leverage third-party, open-source, and in-house machine learning tools to build high-performing machine learning systems. Provide expertise and input on managing and creating infrastructure in AWS and GCP. Troubleshoot performance issues at the data, network, and application levels to improve system performance. Work collaboratively with cross-functional partners to leverage machine learning to improve Yahoo News for our readers and build state-of-the-art tooling for our editorial team.",
      "qualification_required": {
        "skills": [
          "architecting and managing distributed systems",
          "databases including Spanner, BigTable, BigQuery",
          "distributed systems technologies like Docker, Kubernetes, Terraform",
          "version control systems",
          "build automation tools",
          "observability",
          "CI/CD pipeline creation",
          "strong programming skills in Python"
        ],
        "qualifications": [
          "Experience in GCP and AWS",
          "Experience with optimization for low latency",
          "Experience with ranking algorithms, search, or recommendation systems"
        ]
      },
      "qualification_preferred": {
        "skills": [],
        "qualifications": []
      }
    },
    "benefits": [
      "healthcare",
      "401K savings plan",
      "company holidays",
      "vacation",
      "sick time",
      "parental leave",
      "employee assistance program"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://ouryahoo.wd5.myworkdayjobs.com/en-US/careers/job/United-States-of-America---Remote/Principal-Software-Engineer--Machine-Learning-Backend-Systems_JR0024984?source=LinkedIn",
    "jobType": "Machine Learning Engineer",
    "salaryMin": "128250",
    "salaryMax": "266875",
    "currency": "USD",
    "rawDescription": "Yahoo serves as a trusted guide for hundreds of millions of people globally, helping them achieve their goals online through our portfolio of iconic products. For advertisers, Yahoo Advertising offers omnichannel solutions and powerful data to engage with our brands and deliver results.\n\nA Little About Us\n\nYahoo is a global media and tech company that connects people to their passions. We reach nearly 900M people worldwide, bringing them closer to what they love—from finance and sports to shopping, gaming, and news—with the trusted products, content, and tech that fuel their day. For partners, we provide a full-stack platform for businesses to amplify growth and drive more meaningful connections across advertising, search, and media.\n\nAt Yahoo News, we are laser-focused on making discovery delightful and becoming the world’s best curator for our 35 million daily users. We are also expanding our distribution to more platforms to meet millions more users where they are. Building the best guide to the Internet (and the world) requires building the best team.\n\nWho You Are\n\n* You excel at explaining technical concepts to anyone and everyone. People enjoy collaborating with you.\n* You have a bias for action. When you see problems, you solve them\n* You are extremely curious. You are constantly interested in how the software you interact with works “under the hood.”\n* You are customer-focused–regardless of whether the customer is an external user or an internal team.\n* You know that writing code isn’t the end of the process, and you delight in understanding how that code is running in production, looking at metrics, and planning improvements.\n\nResponsibilities\n\n* Leverage third-party, open-source, and in-house machine learning tools to build high-performing machine learning systems. \n* Provide expertise and input on managing and creating infrastructure in AWS and GCP.\n* Troubleshoot performance issues at the data, network, and application levels to improve system performance.\n* Work collaboratively with cross-functional partners to leverage machine learning to improve Yahoo News for our readers and build state-of-the-art tooling for our editorial team. \n\nQualifications\n\n* Experience architecting and managing distributed systems and components in GCP and AWS.\n* Has worked with databases, including Spanner, BigTable, and BigQuery.\n* Has worked with distributed systems technologies (e.g., Docker, Kubernetes, Terraform).\n* Understanding of version control systems, build automation tools, and observability.\n* Has built CI/CD pipelines with effective deployment/rollout strategies. \n* Strong programming skills in Python, having experience with optimization for low latency with FastAPI, Gunicorn, and Asyncio.\n* Preferred experience with ranking algorithms, search, or recommendation systems.\n\nWe encourage candidates who may not check all the boxes to apply.\n\nThe material job duties and responsibilities of this role include those listed above as well as adhering to Yahoo policies; exercising sound judgment; working effectively, safely and inclusively with others; exhibiting trustworthiness and meeting expectations; and safeguarding business operations and brand integrity.\n\nYahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo will consider for employment qualified applicants with criminal histories in a manner consistent with applicable law. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call +1.866.772.3182. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response.\n\nAt Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more.\n\nThe compensation for this position ranges from $128,250.00 - $266,875.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply.\n\nYahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements.\n\nIf you’re curious about how this factors into this role, please discuss with the recruiter.\n\nCurrently work for Yahoo? Please apply on our internal career site.",
    "company": {
      "name": "Yahoo",
      "description": "Yahoo serves as a trusted guide for hundreds of millions of people globally, helping them achieve their goals online through our portfolio of iconic products. For advertisers, Yahoo Advertising offers omnichannel solutions and powerful data to engage with our brands and deliver results. To learn more about Yahoo, please visit yahooinc.com.\n",
      "locations": ["United States"],
      "website": "https://yahooinc.com",
      "markets": ["Software Development"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE8SlwfLWJuDg/company-logo_400_400/company-logo_400_400/0/1663278242829/yahoo_logo?e=1739404800&v=beta&t=kxJ1HFXUei6L2RiThqMjJT32y30GiIUs9m187MoQcUQ"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "56746299-7e34-4eb6-a307-1da996b75003",
    "jobTitle": "SQL Software Engineer, Developer",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T15:02:42.456Z",
    "experienceLevel": "Not specified",
    "techStack": ["SQL", "Crystal Reports"],
    "shortDescription": "Responsible for designing, developing, and managing data infrastructure for Business Intelligence and Reporting.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Design, implement and maintain scalable and efficient data infrastructure; write high-quality, efficient code; perform QA testing and debugging; identify and fix bugs; collaborate with colleagues; create technical documentation; participate in code reviews; create SQL views and stored procedures; mentor Reporting Analysts.",
      "qualification_required": {
        "skills": ["SQL", "Crystal Reports"],
        "qualifications": [
          "4+ years of back-end data focused experience",
          "1+ years of healthcare related experience preferred"
        ]
      },
      "qualification_preferred": {
        "skills": ["EZ-CAP software", "healthcare claims applications"],
        "qualifications": []
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.linkedin.com/jobs/view/sql-software-engineer-developer-at-acm-business-solutions-llc-4072297770?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Backend Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Summary: Senior Software Engineer (SQL - Crystal Reports) - Healthcare Information Technology\n\nThe Senior Software Engineer is responsible for designing, developing, analyzing, and managing the data infrastructure needed to support Business Intelligence and Reporting. This position will be involved in all aspects of the software development life cycle. This individual will work closely with... Software Engineers, Reporting Analysts, Business Analysts, End Users and management teams to ensure data infrastructure is secure, stable and concrete.\n\nDuties and Responsibilities\n• Design, implement and maintain scalable and efficient data infrastructure to support all incoming data related requests\n• Write high-quality, efficient, maintainable code that is scalable\n• Perform QA testing and debugging of all written code to ensure it meets accuracy, reliability, and functionality standards\n• Identify and fix bugs, performance bottlenecks and other issues found through debugging and troubleshooting\n• Collaborate with colleagues from other departments during the project lifecycle\n• Create and maintain technical documentation including data flow diagrams, prototypes, project plans, user manuals\n• Participate in peer-to-peer code review to ensure adherence to coding standards, best practices and quality guidelines\n• Create SQL views, Common Table Expressions (CTEs) and stored procedures to combine/aggregate data needed for reporting purposes.\n• Mentor Reporting Analysts as requested\n\nMinimum Job Requirements\n• 4+ years of back-end data focused experience\n• 1+ years of healthcare related experience is preferred\n• Proficient in SQL and Crystal Reports development\n• EZ-CAP software application or other healthcare claims and benefits applications experience is a plus\n\nSkills and Abilities\n• Excellent written and verbal communication skills\n• Proven ability to work independently with little to no assistance from other engineers\n• Effective communications with other teammates\n• Ability to offer creative solutions to complex problems\n• Must be self-motivated\n• Excellent organizational skills\n• Must demonstrate the ability to work cohesively within a team environment\n• Ability to work in a fast-paced environment\n\nNo Third-Party Recruiters candidates or sponsorships accepted",
    "company": {
      "name": "ACM BUSINESS SOLUTIONS, LLC",
      "description": null,
      "locations": ["Anywhere"],
      "website": null,
      "markets": null,
      "jobSources": null,
      "logo": ""
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "4e66220a-5134-4a1b-9a94-063a14002119",
    "jobTitle": "UI Developer Job at LTIMindtree in Atlanta",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T15:01:57.171Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Angular",
      "Java Script",
      "Java",
      "API integration",
      "continuous integration",
      "containerization"
    ],
    "shortDescription": "UI Developer role requiring at least 5 years of experience and knowledge of Scrum/Agile methodologies.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Develop user interfaces using Angular and Java Script, ensuring integration with APIs and adherence to Agile methodologies.",
      "qualification_required": {
        "skills": ["Angular", "Java Script", "Java", "API integration"],
        "qualifications": [
          "At least 5 years of experience as a UI Developer",
          "Experience with Scrum/Agile development methodologies"
        ]
      },
      "qualification_preferred": {
        "skills": ["continuous integration", "containerization"],
        "qualifications": []
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.linkedin.com/jobs/view/ui-developer-job-at-ltimindtree-in-atlanta-at-ltimindtree-4070649780?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Frontend Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "About Us: LTIMindtree is a global technology consulting and digital solutions company that enables enterprises across industries to reimagine business models, accelerate innovation, and maximize growth by harnessing digital technologies. As a digital transformation partner to more than 700 clients, LTIMindtree brings extensive domain and technology expertise to help drive superior competitive differentiation, customer experiences, and business outcomes in a converging world. Powered by nearly 90,000 talented and entrepreneurial professionals across more than 30 countries, LTIMindtree — a Larsen &amp; Toubro Group company — combines the industry-acclaimed strengths of erstwhile Larsen and Toubro Infotech and Mindtree in solving the most complex business challenges and delivering transformation at scale. For more information, please visit www.ltimindtree.com. Role : UI Developer Location : Atlanta, GA Job Description: At least 5 years of experience as UI Developer. Have working experience... with Scrum/Agile development methodologies specifically in SAFe. Skill set: Angular, Java Script, Java knowledge, API integration, continuous integration, containerization LTIMindtree is an equal opportunity employer that is committed to diversity in the workplace. Our employment decisions are made without regard to race, color, creed, religion, sex (including pregnancy, childbirth or related medical conditions), gender identity or expression, national origin, ancestry, age, family-care status, veteran status, marital status, civil union status, domestic partnership status, military service, handicap or disability or history of handicap or disability, genetic information, atypical hereditary cellular or blood trait, union affiliation, affectional or sexual orientation or preference, or any other characteristic protected by applicable federal, state, or local law, except where such considerations are bona fide occupational qualifications permitted by law",
    "company": {
      "name": "LTIMindtree",
      "description": "LTIMindtree is a global technology consulting and digital solutions company that enables enterprises across industries to reimagine business models, accelerate innovation, and maximize growth by harnessing digital technologies.",
      "locations": ["Atlanta, GA"],
      "website": "https://www.ltimindtree.com",
      "markets": ["Consulting"],
      "jobSources": ["linkedin"],
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTcbGuB1CJJGnqF1Iq-z8z8VDv_jr9RnucSaVpD&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "fb08f90c-7505-4cf7-8426-2021dea8ee4f",
    "jobTitle": "Software Engineer Intern",
    "country": "United Kingdom",
    "city": "London",
    "state": "",
    "locationType": "Remote",
    "employmentType": "Internship",
    "dateCreated": "2024-11-09T14:32:10.218Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Python",
      "JavaScript",
      "Django",
      "Flask",
      "React",
      "SQL",
      "NoSQL"
    ],
    "shortDescription": "Software Engineer Intern position at a fast-growing startup focused on AI and sustainability solutions.",
    "longDescription": {
      "benefits": [
        "Gain hands-on experience with cutting-edge technologies in AI and ESG.",
        "Flexible work schedule with potential for a full-time role upon completion of the internship.",
        "Opportunity to make meaningful contributions to real-world projects from day one."
      ],
      "responsibilities": "Collaborate with our engineering team to design, develop, and test software features for GEMI.AI and related tools.",
      "qualification_required": {
        "skills": [
          "Python",
          "JavaScript",
          "Problem-solving",
          "Collaborative skills"
        ],
        "qualifications": [
          "Currently pursuing or recently graduated with a degree in Computer Science, Software Engineering, or a related field."
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Web development frameworks",
          "Familiarity with databases",
          "API development"
        ],
        "qualifications": [
          "Enthusiasm for ESG, sustainability, and AI technology."
        ]
      }
    },
    "benefits": [
      "Gain hands-on experience with cutting-edge technologies in AI and ESG.",
      "Flexible work schedule with potential for a full-time role upon completion of the internship.",
      "Opportunity to make meaningful contributions to real-world projects from day one."
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.linkedin.com/jobs/view/4068707402/",
    "jobType": "Backend Engineer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "About Us:\n\nLondon ESG Analytics is a fast-growing startup dedicated to helping businesses manage their environmental, social, and governance (ESG) performance using cutting-edge AI technology. Our flagship product, GEMI.AI, offers sustainability solutions across reporting, compliance, and data insights. We're passionate about driving positive impact for both companies and the planet, and we believe technology can play a pivotal role in shaping a better future.\n\nWe are looking for a motivated and enthusiastic Software Engineer Intern to join our team. This role is ideal for someone eager to develop their skills in AI, machine learning, and sustainability tech.\n\nWhat You’ll Do:\n\n* Collaborate with our engineering team to design, develop, and test software features for GEMI.AI and related tools.\n* Write clean, efficient, and maintainable code in Python, JavaScript, or similar languages.\n* Work on API integrations, data collection, and analysis to support our ESG data platform.\n* Assist in debugging, troubleshooting, and improving application performance.\n* Participate in code reviews, team meetings, and contribute to our agile development process.\n* Research and integrate the latest in AI and sustainability tech to keep our product cutting-edge.\n\nWhat We’re Looking For:\n\n* Currently pursuing or recently graduated with a degree in Computer Science, Software Engineering, or a related field.\n* Proficiency in programming languages such as Python, JavaScript, or equivalent.\n* Basic understanding of web development frameworks (e.g., Django, Flask, React) is a plus.\n* Familiarity with databases (SQL, NoSQL) and API development is a bonus.\n* Enthusiasm for ESG, sustainability, and AI technology.\n* Strong problem-solving skills and the ability to work in a collaborative, fast-paced environment.\n* Eager to learn and take initiative in a startup setting.\n\nWhy Join Us?\n\n* Be part of a mission-driven company making an impact on sustainability.\n* Gain hands-on experience with cutting-edge technologies in AI and ESG.\n* Work alongside a talented team of engineers, sustainability experts, and AI specialists.\n* Flexible work schedule with potential for a full-time role upon completion of the internship.\n* Opportunity to make meaningful contributions to real-world projects from day one.\n\nHow to Apply:\n\nSend your resume, a brief cover letter, and any project or code samples to people@londonesganalytics.co.uk. We look forward to hearing from you!",
    "company": {
      "name": "London ESG Analytics Ltd",
      "description": "Drive ESG strategy with Innovation. \n\nAt London ESG Analytics, we embody the principles of Environmental, Social, and Governance (ESG) to usher in a new era of corporate responsibility and innovation. As a catalyst for change, we are dedicated to shifting mindsets, cultivating sustainable habits, and driving actions that deliver impacts on society and the environment. Our role as an advocate is evident through our efforts to inspire individuals, build stronger community bonds, and mobilize collective action towards common goals. In the spirit of guardianship, we are passionately committed to championing humanity’s causes, revering the rich tapestry of biodiversity that our planet hosts, and diligently working to advance ecological equilibrium. \n\nWith these pillars, London ESG Analytics stands at the forefront of integrating ESG values into the core of business strategy, ensuring that every decision made drives economic growth and contributes positively to the well-being of our planet and its inhabitants.",
      "locations": ["New York, United States"],
      "website": "https://londonesganalytics.com",
      "markets": ["Strategic Management Services"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQGhBXKFFz7BHg/company-logo_400_400/company-logo_400_400/0/1706606074996/london_esg_analytics_ltd_logo?e=1737590400&v=beta&t=XweOrh1aFvxN8GZusIwDTOlYKGxRuGm847yDLAam3UU"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "f248b3b0-e049-47da-a85a-ad78c0b60cb6",
    "jobTitle": "Title of Lead Software Engineer (Java)",
    "country": "United States",
    "city": "Deerfield",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T14:11:29.383Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Java",
      "Spring boot",
      "microservices",
      "SQL",
      "NoSQL",
      "React",
      "JavaScript"
    ],
    "shortDescription": "Looking for a Senior Backend Engineer with proficiency in Java and experience in leading engineering teams.",
    "longDescription": {
      "benefits": [
        "Health care coverage",
        "Retirement savings plan",
        "Paid time off",
        "Employee discounts"
      ],
      "responsibilities": "Plans, designs, develops, and tests back-end software systems or applications for software enhancements and new products including cloud-based or internet-related tools. Leads a team of engineers and takes operational responsibility for projects.",
      "qualification_required": {
        "skills": [
          "Java back-end development",
          "Front-end development",
          "Mentoring skills",
          "Automated test scripting"
        ],
        "qualifications": [
          "Bachelor's degree in Computer Science or related field",
          "At least 5 years of professional experience in Engineering or Software Engineering"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Full stack proficiency",
          "Cloud technologies knowledge",
          "Experience with enterprise integration patterns"
        ],
        "qualifications": [
          "Experience contributing to financial decisions",
          "Strong focus on quality standards"
        ]
      }
    },
    "benefits": [
      "Health care coverage",
      "Retirement savings plan",
      "Paid time off",
      "Employee discounts"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobs.walgreens.com/en/job/-/-/1242/72640533008?codes=LinkedIn",
    "jobType": "Backend Engineer",
    "salaryMin": "127500",
    "salaryMax": "204000",
    "currency": "USD",
    "rawDescription": "Job Summary\n\nThis role demonstrates proficiency in all areas of the professional function and advanced in-depth specialization to perform and implement activities that impact components / processes of specified functional areas of the Walgreens Digital/Online application. This role is typically assigned to strategic, complex undertakings. Receives work in the form of short- and mid-term outcomes that regularly require the application of independent judgment and creativity.\n\nMentors less experienced members of the team. May lead teams / projects.\n\nJob Responsibilities\n\n* Plans, designs, develops and tests back-end software systems or applications for software enhancements and new products including cloud-based or internet-related tools.\n* Writes code that establishes and enhances coding specifications, typically for software programs and systems that have little or no precedence.\n* Delivers software features with exceptional quality, meeting designated release plans and delivery commitments.\n* Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions.\n* Leads the daily work of assigned work group / team. Recommends modifications to the daily operations of the assigned work group / team. Makes needed adjustments to short-term priorities.\n* Owns a functional area. Breaks large requests down into sub-tasks, gives higher-level status updates. Writes test plans. Takes operational responsibility. Sets measurable goals, and meets them. Reviews code changes.\n* Networks with senior internal and external personnel in own area of expertise. Interacts with direct team of accountability, peers and/or managers in other teams. May interact with vendors and/or customers to share information and improve workflow processes.\n* May design specifications of assigned projects and may lead in implementation.\n* Demonstrates proficiency in all areas of the professional function and advanced in-depth specialization in some.\n* Participates in developing technical / business approaches and new or enhanced technical tools. Has proven expertise in software design, architecture and software and system interrelationships. Has expert knowledge of programming languages important to the organization.\n* Sets software engineering project schedules, defines project parameters and tasks and monitors project tasks. Develops and keeps the \"vision\" of the project, leading others toward its completion.\n* Resolves a wide range of issues in creative ways.\n* Owns the development and rollout for an entire product, or large project. Champions process (Scrum, TDD, etc). Writes tech specs and identifies risks before starting major projects. Sets standards. Goes out of their way to reduce complexity. As needed, takes on additional “tech lead” responsibilities for driving an initiative to completion.\n* Allocates and tracks the work of individual contributors. Participates in teaching and training members of work group / team.\n\n“About Walgreens and WBA\n\nWalgreens (www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance, Inc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170-year heritage of caring for communities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations across America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination serving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system by providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for the nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a true omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to deliver high-quality products and services in communities nationwide.”\n\nThe actual salary an employee can expect to receive, plus bonus pursuant to the terms of any bonus plan if applicable, will depend on experience, seniority, geographic location, and other factors permitted by law. To review benefits, please visit jobs.walgreens.com/benefits.\n\n\"An Equal Opportunity Employer, including disability/veterans\".\n\nBasic Qualifications\n\n* Bachelor's degree in Computer Science, Information Technology or related field of study and at least 5 years of professional work experience in Engineering, Software Engineering or similar \n* Java back-end development experience with Java Spring boot microservices capabilities\n* Front-end development experience\n* At least 3 years of experience mentoring a team of engineers, working as a tech lead or leading an engineering team\n* Experience with programming languages for online applications, microservices or mobile applications or deployment automation\n* Experience designing/building moderately complex applications\n* Experience writing automated test scripts\n* Experience creating coding/scripting solutions to fix complex problems/issues\n* Experience engaging and the executive level\n* At least 2 years of experience contributing to financial decisions in the workplace.\n\nPreferred Qualifications\n\n* Enthusiastic about promoting high quality standards in the team across documentation, unit testing, code reviews, test automation & CI/CD\n* Hands on full stack proficiency (e.g., Java, NodeJS, ., SQL, NoSQL, React, JavaScript etc.)\n* Mentor team in the choice of Enterprise Integration patterns for a seamless integration with other enterprise & external assets\n* Big picture person with obsession about functional completeness, performance, security & resilience of end-to-end solution\n* Strong knowledge of implementation, security, capacity planning & performance tuning of solutions deployed to Cloud technologies – Azure (ACS, AKS), Google, IBM, AWS or Cloud Foundry\n\nWe will consider employment of qualified applicants with arrest and conviction records.",
    "company": {
      "name": "Walgreens",
      "description": "Walgreens (www.walgreens.com) is included in the U.S. Retail Pharmacy Segment of Walgreens Boots Alliance, Inc. (Nasdaq: WBA), a global leader in retail pharmacy. As America’s most loved pharmacy, health and beauty company, Walgreens purpose is more joyful lives through better health. Operating nearly 9,000 retail locations across America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination serving approximately 9 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system by providing a wide range of pharmacy and healthcare services. To best meet the needs of customers and patients, Walgreens offers a true omnichannel experience, with platforms bringing together physical and digital, supported by the latest technology to deliver high-quality products and services in local communities nationwide.",
      "locations": ["Deerfield, IL"],
      "website": "https://walgreens.com",
      "markets": ["Retail Pharmacies"],
      "jobSources": null,
      "logo": "https://d2q79iu7y748jz.cloudfront.net/s/_logo/1e2afe6342015cedf3a493c5d2088aa1"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "682653e5-f0eb-400d-b569-c75af9e9e400",
    "jobTitle": "Senior Software Engineer (Java)",
    "country": "United States",
    "city": "Deerfield",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T14:11:29.383Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Java",
      "Node/Typescript",
      ".NET",
      "Python",
      "Oracle",
      "MySQL",
      "MongoDB",
      "Cassandra"
    ],
    "shortDescription": "Seeking a Senior Software Engineer to develop and implement back-end software systems for Walgreens Digital/Online applications, utilizing Agile methodologies.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Plans, designs, develops and tests back-end software systems or applications for software enhancements and new products including cloud-based or internet-related tools. Writes code that meets specifications for large and highly complex software programs and systems. Develops software applications and tools using Agile development methodologies. Delivers software features with exceptional quality, meeting designated release plans and delivery commitments. Interacts with internal and external peers and managers to exchange complex information related to areas of specialization.",
      "qualification_required": {
        "skills": [
          "Software Development",
          "Agile Methodologies",
          "Problem Solving",
          "Mentoring"
        ],
        "qualifications": [
          "Bachelor's degree in Computer Science, Information Technology or related field",
          "At least 4 years of professional work experience in Engineering, Software Engineering or similar",
          "At least 3 years of experience writing code for moderately complex applications"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Full Stack Development",
          "UI Frameworks",
          "Enterprise Integration Design Patterns",
          "Cloud Technologies"
        ],
        "qualifications": [
          "At least 3 years of experience with software engineering best practices",
          "Experience with modern UI frameworks like React"
        ]
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobs.walgreens.com/en/job/-/-/1242/72640538384?codes=LinkedIn",
    "jobType": "Backend Engineer",
    "salaryMin": "127500",
    "salaryMax": "204000",
    "currency": "USD",
    "rawDescription": "Job Summary\n\nSeasoned, experienced professional with a full understanding of area of specialization, who will perform and implement activities that impact components / processes of specified functional areas of the Walgreens Digital/Online application. Anticipates and prevents problems and roadblocks before they occur. Typically assigned to important / complicated undertakings. Implements activities that generally impact important components / processes of the work of own unit / team / projects of the platform operation in an Agile environment.\n\nThis role is developing design skills, but has a comprehensive understanding of the organization's current software applications and tools. Has in-depth knowledge of programming languages important to the organization and is proficient with them. Receives work in the form of short- and mid-term assignments that regularly require the application of independent judgment. Mentors less experienced members of the team.\n\nJob Responsibilities\n\n* Plans, designs, develops and tests back-end software systems or applications for software enhancements and new products including cloud-based or internet-related tools.\n* Writes code that meets specifications for large and highly complex software programs and systems.\n* Develops software applications and tools. Participates in software design.\n* Develops software applications and tools using Agile development methodologies.\n* Delivers software features with exceptional quality, meeting designated release plans and delivery commitments\n* This role is assigned to important / complicated undertakings\n* Contributes to and participates actively in the design, architecture and build phases, to aim at producing high quality deliverables, working with existing architects where appropriate. Participates in the evaluation of compatibility of programs with existing communications hardware and software features.\n* Interacts with internal and external peers and managers to exchange complex information related to areas of specialization. Works closely with other team members in guiding software architecture and technology decisions.\n* Demonstrates proficiency in most areas of the professional function and in-depth specialization in some. Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Anticipates and prevents problems and roadblocks before they occur.\n* Networks with senior internal and external personnel in own area of expertise to exchange semi-complex information related to assigned activities.\n* Developing professional expertise, applies company policies and procedures to resolve a variety of issues.\n* Developing design skills. Has a comprehensive understanding of the organization's current software applications and tools. Has in-depth knowledge of programming languages important to the organization.\n* Resolves a wide range of issues in creative ways.\n* Developing design skills and has a comprehensive understanding of the organization's current software applications and tools. Has in-depth knowledge of programming languages important to the organization\n* Anticipates and prevents problems and roadblocks before they occur.\n* Mentors less experienced members of the team.\n\nAbout Walgreens and WBA\n\nWalgreens (www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance, Inc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170-year heritage of caring for communities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations across America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination serving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system by providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for the nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a true omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to deliver high-quality products and services in communities nationwide.\n\nThe actual salary an employee can expect to receive, plus bonus pursuant to the terms of any bonus plan if applicable, will depend on experience, seniority, geographic location, and other factors permitted by law. To review benefits, please visit jobs.walgreens.com/benefits.\n\n\"An Equal Opportunity Employer, including disability/veterans\".\n\nBasic Qualifications\n\n* Bachelor's degree in Computer Science, Information Technology or related field of study and at least 4 years of professional work experience in Engineering, Software Engineering or similar.\n* At least 3 years of experience writing code for moderately complex applications\n* At least 3 years of experience with programming languages for online applications, microservices or mobile applications\n* At least 3 years of experience designing/building moderately complex applications/automation\n* Experience writing automation test or deployment scripts\n* Experience creating coding/scripting solutions to fix moderately complex problems\n* Experience identifying operational issues and recommending and implementing strategies to resolve problems\n* Experience in design, development, security & scalability of high-volume services implemented in Java, Node/Typescript, .NET, or Python etc.\n* Experience of design, development, query & database optimization of distributed SQL (e.g., Oracle, MySQL) & NoSQL (MongoDB, Cassandra) databases\n* At least 2 years of experience contributing to financial decisions in the workplace.\n* At least 2 years of direct leadership, indirect leadership and/or cross-functional team leadership.\n* Willing to travel up to/at least 10% of the time for business purposes (within state and out of state).\n\nPreferred Qualifications\n\n* Experience with full stack development ranging from front-end user interfaces to back-end systems\n* At least 3 years of experience with software engineering best practices including coding standards, code reviews, source control management, build process, testing & operations\n* A mindset to take up most challenging coding tasks\n* Demonstrated experience of Enterprise Integration Design patterns in development of loosely coupled & resilient systems\n* Hands on with modern UI frameworks like React with excellent knowledge of client-side security & front-end design pattern (stateless components, conditional rendering, controlled components, hooks etc.)\n* Experience with implementation, security, capacity planning & performance tuning of solutions deployed to Cloud technologies – Azure (ACS, AKS), Google, IBM, AWS or Cloud Foundry\n\nWe will consider employment of qualified applicants with arrest and conviction records.",
    "company": {
      "name": "Walgreens",
      "description": "Walgreens (www.walgreens.com) is included in the U.S. Retail Pharmacy Segment of Walgreens Boots Alliance, Inc. (Nasdaq: WBA), a global leader in retail pharmacy. As America’s most loved pharmacy, health and beauty company, Walgreens purpose is more joyful lives through better health. Operating nearly 9,000 retail locations across America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination serving approximately 9 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system by providing a wide range of pharmacy and healthcare services. To best meet the needs of customers and patients, Walgreens offers a true omnichannel experience, with platforms bringing together physical and digital, supported by the latest technology to deliver high-quality products and services in local communities nationwide.",
      "locations": ["Deerfield, IL"],
      "website": "https://walgreens.com",
      "markets": ["Retail Pharmacies"],
      "jobSources": null,
      "logo": "https://d2q79iu7y748jz.cloudfront.net/s/_logo/1e2afe6342015cedf3a493c5d2088aa1"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "d3c3f412-ce95-477b-a403-cd3bd59e0a68",
    "jobTitle": "Senior Software Engineer (C++)",
    "country": "United States",
    "city": "Newport Beach",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Contract",
    "dateCreated": "2024-11-09T13:11:40.282Z",
    "experienceLevel": "Not specified",
    "techStack": ["C++", "C#", "video streaming", "conferencing systems"],
    "shortDescription": "Lead and manage a development team, contributing to code and ensuring high-quality development practices.",
    "longDescription": {
      "benefits": ["Great pay", "Collaborative team", "Stable company"],
      "responsibilities": "Lead and manage a development team, guiding projects from concept through delivery. Serve as a technical expert, contributing directly to code and ensuring high-quality development practices. Collaborate with cross-functional teams, aligning development efforts with broader project goals. Drive innovation by identifying and implementing new technologies and methodologies. Uphold engineering best practices, including code reviews, testing, and documentation. Oversee multiple projects, managing resources, timelines, and budgets to ensure successful outcomes. Promote a culture of collaboration, continuous improvement, and knowledge sharing. Stay current with industry trends to maintain a competitive edge. Apply expertise in specialized technologies to support product development.",
      "qualification_required": {
        "skills": ["leadership", "communication", "problem-solving"],
        "qualifications": [
          "10+ years of experience in software engineering",
          "Proficiency in C++ and C#",
          "Experience in mentoring and motivating teams"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "knowledge of digital solutions",
          "strategic decision-making"
        ],
        "qualifications": [
          "Experience in markets such as education, government, or sports is a plus",
          "Ability to identify technology and vendor partners aligned with organizational objectives"
        ]
      }
    },
    "benefits": ["Great pay", "Collaborative team", "Stable company"],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobot.com/apply/senior-software-engineer-c/536202041?utm_source=LinkedIn",
    "jobType": "Backend Engineer",
    "salaryMin": "110000",
    "salaryMax": "130000",
    "currency": "USD",
    "rawDescription": "Want to learn more about this role and Jobot Consulting? Click our Jobot Consulting logo and follow our LinkedIn page!\n\nJob details\n\nContract to Hire!\n\nThis Jobot Consulting Job is hosted by Omar Benabicha\n\nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.\n\nSalary $55 - $65 per hour\n\nA Bit About Us\n\nWe specialize in simplifying live video production by providing all-in-one solutions integrating advanced control and automation technologies.\n\nApply to learn more!\n\nWhy join us?\n\nGreat pay + benefits\n\nCollaborative team\n\nStable company\n\nJob Details\n\nResponsibilities\n\nLead and manage a development team, guiding projects from concept through delivery.\n\nServe as a technical expert, contributing directly to code and ensuring high-quality development practices.\n\nCollaborate with cross-functional teams, aligning development efforts with broader project goals.\n\nDrive innovation by identifying and implementing new technologies and methodologies.\n\nUphold engineering best practices, including code reviews, testing, and documentation.\n\nOversee multiple projects, managing resources, timelines, and budgets to ensure successful outcomes.\n\nPromote a culture of collaboration, continuous improvement, and knowledge sharing.\n\nStay current with industry trends to maintain a competitive edge.\n\nApply expertise in specialized technologies to support product development.\n\nQualifications\n\n10+ years of experience in software engineering, with a proven track record of both coding and team management.\n\nStrong leadership and communication skills, with experience mentoring and motivating teams.\n\nProficiency in programming languages such as C++, C#, and related technologies.\n\nKnowledge of specific video streaming and conferencing systems, digital solutions, and relevant technical protocols is highly desirable.\n\nDemonstrated problem-solving abilities and experience making strategic decisions in a fast-paced environment.\n\nAbility to work both independently and as part of a team in a hybrid work setup.\n\nWillingness to be based near or relocate to one of the company’s designated locations.\n\nAdditional Skills\n\nExperience in markets such as education, government, or sports is a plus.\n\nAbility to identify technology and vendor partners aligned with organizational objectives.\n\nValues\n\nStrive for excellence.\n\nValue and take pride in the work.\n\nPromote growth and help others achieve their best.\n\nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.\n\nWant to learn more about this role and Jobot Consulting?\n\nClick our Jobot Consulting logo and follow our LinkedIn page!",
    "company": {
      "name": "Jobot Consulting",
      "description": "Jobot Consulting is founded on Kindness, Respect + Results. Jobot Consultants specialize in building good things.",
      "locations": ["Tyngsborough, MA"],
      "website": "https://jobotconsulting.com",
      "markets": ["Business Consulting and Services"],
      "jobSources": null,
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQE4sV6gdPP4dg/company-logo_400_400/company-logo_400_400/0/1730481434533?e=1739404800&v=beta&t=qYx61aEJEdeGYXPeo9qnltn7LkZBfmoZfAqO6BKqWRs"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "355f686b-cacc-4290-8de1-284d0bbdb207",
    "jobTitle": "Senior Full Stack Software Developer - Remote",
    "country": "United States",
    "city": "Newport Beach",
    "state": "",
    "locationType": "Remote",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T13:11:39.925Z",
    "experienceLevel": "Not specified",
    "techStack": ["Node", "TypeScript", "React", "AWS"],
    "shortDescription": "Growing startup is looking for a Senior Software Engineer skilled in Node, TypeScript, React, & AWS.",
    "longDescription": {
      "benefits": [
        "NYC office, also open to 100% Remote Work - US or Canada based only",
        "Base salary + equity",
        "Full-paid medical dental, & vision benefits",
        "Growth Opportunity",
        "Great Culture and impact opportunity",
        "PTO, Vacation, Sick",
        "401K, and much more!"
      ],
      "responsibilities": "You will build and ship 2 new features on their customer facing product.",
      "qualification_required": {
        "skills": [
          "4+ years of experience in software development role",
          "at least 1 year in a full-stack capacity",
          "Experience with DeFi and/or blockchain technology"
        ],
        "qualifications": [
          "BS in CS",
          "deep understanding of computer science fundamentals"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Startup experience",
          "FAANG or similar crypto company experience",
          "Cloud experience with AWS or deep cloud providers"
        ],
        "qualifications": []
      }
    },
    "benefits": [
      "NYC office, also open to 100% Remote Work - US or Canada based only",
      "Base salary + equity",
      "Full-paid medical dental, & vision benefits",
      "Growth Opportunity",
      "Great Culture and impact opportunity",
      "PTO, Vacation, Sick",
      "401K, and much more!"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobot.com/apply/senior-full-stack-software-developer-remote/366948500?utm_source=LinkedIn",
    "jobType": "Full Stack Developer",
    "salaryMin": "150000",
    "salaryMax": "250000",
    "currency": "USD",
    "rawDescription": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!\n\nJob details\n\nGrowing startup is looking for a Senior Software Engineer skilled in Node, TypeScript, React, & AWS!\n\nThis Jobot Job is hosted by Sydney Weaver\n\nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.\n\nSalary $150,000 - $250,000 per year\n\nA Bit About Us\n\nGrowing startup in NYC is looking for a Senior Software Engineer to join their dynamic, growing team! This startup is backed by venture firms with a combined asset base exceeding $15 billion. Founded by former FAANG leaders and seasoned entrepreneurs from successful startups, the team brings extensive expertise in scaling groundbreaking technologies across Web3, DeFi, and privacy protocols.\n\nThis will be full-stack and perfect for someone who thrives on quick development cycles and someone looking to make making impactful contributions from the start. You will build and ship 2 new features on their customer facing product.\n\nWhy join us?\n\n*  NYC office, also open to 100% Remote Work - US or Canada based only\n*  Base salary + equity\n*  Full-paid medical dental, & vision benefits\n*  Growth Opportunity\n*  Great Culture and impact opportunity\n*  PTO, Vacation, Sick\n*  401K, and much more!\n\nJob Details\n\nQualifications\n\n*  4+ years of experience in software development role with at least 1 year in a full-stack capacity ,\n*  Experience with DeFi and/or blockchain technology, ecosystems, is highly preferred\n*  Startup experience also highly preferred and/or FAANG or similar crypto company experience\n*  Cloud experience with AWS or deep cloud providers\n*  BS in CS and a deep understanding of computer science fundamentals\n\n‍ - Previously held a prominent technical role at an established DeFi project\n\nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.\n\nWant to learn more about this role and Jobot?\n\nClick our Jobot logo and follow our LinkedIn page!",
    "company": {
      "name": "Jobot",
      "description": "Jobot is built on kindness + respect. Employee Owned since 2024. We are disrupting the recruiting, staffing and consulting worlds by combining AI - artificial intelligence - with incredible recruiters to fill jobs...and provide incredible service to our clients and candidates in the process. \n\nWe believe in building a positive culture focused on kindness, respect and results and being a great place to build a lasting career for our Jobot Pros. \n\nJobot started in 2018 and has been employee owned since 2024. \n\nWe are Jobot. Join us. \n🤖",
      "locations": ["New York, NY"],
      "website": "https://Jobot.com",
      "markets": ["Staffing and Recruiting"],
      "jobSources": ["dice"],
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQGRSXAomnI0Fw/company-logo_400_400/company-logo_400_400/0/1730477945496/jobot_logo?e=1739404800&v=beta&t=UZJzpIELcco5x1BUB_-_oUA0voFhF6TGieJpTdDI0NQ"
    },
    "isBookmarked": true,
    "isApplied": true
  },
  {
    "id": "ea976bfe-0cf5-43d9-a199-682c88fb9391",
    "jobTitle": "Senior / Lead Software Engineer - Remote",
    "country": "United States",
    "city": "Newport Beach",
    "state": "",
    "locationType": "Remote",
    "employmentType": "Contract",
    "dateCreated": "2024-11-09T13:11:11.233Z",
    "experienceLevel": "Not specified",
    "techStack": ["AWS", "Java", "Python", "DevOps", "CI/CD"],
    "shortDescription": "Fintech company is looking for a Senior and Lead level software engineer skilled in test automation for remote positions.",
    "longDescription": {
      "benefits": [
        "Blue Shield - Platinum or Silver Health Insurance",
        "Guardian Vision & Dental",
        "Health Advocacy Service",
        "Balance Care by ENI",
        "Life/Accidental Death & Disability",
        "401k",
        "Guideline 401K"
      ],
      "responsibilities": "Lead the architecture, design, and development of complex, cloud-based software solutions. Mentor and guide a team of engineers. Oversee system design, ensuring scalability, performance, and security. Implement and maintain CI/CD pipelines. Collaborate with cross-functional teams.",
      "qualification_required": {
        "skills": [
          "System design",
          "Object-oriented development",
          "Cloud technologies",
          "DevOps practices",
          "Test automation"
        ],
        "qualifications": [
          "Bachelor’s degree in Computer Science, Information Systems, or a related discipline",
          "At least 10 years of relevant experience for Lead position",
          "At least 7 years of relevant experience for Senior position"
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Test automation",
          "Performance optimization",
          "Software security"
        ],
        "qualifications": ["Previous experience in the financial sector"]
      }
    },
    "benefits": [
      "Blue Shield - Platinum or Silver Health Insurance",
      "Guardian Vision & Dental",
      "Health Advocacy Service",
      "Balance Care by ENI",
      "Life/Accidental Death & Disability",
      "401k",
      "Guideline 401K"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://jobot.com/apply/senior-lead-software-engineer-remote/1588982397?utm_source=LinkedIn",
    "jobType": "Full Stack Developer",
    "salaryMin": "110000",
    "salaryMax": "170000",
    "currency": "USD",
    "rawDescription": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!\n\nJob details\n\nFintech company is looking for a Senior and Lead level software engineer skilled in test automation!\n\nThis Jobot Job is hosted by Sydney Weaver\n\nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.\n\nSalary $55 - $85 per hour\n\nA Bit About Us\n\nA leading FinTech organization is seeking experienced software engineers to fill two critical remote positions Lead Software Engineer and Senior Software Engineer. These roles are long-term contract positions, requiring W2 employment. If you're passionate about building scalable, secure systems and have strong AWS expertise, this could be the perfect opportunity for you. Your focus will be on software engineering, with an 80% emphasis on development and a 20% emphasis on integrating testing and quality assurance. The work environment is remote, with two rounds of technical interviews, including hands-on coding and test strategy exercises, ensuring that only the most skilled candidates join this elite team.\n\nResponsibilities\n\n*  Lead Software Engineer (10+ Years of Experience) \n*  Lead the architecture, design, and development of complex, cloud-based software solutions.\n*  Mentor and guide a team of engineers, promoting best practices in software development and DevOps.\n*  Oversee system design, ensuring scalability, performance, and security across all solutions.\n*  Implement and maintain CI/CD pipelines, integrating automated testing to ensure high-quality releases.\n*  Collaborate with cross-functional teams to address technical challenges and deliver robust products.\n\nSenior Software Engineer (7+ Years of Experience)\n\n*  Design and develop software solutions with a focus on AWS cloud services.\n*  Participate in system architecture discussions and contribute to the design of scalable, secure systems.\n*  Write and review code in Java or Python, ensuring adherence to best practices in object-oriented development.\n*  Implement test automation strategies, including unit testing and performance optimization.\n*  Work closely with DevOps to streamline CI/CD processes and improve software delivery.\n\nWhy join us?\n\nJobot offers the following benefits for W2 Employees\n\n*  Blue Shield - Platinum or Silver Health Insurance\n*  Guardian Vision & Dental\n*  Health Advocacy Service \n*  Balance Care by ENI \n*  Life/Accidental Death & Disability \n*  401k \n*  Guideline 401K \n\nWhy Join Us?\n\n*  100% Remote Flexibility Work from anywhere while contributing to high-impact projects in the FinTech sector.\n*  Career Growth Long-term stability with opportunities to advance within a leading financial technology organization.\n*  Challenging Work Engage in meaningful work that directly impacts the financial industry, utilizing cutting-edge technology.\n*  Collaborative Environment Be part of a team that values innovation, quality, and continuous improvement.\n\nIf you're an experienced software engineer with the skills and drive to excel in a remote FinTech environment, we'd love to hear from you. Apply now and take the next step in your career!\n\nJob Details\n\nEducation And Experience Requirements\n\nLead Software Engineer\n\n*  Bachelor’s degree in Computer Science, Information Systems, or a related discipline.\n*  At least 10 years of relevant experience, or equivalent training and/or work experience.\n*  Extensive system design experience.\n*  Strong object-oriented development skills.\n*  Advanced experience with cloud technologies, particularly AWS.\n*  Expertise in data storage technologies and performance tuning.\n*  Solid experience in DevOps practices and CI/CD pipeline management.\n*  Proficiency in test automation, unit testing, and software security.\n\nSenior Software Engineer\n\n*  Bachelor’s degree in Computer Science, Information Systems, or a related discipline.\n*  At least 7 years of relevant experience, or equivalent training and/or work experience.\n*  Strong system design experience.\n*  Proficiency in object-oriented development.\n*  Significant experience with cloud technologies, particularly AWS.\n*  Knowledge of data storage technologies and performance optimization.\n*  Experience with DevOps practices and CI/CD tools.\n*  Skills in test automation, unit testing, and software security.\n*  Previous experience in the financial sector or with financial systems is highly desirable.\n*  Must be authorized to work in the USA and eligible to work on a W2 basis (no 1099 or C2C options available).\n\nInterview Process\n\nRound 1 A 1.5-hour software development exercise focused on Java.\n\nRound 2 A 2-hour exercise dedicated to developing a test strategy for a hypothetical product.\n\nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.\n\nWant to learn more about this role and Jobot?\n\nClick our Jobot logo and follow our LinkedIn page!",
    "company": {
      "name": "Jobot",
      "description": "Jobot is built on kindness + respect. Employee Owned since 2024. We are disrupting the recruiting, staffing and consulting worlds by combining AI - artificial intelligence - with incredible recruiters to fill jobs...and provide incredible service to our clients and candidates in the process. \n\nWe believe in building a positive culture focused on kindness, respect and results and being a great place to build a lasting career for our Jobot Pros. \n\nJobot started in 2018 and has been employee owned since 2024. \n\nWe are Jobot. Join us. \n🤖",
      "locations": ["New York, NY"],
      "website": "https://Jobot.com",
      "markets": ["Staffing and Recruiting"],
      "jobSources": ["dice"],
      "logo": "https://media.licdn.com/dms/image/v2/D560BAQGRSXAomnI0Fw/company-logo_400_400/company-logo_400_400/0/1730477945496/jobot_logo?e=1739404800&v=beta&t=UZJzpIELcco5x1BUB_-_oUA0voFhF6TGieJpTdDI0NQ"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "306785a8-e048-4bfe-a8df-d2ec6b8042f8",
    "jobTitle": "Software Engineering Intern - Summer 2025",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Internship",
    "dateCreated": "2024-11-09T13:10:36.182Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Python",
      "C",
      "C++",
      "Golang",
      "Linux",
      "Data science",
      "AI/ML",
      "Cloud software concepts",
      "Software development tools"
    ],
    "shortDescription": "Software Engineering Internship at Juniper Networks for students looking to gain hands-on experience in software development.",
    "longDescription": {
      "benefits": [
        "Medical benefits",
        "401(k) eligibility",
        "Vacation",
        "Sick time",
        "Parental leave"
      ],
      "responsibilities": "Interns will work on project-based tasks, contribute to team objectives, and solve important problems with mentorship from industry professionals.",
      "qualification_required": {
        "skills": [
          "Strong programming fundamentals",
          "Analytical and problem-solving skills",
          "Collaborative work abilities",
          "Strong communication skills"
        ],
        "qualifications": [
          "Enrolled in Bachelor's, Master's, or PhD program in EE, CS, or CE",
          "Graduating December 2025 or later"
        ]
      },
      "qualification_preferred": {
        "skills": ["Leadership experience", "Resourcefulness"],
        "qualifications": []
      }
    },
    "benefits": [
      "Medical benefits",
      "401(k) eligibility",
      "Vacation",
      "Sick time",
      "Parental leave"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.ziprecruiter.com/c/Juniper-Networks/Job/Software-Engineering-Intern-Summer-2025/-in-Sunnyvale,CA?jid=5d0b76910b51b89c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Software Engineering (SWE) Internship\n\nAre you a student looking to gain hands-on professional experience in software development? Would you like to gain that experience through a robust summer internship program...\n\nWe at Juniper Networks are seeking continuing students who are interested in Software Engineering Summer 2025 Internships.\n\nCandidates must be enrolled in a Bachelor's, Master's, or PhD program, preferably in EE, CS, or CE, graduating December 2025 or later.\n\nWe're looking for people who are excited about building infrastructure that global businesses rely on -- robust, high-performance software. Our environment is highly collaborative, fostering learning and teamwork, and encouraging all Junivators to take ownership of our collective success.\n\nOur software engineers work up and down the stack, from UI to device drivers; responsibilities and project areas vary by group. We recognize that you will bring your own unique skills and interests, and you will be matched to teams and projects accordingly. For our software roles, we generally look for at least one of the following:\n• Strong programming fundamentals, including algorithms and data structures\n• Proficiency in programming languages such as Python, C, C++, and/or Golang\n• Understanding of operating systems and/or computer networking concepts\n\nFor some of our projects, interest in or exposure to one or more of the following may be relevant:\n• Linux\n• Data science\n• AI/ML\n• Cloud software concepts\n• Software development tools such as version control\n\nAdditional qualities of a successful candidate include:\n• Analytical and problem-solving skills\n• Demonstrated track record of taking initiative and being resourceful\n• Ability to work collaboratively and solve problems\n• Strong communication skills, especially written\n• Leadership experience, whether formal or informal\n• Enthusiasm!\n\nIn addition, you will join our comprehensive University Talent Program that fosters personal as well as professional growth, thoroughly preparing interns for the next step in their careers.\n\nJuniper internships are project-based, allowing interns to solve important problems, make lasting impacts on their teams, and contribute to the company's overall objectives.\n\nInterns are mentored by some of the most talented and skillful innovators in the industry; you will connect with transformative thought leaders who promote disruptive ideas in their field. You will also participate in constructive professional workshops, company-wide community service initiatives, and an executive speaker series. You'll build lasting friendships, expand your network, and connect with colleagues from around the world.\n\nAt Juniper Networks, you will not only have opportunities to build real-life, hands-on work experience - you'll also have the chance to learn from the best and lay the groundwork for a successful career.\n\nJuniper's 2025 internship program is expected to be conducted in-person at one of our campus locations.\n\nABOUT JUNIPER NETWORKS\n\nJuniper Networks challenges the inherent complexity that comes with networking and security in the multicloud era. We do this with products, solutions and services that transform the way people connect, work and live. We simplify the process of transitioning to a secure and automated multicloud environment to enable secure, AI-driven networks that connect the world. Additional information can be found at Juniper Networks (www.juniper.net) or connect with Juniper on Twitter, LinkedIn and Facebook.\n\nWHERE WILL YOU DO YOUR BEST WORK?\n\nWherever you are in the world, whether it's downtown Sunnyvale or London, Westford or Bangalore, Juniper is a place that was founded on disruptive thinking - where colleague innovation is not only valued, but expected. We believe that the great task of delivering a new network for the next decade is delivered through the creativity and commitment of our people. The Juniper Way is the commitment to all our colleagues that the culture and company inspire their best work-their life's work. At Juniper we believe this is more than a job - it's an opportunity to help change the world...\n\nELIGIBILITY TO WORK AND E-VERIFY\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\nJuniper Networks participates in the E-Verify program. E-Verify is an Internet-based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that allows participating employers to electronically verify the employment eligibility of new hires and the validity of their Social Security Numbers.\n• Information for applicants about E-Verify / E-Verify Informacion en espanol: This Company Participates in E-Verify / Este Empleador Participa en E-Verify\n• Immigrant and Employee Rights Section (IER) - The Right to Work / El Derecho a Trabajar\n\nE-Verify is a registered trademark of the U.S. Department of Homeland Security.\n\nJuniper is an Equal Opportunity workplace and Affirmative Action employer. We do not discriminate in employment decisions on the basis of race, color, religion, gender (including pregnancy), national origin, political affiliation, sexual orientation, gender identity or expression, marital status, disability, genetic information, age, veteran status, or any other applicable legally protected characteristic. All employment decisions are made on the basis of individual qualifications, merit, and business need.\n\nMinimum Salary: $54,000.00\n\nMaximum Salary:$82,800.00\n\nThe pay range for this position is expected to be between $54,000.00 and $82,800.00/year; however, the base pay offered may vary depending on multiple individualized factors, including market location, job-related knowledge, skills, and experience. The total compensation package for this position also includes medical benefits, 401(k) eligibility, vacation, sick time, and parental leave. Additional details of participation in these benefit plans will be provided if an employee receives an offer of employment.\n\nIf hired, employee will be in an \"at-will position\" and the Company reserves the right to modify base salary (as well as any other payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.\n\nJuniper's pay range data is provided in accordance with local state pay transparency regulations. Juniper may post different minimum wage ranges for permanent residency petitions pursuant to US Department of Labor requirements.\n\nABOUT JUNIPER NETWORKS\n\nJuniper Networks is in the business of network innovation. From devices to data centers, from consumers to cloud providers, Juniper Networks delivers the software, silicon and systems that transform the experience and economics of networking. Our products and technology run the world's largest and most demanding networks today, enabling service providers, enterprises, and governments to create value and accelerate business success. Everyday our 9,000+ colleagues come together across 46 countries to realize our company vision - Connect Everything, Empower Everyone. We are innovating in ways that empower our customers, our partners and ultimately, everyone, in a connected world. These customers include the top 130 global service providers, 96 of the Fortune 100 and hundreds of public sector organizations.\n\nWHERE WILL YOU DO YOUR BEST WORK?\n\nWherever you are in the world, whether it's downtown Sunnyvale or London, Westford or Bangalore, Juniper is a place that was founded on disruptive thinking - where colleague innovation is not only valued, but expected. We believe that the great task of delivering a new network for the next decade is delivered through the creativity and commitment of our people. The Juniper Way is the commitment to all our colleagues that the culture and company inspire their best work-their life's work. At Juniper we believe this is more than a job - it's an opportunity to help change the world",
    "company": {
      "name": "Juniper Networks",
      "description": null,
      "locations": ["Sunnyvale, CA"],
      "website": null,
      "markets": null,
      "jobSources": null,
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSuIfvEpMOSTiPZDtdc7sn7zYzI_vdkkHuvC4C_&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "689e1e68-c6b1-4a55-947c-250e10fe608e",
    "jobTitle": "Sr. Software Engineer",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T13:02:39.523Z",
    "experienceLevel": "Not specified",
    "techStack": ["C#", "VB.Net", "VB6", "SQL", "Oracle", "DB2", "ASP", "MVC"],
    "shortDescription": "Seeking a Senior Software Engineer to participate in design and architecture discussions, and development of tailored solutions.",
    "longDescription": {
      "benefits": [],
      "responsibilities": "Definition of specifications, design, and development of tailored solutions in collaborative meetings. Mentorship and training as needed. Building relationships with both internal and external stakeholders to outline application requirements, procedures, and to design information-processing systems. Ensuring the functionality and performance of applications and troubleshooting issues. Development, testing, and debugging of intricate programs. Programming information and procedures documentation.",
      "qualification_required": {
        "skills": [
          "Extensive knowledge and experience in systems analysis, design, and programming",
          "Skills in writing and maintaining code",
          "Expertise in database systems and query writing",
          "Experience with website construction and programming practices",
          "Ability to gather requirements, analyze, and determine feasibility of design solutions",
          "Broad understanding of project lifecycle",
          "Willingness to embrace and learn new technical skills",
          "Ability to prioritize a heavy workload with quality and speed",
          "Independent decision-making capability",
          "Ability to communicate effectively and cooperatively with internal and external customers",
          "Ability to provide on-call support for system production on a rotating basis"
        ],
        "qualifications": []
      },
      "qualification_preferred": {
        "skills": [],
        "qualifications": []
      }
    },
    "benefits": [],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.roberthalf.com/us/en/job/davenport-ia/sr-software-engineer/01520-0013108632-usen?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Backend Engineer",
    "salaryMin": "80000",
    "salaryMax": "130000",
    "currency": "USD",
    "rawDescription": "﻿**MUST BE AUTHORIZED TO WORK IN USA**Robert Half is working with a Quad Cities based company that is looking for a Sr Software Engineer position. You would be a part of the design and architecture discussions, tech stack decisions for future and scaling platforms. The ideal candidate would be someone who is creative and enjoys solving problems and making an impact for the internal stakeholders. For additional details on the position, contact us at 319-362-8606 or connect with Bradley Christensen -Permanent Placement-Eastern Iowa at Robert Half Talent Solutions on LinkedIn.Primary Responsibilities Include:Definition of specifications, design, and development of tailored solutions in collaborative meetings Mentorship and training as needed Building relationships with both internal and external stakeholders to outline application requirements, procedures, and to design information-processing systemsEnsuring the functionality and performance of applications and troubleshooting any... issuesDevelopment, testing, and debugging of intricate programsProgramming information and procedures documentationCandidates will be Evaluated on their:Extensive knowledge and experience in systems analysis, design, and programmingSkills in writing and maintaining code (C#, VB.Net, VB6)Expertise in database systems and query writing (SQL, Oracle, DB2)Experience with website construction and programming practices (ASP, MVC)Ability to gather requirements, analyze, and determine feasibility of design solutionsBroad understanding of project lifecycleWillingness to embrace and learn new technical skillsAbility to prioritize a heavy workload with quality and speedIndependent decision-making capabilityAbility to communicate effectively and cooperatively with internal and external customersAbility to provide on-call support for system production on a rotating basisIf you are a highly passionate Software Developer who loves to solve complex issues and crave a dynamic work environment, we invite you to apply to be a part of our team",
    "company": {
      "name": "Robert Half",
      "description": "Robert Half, the world’s first and largest specialized talent solutions firm, connects opportunities at great companies with highly skilled job seekers.  We offer contract, temporary and permanent placement solutions for roles in finance and accounting, technology, marketing and creative, legal, and administrative and customer support. Named to Fortune’s World’s Most Admired Companies and 100 Best Companies to Work For® lists and a Forbes Best Employer for Diversity, Robert Half is the parent company of Protiviti®. Robert Half is traded on the New York Stock Exchange (symbol: RHI) and is a member of the S&P 500 index.",
      "locations": ["Davenport, IA"],
      "website": "https://roberthalf.com",
      "markets": ["Staffing and Recruiting"],
      "jobSources": ["dice"],
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRuHo0nBoLtZ39qxrZuOkjEaGG2chmB_4C6nPba&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "a3f7175e-4366-4811-900f-4c67cc6d5873",
    "jobTitle": "Senior Full-Stack Software Engineer (Java/Node)",
    "country": "",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T13:02:27.520Z",
    "experienceLevel": "Not specified",
    "techStack": [
      "Java",
      "Node.js",
      "Python",
      "SQL",
      "Mongo QL",
      "React JS",
      "Angular",
      "Azure",
      "GCP",
      "AWS",
      "Kubernetes"
    ],
    "shortDescription": "Seeking a Senior Full Stack Developer to build REST APIs and streaming applications while mentoring junior engineers.",
    "longDescription": {
      "benefits": [
        "full range of medical, dental, and vision benefits",
        "401(k) retirement savings plan",
        "Employee Stock Purchase Plan",
        "fully-paid term life insurance",
        "short-term and long term disability benefits",
        "well-being programs",
        "education assistance",
        "free development courses",
        "CVS store discount",
        "discount programs with participating partners",
        "Paid Time Off (PTO) or vacation pay",
        "paid holidays"
      ],
      "responsibilities": "Build REST APIs and Streaming applications. Build Application UI using JavaScript frameworks. Perform Code Reviews and mentor junior engineers. Deliver the software meeting various non-function/architectural requirements.",
      "qualification_required": {
        "skills": [
          "large-scale distributed applications",
          "APIs and Microservices",
          "front end development using React JS or Angular",
          "Agile-based development environment"
        ],
        "qualifications": [
          "5+ years of experience in software development",
          "Required: bachelor's degree in computer science, Engineering, Machine Learning, or related field or equivalent experience."
        ]
      },
      "qualification_preferred": {
        "skills": [
          "Cloud development experience",
          "CI/CD experience",
          "Frontend coding experience with React",
          "PaaS, SaaS development experience"
        ],
        "qualifications": ["Excellent written and verbal communication skills"]
      }
    },
    "benefits": [
      "full range of medical, dental, and vision benefits",
      "401(k) retirement savings plan",
      "Employee Stock Purchase Plan",
      "fully-paid term life insurance",
      "short-term and long term disability benefits",
      "well-being programs",
      "education assistance",
      "free development courses",
      "CVS store discount",
      "discount programs with participating partners",
      "Paid Time Off (PTO) or vacation pay",
      "paid holidays"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "https://www.themuse.com/jobs/cvshealth/senior-fullstack-software-engineer-javanode-70165c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "jobType": "Full Stack Developer",
    "salaryMin": "",
    "salaryMax": "",
    "currency": "USD",
    "rawDescription": "Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important... as what we deliver.\n\nOur Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.\n\nPosition Summary:\n\nCVS Health, a healthcare innovation company, is committed to providing Individuals, Employers, Healthcare professionals, producers, and others with innovative benefits, products, and services. The industry is evolving and the opportunities to drive real change and improve the health of millions are endless. If you are passionate about making a difference in the work you do, being recognized for your talent and expertise in solving complex and challenging clinical data problems while contributing to the success of key strategic initiatives, consider growing your career with a Fortune 4 healthcare leader!\n\nThe Senior Software Engineer will:\n• Build REST APIs and Streaming applications.\n• Build Application UI using JavaScript frameworks.\n• Perform Code Reviews and mentor junior engineers.\n• Deliver the software meeting various non-function/architectural requirements.\nRequired Qualifications:\n• 5+ years of experience building large-scale distributed applications preferably with Java/Node.js/Python\n• 2+ years of experience building out APIs and Microservices\n• 2+ years of experience with SQL or Mongo QL\n• 1+ years of experience in front end development using React JS or Angular\n• 1+ year of experience working in an Agile-based development environment using Agile concepts such as Continuous Integration (CI/CD) and Test-Driven Development (TDD)\nPreferred Qualifications:\n• Cloud development experience - Azure/GCP/AWS\n• CI/CD experience with Kubernetes\n• Frontend coding experience with React\n• PaaS, SaaS development experience\n• Excellent written and verbal communication skills\nEducation:\n\nRequired: bachelor's degree in computer science, Engineering, Machine Learning, or related field or equivalent experience.\n\nPay Range\n\nThe typical pay range for this role is:\n\n$83,430.00 - $222,480.00\n\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.\n\nIn addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.\n\nFor more detailed information on available benefits, please visit Benefits | CVS Health\n\nWe anticipate the application window for this opening will close on: 02/08/2025\n\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws",
    "company": {
      "name": "CVS Health",
      "description": null,
      "locations": ["Waverly, NY"],
      "website": null,
      "markets": null,
      "jobSources": null,
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQBbLYAov3_7UgLW5pqvaZ25bnybU_dvBiiQ5rW&s=0"
    },
    "isBookmarked": false,
    "isApplied": false
  },
  {
    "id": "112f0094-6b07-4928-957d-a0daed951c6b",
    "jobTitle": "Software Engineer",
    "country": "United States",
    "city": "",
    "state": "",
    "locationType": "On-site",
    "employmentType": "Full-time",
    "dateCreated": "2024-11-09T12:51:59.361Z",
    "experienceLevel": "Not specified",
    "techStack": ["Python", "Matlab"],
    "shortDescription": "We are seeking an early-career Software Development Engineer to join our team, focusing on developing software solutions for image and data processing.",
    "longDescription": {
      "benefits": [
        "401k with a 5% company match",
        "Comprehensive health, dental, and vision benefits",
        "Access to mental health services",
        "Scandinavian work culture that emphasizes work-life balance",
        "Team events and company-sponsored gatherings",
        "Relocation packages available for qualified candidates"
      ],
      "responsibilities": "Develop, test, and maintain Python-based software applications for image and data processing. Collaborate with interdisciplinary teams to design and implement real-world solutions. Ensure efficiency, scalability, and maintainability in code through best practices. Perform data analysis and image processing to support project goals. Integrate software with hardware systems, optimizing for compatibility and performance. Participate in code reviews and contribute to knowledge-sharing within the team. Troubleshoot and resolve software issues, ensuring reliable, high-performance solutions.",
      "qualification_required": {
        "skills": [
          "Python",
          "coding practices",
          "image processing",
          "data analysis",
          "hardware integration"
        ],
        "qualifications": [
          "Bachelor’s, Master’s, or PhD in Mechanical Engineering, Electrical Engineering, Vision Science, Biomedical Engineering, or a related field",
          "Software development experience"
        ]
      },
      "qualification_preferred": {
        "skills": ["Matlab", "color science principles"],
        "qualifications": []
      }
    },
    "benefits": [
      "401k with a 5% company match",
      "Comprehensive health, dental, and vision benefits",
      "Access to mental health services",
      "Scandinavian work culture that emphasizes work-life balance",
      "Team events and company-sponsored gatherings",
      "Relocation packages available for qualified candidates"
    ],
    "datePosted": "11/9/2024",
    "matchPercentage": 0,
    "jobUrl": "http://www.indeed.com/job/software-engineer-b5fbbf4328fe07b6",
    "jobType": "Full Stack Developer",
    "salaryMin": "80000",
    "salaryMax": "115000",
    "currency": "USD",
    "rawDescription": "**Job Overview**  \nWe are seeking an early\\-career **Software Development Engineer** to join our team in Redmond, WA, focusing on developing software solutions for image and data processing. Ideal candidates will have less than five years of experience, with a preference for recent graduates eager to apply their skills in a collaborative, interdisciplinary environment. This role requires strong Python skills and coding practices to address complex challenges, with color science and Matlab experience as valuable assets.\n\n**Job Responsibilities**\n\n* Develop, test, and maintain Python\\-based software applications for image and data processing.\n* Collaborate with interdisciplinary teams to design and implement real\\-world solutions.\n* Ensure efficiency, scalability, and maintainability in code through best practices.\n* Perform data analysis and image processing to support project goals.\n* Integrate software with hardware systems, optimizing for compatibility and performance.\n* Participate in code reviews and contribute to knowledge\\-sharing within the team.\n* Troubleshoot and resolve software issues, ensuring reliable, high\\-performance solutions.\n\n**Must\\-Have Requirements**\n\n* Bachelor’s, Master’s, or PhD in Mechanical Engineering, Electrical Engineering, Vision Science, Biomedical Engineering, or a related field, with software development experience.\n* Proficiency in Python and understanding of software development best practices.\n* Background in image processing, data analysis, and hardware integration.\n* Ability to write efficient, maintainable code.\n* Strong communication and problem\\-solving skills, with the ability to work independently.\n\n**Nice\\-to\\-Have Requirements**\n\n* Experience in Matlab for software development.\n* Knowledge of color science principles.\n\n**Experience Level**  \nThis position is intended for candidates with less than five years of experience, with a preference for fresh graduates who are ready to start their careers. On\\-the\\-job training is provided, making it a great opportunity for individuals from non\\-traditional software backgrounds eager to work on hardware\\-oriented projects.\n\n**Perks \\& Benefits**\n\n* 401k with a 5% company match\n* Comprehensive health, dental, and vision benefits\n* Access to mental health services\n* Scandinavian work culture that emphasizes work\\-life balance\n* Team events and company\\-sponsored gatherings\n* Relocation packages available for qualified candidates\n\n**Why OptoFidelity?**  \nJoin a dynamic, international team and contribute to groundbreaking projects with advanced robotics and global clients. We offer an open, collaborative culture where innovation and teamwork are encouraged, balanced by a supportive environment that values creativity and personal well\\-being.\n\nJob Type: Full\\-time\n\nPay: $80,000\\.00 \\- $115,000\\.00 per year\n\nBenefits:\n\n* 401(k) matching\n* Dental insurance\n* Health insurance\n* Paid time off\n* Vision insurance\n\nSchedule:\n\n* 8 hour shift\n* Monday to Friday\n\nWork Location: In person\n\n",
    "company": {
      "name": "OptoFidelity",
      "description": null,
      "locations": ["Redmond, WA"],
      "website": null,
      "markets": [null],
      "jobSources": null,
      "logo": null
    },
    "isBookmarked": false,
    "isApplied": false
  }
]
